       IDENTIFICATION DIVISION.
       PROGRAM-ID. ddd816.cob.
       AUTHOR. SID WAITE.
       DATE-COMPILED. TODAY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PAYCUR ASSIGN TO "S30" ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC  RECORD KEY IS PAYCUR-KEY
           LOCK MODE MANUAL.
           SELECT FILEIN ASSIGN TO "S35"
           ORGANIZATION LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  FILEIN.
       01  FILEIN01 PIC X(11).
       FD  PAYCUR
           BLOCK CONTAINS 6 RECORDS
           DATA RECORD IS PAYCUR01.
       01  PAYCUR01.
           02 PAYCUR-KEY.
             03 PC-KEY8 PIC X(8).
             03 PC-KEY3 PIC XXX.
           02 PC-AMOUNT PIC S9(4)V99.
           02 PC-PAYCODE PIC XXX.
           02 PC-DENIAL PIC XX.
           02 PC-CLAIM PIC X(6).
           02 PC-DATE-T PIC X(8).
           02 PC-DATE-E PIC X(8).
           02 PC-BATCH PIC X(6).
       WORKING-STORAGE SECTION.
       
       01  AMT PIC S9(4)V99.
       01  HOLD-KEY PIC X(8).

       PROCEDURE DIVISION.
       0005-START.
           OPEN I-O PAYCUR INPUT FILEIN.

       P1. 
           READ FILEIN AT END GO TO P2.
           MOVE FILEIN01 TO PAYCUR-KEY
           
           READ PAYCUR WITH LOCK 
             INVALID 
               DISPLAY "INVALID " PAYCUR-KEY
               GO TO P1.

           DELETE PAYCUR RECORD.

           GO TO P1.

       P2. 
           CLOSE PAYCUR. 
           STOP RUN.
