      * @package cms
      * @link    http://www.cmsvt.com
      * @author  s waite <cmswest@sover.net>
      * @copyright Copyright (c) 2020 cms <cmswest@sover.net>
      * @license https://github.com/openemr/openemr/blob/master/LICENSE GNU General Public License 3
       IDENTIFICATION DIVISION.
       PROGRAM-ID. rrr091.
       AUTHOR. SID WAITE.
       DATE-COMPILED. TODAY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT CARRIERFILE ASSIGN TO "S225" ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC RECORD KEY IS CAR-KEY
           ALTERNATE RECORD KEY IS CAR-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS CAR-CITY WITH DUPLICATES
           ALTERNATE RECORD KEY IS CAR-STATE WITH DUPLICATES
           LOCK MODE IS MANUAL.

           SELECT GARFILE ASSIGN TO "S45" ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC RECORD KEY IS GARNO
           ALTERNATE RECORD KEY IS G-ACCT WITH DUPLICATES
           LOCK MODE IS MANUAL
           STATUS IS GARFILE-STAT.

           SELECT TOWNADDR ASSIGN TO "S155" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS TOWN-KEY
           LOCK MODE IS MANUAL.

           SELECT PATFILE ASSIGN TO "S50" ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC RECORD KEY IS PATNO
           ALTERNATE RECORD KEY IS GUARNO WITH DUPLICATES
           LOCK MODE IS MANUAL
           STATUS IS PATFILE-STAT.

           SELECT INSFILE ASSIGN TO "S30" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS INS-KEY
           ALTERNATE RECORD KEY IS INS-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-CITY WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-ASSIGN WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-CLAIMTYPE WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-NEIC WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-NEIC-ASSIGN WITH DUPLICATES
           LOCK MODE IS MANUAL
           STATUS IS INSFILE-STAT.

           SELECT GAPFILE ASSIGN TO "S90" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS GAPKEY
           ALTERNATE RECORD KEY IS GAP-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS GAP-CITY WITH DUPLICATES
           ALTERNATE RECORD KEY IS GAP-STATE WITH DUPLICATES
           LOCK MODE IS MANUAL.

           SELECT MPLRFILE ASSIGN TO "S165" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS MPLR-KEY
           LOCK MODE IS MANUAL
           STATUS IS MPLRFILE-STAT.

           SELECT ADDRFILE ASSIGN TO "S230" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS ADDR-KEY
           ALTERNATE RECORD KEY IS ADDR-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS ADDR-STREET WITH DUPLICATES
           ALTERNATE RECORD KEY IS ADDR-CITY WITH DUPLICATES
           ALTERNATE RECORD KEY IS ADDR-STATE WITH DUPLICATES
           ALTERNATE RECORD KEY IS ADDR-ZIP WITH DUPLICATES
           LOCK MODE IS MANUAL
           STATUS IS ADDRFILE-STAT.

           SELECT COMPFILE ASSIGN TO "S235" ORGANIZATION IS INDEXED
           ACCESS MODE DYNAMIC RECORD KEY IS COMP-KEY
           LOCK MODE MANUAL.

       DATA DIVISION.
       FILE SECTION.
       FD  COMPFILE.
           copy compfile.cpy in "c:\users\sid\cms\copylib\rri".

       FD  CARRIERFILE.
       01  CARRIERFILE01.
           02 CAR-NAME PIC X(45).
           02 CAR-CITY PIC X(20).
           02 CAR-STATE PIC XX.
           02 CAR-KEY PIC XXX.

       FD  ADDRFILE.
       01  ADDRFILE01.
           02 ADDR-KEY PIC X(4). 
           02 ADDR-NAME PIC X(22).
           02 ADDR-STREET PIC X(24).
           02 ADDR-CITY PIC X(15).
           02 ADDR-STATE PIC XX.
           02 ADDR-ZIP PIC X(9).
           02 ADDR-FUTURE PIC X(6).

       FD  MPLRFILE.
       01  MPLRFILE01.
           02 MPLR-KEY PIC X(8). 
           02 MPLR-NAME PIC X(22).
           02 MPLR-STREET PIC X(24).
           02 MPLR-CITY PIC X(15).
           02 MPLR-STATE PIC XX.
           02 MPLR-ZIP PIC X(9).
           02 MPLR-CLAIMNO PIC X(15).
           02 MPLR-TRINS PIC XXX.
           02 MPLR-TR-ASSIGN PIC X.
           02 MPLR-TR-GROUP PIC X(10).
           02 MPLR-TRIPOL PIC X(16).
           02 MPLR-TR-NAME PIC X(24).
           02 MPLR-TR-RELATE PIC X.
           02 MPLR-FUTURE PIC X(6).

       FD GAPFILE.
       01 GAPFILE01.
           02 GAPKEY PIC X(7).
           02 GAP-NAME PIC X(25).
           02 GAP-ADDR PIC X(22).
           02 GAP-CITY PIC X(15).
           02 GAP-STATE PIC XX.
           02 GAP-ZIP PIC X(9).
           02 GAP-TYPE PIC X.
           02 GAP-FUTURE PIC X(40).

       FD  INSFILE.
       01  INSFILE01.
           02 INS-KEY PIC XXX.
           02 INS-NAME PIC X(22).
           02 INS-STREET PIC X(24).
           02 INS-CITY PIC X(15).
           02 INS-STATE PIC XX.
           02 INS-ZIP PIC X(9).
           02 INS-ASSIGN PIC X.
           02 INS-CLAIMTYPE PIC X.
           02 INS-NEIC PIC X(5).
           02 INS-NEICLEVEL PIC X.
           02 INS-NEIC-ASSIGN PIC X.
           02 INS-PPO PIC X.
           02 INS-PRVNUM PIC X(10).
           02 INS-HMO PIC X(3).
           02 INS-STATUS PIC X.
           02 INS-LEVEL PIC X.
           02 INS-LASTDATE PIC X(8).
           02 INS-CAID PIC XXX.
           02 INS-REFWARN PIC X.
           02 INS-FUTURE PIC X(8).

       FD PATFILE.
       01 PATFILE01.
           02 PATNO.
             03 IID1 PIC XXX.
             03 IID2 PIC XXX.
             03 IID3 PIC X.
             03 IID4 PIC X.
           02 GUARNO PIC X(8).
           02 PATNAME PIC X(24).
           02 P-SEX PIC X.
           02 P-RELATE PIC X.
           02 P-MSTAT PIC X.
           02 P-DOB PIC X(8).

       FD  TOWNADDR.
       01  TOWNADDR01.
           02 TOWN-KEY PIC XX.
           02 TOWN-CITY PIC X(18).
           02 TOWN-STATE PIC XX.
           02 TOWN-ZIP PIC X(5).

       FD GARFILE.
       01 GARFILE01.
           02 GARNO.
            03 ID1 PIC XXX.
            03 ID2 PIC XXX.
            03 ID3 PIC X.
            03 ID4 PIC X.
           02 GARNAME.
             03 GN1 PIC XXX.
             03 FILLER PIC X(21).
           02 G-BILLADD PIC X(22).
           02 STREET PIC X(22).
           02 CITY PIC X(18).
           02 STATE PIC X(2).
           02 G-ZIP PIC X(9).
           02 COLLT PIC X.
           02 PHONE PIC X(10).
           02 SEX PIC X.
           02 RELATE PIC X.
           02 MSTAT PIC X.
           02 DOB PIC X(8).
           02 DUNNING PIC X.
           02 ACCTSTAT PIC X.
           02 PR-MPLR PIC X(4).
           02 PRINS PIC XXX.
           02 PR-ASSIGN PIC X.
           02 PR-OFFICE PIC X(4).
           02 PR-GROUP PIC X(10).
           02 PRIPOL PIC X(16).
           02 PR-NAME PIC X(24).
           02 PR-RELATE PIC X.
           02 G-ADDRCODE PIC X(4).
           02 SEINS PIC XXX.
           02 SE-ASSIGN PIC X.
           02 TRINSIND PIC X.
           02 TRINS PIC XXX.
           02 SE-GROUP PIC X(10).
           02 SECPOL PIC X(16).
           02 SE-NAME PIC X(24).
           02 SE-RELATE PIC X.
           02 G-COPAY PIC S9(5)V99.
           02 LASTBILL PIC X(8).
           02 ASSIGNM PIC X.
           02 PRIVATE PIC X.
           02 BILLCYCLE PIC X.
           02 G-DELETE PIC X.
           02 G-FILLER PIC X(3).
           02 G-ACCT PIC X(8).
           02 G-PRGRPNAME PIC X(15).
           02 G-SEGRPNAME PIC X(15).

       WORKING-STORAGE SECTION.
       01  GARFILE-STAT.
           02 GARFILE-STAT1 PIC X.
           02 GARFILE-STAT2 PIC X.
       01  PATFILE-STAT.
           02 PATFILE-STAT1 PIC X.
           02 PATFILE-STAT2 PIC X.
       01  INSFILE-STAT.
           02 INSFILE-STAT1 PIC X.
           02 INSFILE-STAT2 PIC X.
       01  MPLRFILE-STAT.
           02 MPLR-STAT1 PIC X.
           02 MPLR-STAT2 PIC X.
       01  ADDRFILE-STAT.
           02 ADDRFILE-STAT1 PIC X.
           02 ADDRFILE-STAT2 PIC X.

       01  ANS          PIC XXX.
       01  ACTION.
           02 ACT-1 PIC X.
           02 ACT-2 PIC XX.
       01  DATAIN       PIC X(30).
       01  STATX               PIC XXX VALUE "O-K".
       01  IN-FIELD.
           02  IN-FIELD-20.
             03  IN-FIELD-15.
               04 IN-FIELD-10.
               05  IN-FIELD-9.
           06 IN-FIELD-8.
                 07  IN-FIELD-7.
                   08  IN-FIELD-6.
                     09  IN-FIELD-5.
                       10  IN-FIELD-4.
                         11  IN-FIELD-3.
                           12  IN-FIELD-2.
                             13  IN-FIELD-1  PIC X.
                             13  FILLER PIC X.
                           12  FILLER  PIC X.
                         11  FILLER    PIC X.
                       10  FILLER      PIC X.
                     09  FILLER        PIC X.
                   08  FILLER          PIC X.
           07 FILLER  PIC X.
           06 FILLER PIC X.
           05 FILLER PIC X.
               04  FILLER              PIC X(5).
             03  FILLER                PIC X(5).
           02  FILLER                  PIC X(5).
       01 IN-FIELD-TAB01 REDEFINES IN-FIELD.
           02 IN-FIELD-TAB   PIC X OCCURS 25 TIMES.
       01 LEN-TAB01-RE.
           
           02 FILLER PIC X(28) VALUE "0824221802090101010108010103".
           02 FILLER PIC X(32) VALUE "10160403101604100909090924012401".
           02 FILLER PIC X(18) VALUE "220101031212240101".
           
       01 LEN-TAB01 REDEFINES LEN-TAB01-RE.
           02 LEN-TAB   PIC 99 OCCURS 39 TIMES.

       01  Q           PIC 99 VALUE ZERO.
      * NUMERIC FIELD TESTS
       01  FIELD-CODE          PIC XX JUST RIGHT.
      * HOLDS THE POSITION OF A FIELD WITHIN IT'S DATA SET
       01  GD-TABLE-RE.
           05  DES-CONSTANT.
               10 FILLER PIC X(24) VALUE "GARNO   GARNAME STREET  ".
               10 FILLER PIC X(24) VALUE "CITY    STATE   ZIP     ".
               10 FILLER PIC X(16) VALUE "COLLT   SEX     ".
               10 FILLER PIC X(24) VALUE "RELATE  MARITAL BIRTH   ".
               10 FILLER PIC X(16) VALUE "DUNNING ACCTSTAT".
               10 FILLER PIC X(24) VALUE "PRI-INS PRIGROUPPOLICY #".
               10 FILLER PIC X(24) VALUE "PR-MPLR SEC-INS SECGROUP".
               10 FILLER PIC X(16) VALUE "SEC-POL#ADDRESS ".
               10 FILLER PIC X(24) VALUE "PHONE   BAL30   BAL60   ".
               10 FILLER PIC X(24) VALUE "BALCOL  CO-PAY  PR-NAME ".
               10 FILLER PIC X(24) VALUE "PR-RELATSE-NAME SE-RELAT".
               10 FILLER PIC X(24) VALUE "BILLADRSPR-ASGM.SE-ASGM.".
               10 FILLER PIC X(24) VALUE "TRINS   TR-GRP  TR-POL  ".
               10 FILLER PIC X(24) VALUE "TR-NAME TR-RELATTR-ASGN ".
               10 FILLER PIC X(16) VALUE "PRGROUP SEGROUP".

       01  GD-TABLE REDEFINES GD-TABLE-RE.
           05 DESC-FLD OCCURS 41 TIMES INDEXED BY INDX.
               10 DES-KEY  PIC X(8).
       01 ADD-FIELD-TABLE-RE.      
             05 ADD-CON.
             10 FILLER PIC X(22) VALUE "0231030405060809112214".
             10 FILLER PIC X(22) VALUE "1516272818192029303334".
             10 FILLER PIC X(10) VALUE "3536373839".
       01  ADD-FIELD-TABLE REDEFINES ADD-FIELD-TABLE-RE.
             05 ADD-FLD PIC 99 OCCURS 27 TIMES INDEXED BY ADD-KEY.
       01 PATLEN-TAB01-RE.
           02 FILLER PIC X(14) VALUE "08082401010108".
       01 PATLEN-TAB01 REDEFINES PATLEN-TAB01-RE.
           02 PAT-LEN-TAB   PIC 99 OCCURS 7 TIMES.
       01  PAT-GD-TABLE-RE.    
           05  PAT-DES-CONSTANT.
               10 FIL PIC X(24) VALUE "PATNO   GARNO   PATNAME ".
               10 FIL PIC X(24) VALUE "SEX     RELATE  M-STAT ".
               10 FIL PIC X(08) VALUE "DOB     ".
       01  PAT-GD-TABLE REDEFINES PAT-GD-TABLE-RE.
           05 PAT-DESC-FLD OCCURS 7 TIMES INDEXED BY PAT-INDX.
               10 PAT-DES-KEY  PIC X(8).
       
       01 PAT-ADD-FIELD-TABLE-RE.      
             05 PAT-ADD-CON.
             10 FILLER PIC X(12) VALUE "020304050607".
       01  PAT-ADD-FIELD-TABLE REDEFINES PAT-ADD-FIELD-TABLE-RE.
             05 PAT-A-FLD PIC 99 OCCURS 6 TIMES INDEXED BY PAT-A-KEY.
       
       01 MPLRLEN-TAB01-RE.
           02 FILLER PIC X(28) VALUE "1122241502091503011016240106".
       01 MPLRLEN-TAB01 REDEFINES MPLRLEN-TAB01-RE.
           02 MPLR-LEN-TAB   PIC 99 OCCURS 14 TIMES.
       
       01 MPLR-GD-TABLE-RE.    
           05  MPLR-DES-CONSTANT.
               10 FIL PIC X(24) VALUE "MPLRKEY CMP-NAMECMP-STRT".
               10 FIL PIC X(24) VALUE "CMP-CITYCMP--ST CMP--ZIP".
               10 FIL PIC X(24) VALUE "CMP-CLM#THRD-INSTHRD-ASG".
               10 FIL PIC X(24) VALUE "THRD-GRPTHRD-POLTHRDNAME".
               10 FIL PIC X(16) VALUE "THRD-RLTFUTURE ".
       01  MPRL-GD-TABLE REDEFINES MPLR-GD-TABLE-RE.
           05 MPLR-DESC-FLD OCCURS 10 TIMES INDEXED BY MPLR-INDX.
               10 MPLR-DES-KEY  PIC X(8).
       
       01 MPLR-ADD-FIELD-TABLE-RE.      
             05 MPLR-ADD-CON.
             10 FILLER PIC X(28) VALUE "0102030405060708091011121314".
       01  MPLR-ADD-FIELD-TABLE REDEFINES MPLR-ADD-FIELD-TABLE-RE.
             05 MPLR-A-FLD PIC 99 OCCURS 14 TIMES INDEXED BY MPLR-A-KEY.
       
       01 ADDRLEN-TAB01-RE.
           02 FILLER PIC X(28) VALUE "042224150209".
       
       01 ADDRLEN-TAB01 REDEFINES ADDRLEN-TAB01-RE.
           02 ADDR-LEN-TAB   PIC 99 OCCURS 7 TIMES.
       
       01 ADDR-GD-TABLE-RE.    
           05  ADDR-DES-CONSTANT.
               10 FIL PIC X(24) VALUE "ADDRKEY ADR-NAMEADR-STRT".
               10 FIL PIC X(24) VALUE "ADR-CITYADR--ST ADR--ZIP".
       01  ADDR-GD-TABLE REDEFINES ADDR-GD-TABLE-RE.
           05 ADDR-DESC-FLD OCCURS 6 TIMES INDEXED BY ADDR-INDX.
               10 ADDR-DES-KEY  PIC X(8).
       
       01 ADDR-ADD-FIELD-TABLE-RE.      
             05 ADDR-ADD-CON.
             10 FILLER PIC X(12) VALUE "010203040506".
       01  ADDR-ADD-FIELD-TABLE REDEFINES ADDR-ADD-FIELD-TABLE-RE.
             05 ADDR-A-FLD PIC 99 OCCURS 6 TIMES INDEXED BY ADDR-A-KEY.

       
       01 INS-LEN-TAB01-RE.
           02 FILLER PIC X(28) VALUE "0322241502090101050101011003".
           02 FILLER PIC X(10) VALUE "0101060301".
       01 INS-LEN-TAB01 REDEFINES INS-LEN-TAB01-RE.
           02 INS-LEN-TAB   PIC 99 OCCURS 19 TIMES.
       
       01  INS-GD-TABLE-RE.    
           05  INS-DES-CONSTANT.
               10 FIL PIC X(24) VALUE "INS-CODEINS-NAMEINSTREET".
               10 FIL PIC X(24) VALUE "INS-CITYINSTATE INS-ZIP ".
               10 FIL PIC X(24) VALUE "ACC-ASGNCLM-TYPENEICCODE".
               10 FIL PIC X(24) VALUE "NEICLEVLCLM-ASGNINS-TYPE".
               10 FIL PIC X(24) VALUE "PRVDRNUMINS-HMO STATUS  ".
               10 FIL PIC X(24) VALUE "LEVEL   INS-DATEVT-CAID#".
               10 FIL PIC X(08) VALUE "REFPRMPT".
       01  INS-GD-TABLE REDEFINES INS-GD-TABLE-RE.
           05 INS-DESC-FLD OCCURS 19 TIMES INDEXED BY INS-INDX.
               10 INS-DES-KEY  PIC X(8).
       
       01 INS-ADD-FIELD-TABLE-RE.       
             05 INS-ADD-CON.
             10 FILLER PIC X(24) VALUE "010203040506070809111213".
             10 FILLER PIC X(08) VALUE "14151819".
       01  INS-ADD-FIELD-TABLE REDEFINES INS-ADD-FIELD-TABLE-RE.
             05 INS-A-FLD PIC 99 OCCURS 16 TIMES INDEXED BY INS-A-KEY.
       
       01     NAME-LAST.
             03 NL-3.
               04 NL-31 PIC X.
               04 NL-32 PIC X.
               04 NL-33 PIC X.
             03 FILLER PIC X(21).
       01     NAME-TEST.
             03 NT-3.
               04 NT-31 PIC X.
               04 NT-32 PIC X.
               04 NT-33 PIC X.
             03 NT-21 PIC X(21).
       01  NAME-FIRST          PIC X(24).
       01  NAME-MIDDLE         PIC X(24).
       01  STATE-TABLE-CONSTANT.
           05  FILLER   PIC X(26) VALUE "AKALARAZCACNCOCTDCDEFLGAHI".
           05  FILLER   PIC X(24) VALUE "IAIDILINKSKYLAMAMDMEMIMN".
           05  FILLER   PIC X(24) VALUE "MOMSMTNCNDNENHNJNMNVNYOH".
           05  FILLER   PIC X(24) VALUE "OKORPAPRRISCSDTNTXUTVAVT".
           05  FILLER   PIC X(8)  VALUE "WAWIWVWY".
       01  STATE-TABLE REDEFINES STATE-TABLE-CONSTANT.
           05  STATE-2  PIC XX OCCURS 53 TIMES 
               ASCENDING KEY IS STATE-2 INDEXED BY S-2.
       
       01  INPUT-DATE.
           05  T-MM          PIC 99.
           05  T-DD          PIC 99.
           05  T-CC          PIC 99.
           05  T-YY          PIC 99.
       01  TEST-DATE.
           05  T-CC            PIC 99.
           
           05  T-YY            PIC 99.
           05  T-MM            PIC 99.
           05  T-DD            PIC 99.
       01  INPUT-DATE-S.
           05 T-MM  PIC 99.
           05 T-DD  PIC 99.
           05 T-CC  PIC 99.
           05 T-YY  PIC 99.
       01  TEST-DATE-S.
           05 T-CC  PIC 99.
           05 T-YY  PIC 99.
           05 T-MM  PIC 99.
           05 T-DD  PIC 99.
       01  DISPLAY-DATE.
           02 DD-MM PIC XX.
           02 FILLER PIC X VALUE "/".
           02 DD-DD PIC XX.
           02 FILLER PIC X VALUE "/".
           02 DD-CC PIC XX.
           02 DD-YY PIC XX.
       01  DISPLAY-DATE-S.
           02 T-MM PIC XX.
           02 FILLER PIC X VALUE "/".
           02 T-DD PIC XX.
           02 FILLER PIC X VALUE "/".
           02 T-CC PIC XX.
           02 T-YY PIC XX.
       01  MONTH-TABLE-CONS.
           05  FILLER PIC X(24) VALUE "312931303130313130313031".
       01  MONTH-TABLE REDEFINES MONTH-TABLE-CONS.
           05  DAYS-IN-MONTH OCCURS 12 TIMES PIC 99.

       01 NUM-EDIT-FIELDS.
           02  NEF-1    PIC ZZ.9  .
           02  NEF-2    PIC ZZZ.9  .
           02  NEF-3    PIC ZZZ.99  .
           02  NEF-4    PIC Z,ZZZ.99  .
           02  NEF-5    PIC Z,ZZZ.99-.
           02 NEF-A PIC Z,ZZZ.99-.
           02 NEF-B PIC Z,ZZZ.99-.
           02 NEF-C PIC Z,ZZZ.99-.
           02 NEF-D PIC ZZ,ZZZ.99CR.

       01  HOLD-MASTER  .
           02 HOLD-GARNO PIC X(8).
           02 FILLER PIC X(307).
       01  GARBACK PIC X(315).
       01  PATBACK PIC X(51).
       01  INSBACK PIC X(120).
       01  MPLRBACK PIC X(156).
       01  ADDRFILE-BACK PIC X(82).
       01     TOWN-FLAG PIC 9.
       01     ZERO-FLAG PIC 9.
       01     BUSNAME.
           03 BUSNAME1 PIC X.
           03 BUSNAME23 PIC X(23).
       01     RIGHT-2 PIC XX JUST RIGHT.
       01     ALF-1 PIC X.
       01     XALF-1 PIC X.
       01  ALF-4 PIC X(4).
       01     ALF-5 PIC X(5).
       01     ALF-7 PIC X(7).
       01     ALF-13 PIC X(13).
       01     PART24.
             03 THREEPARTID PIC XXX.
             03 FILLER PIC X(21).
       01     PART24TEST.
             03 TEST3 PIC XXX.
             03 FILLER PIC X(21).
       01     SIXPARTID PIC X(6).
       01     EIGHTPARTID PIC X(8).
       01     YEARDAY.
             03 YEAR-1.
               04 YD1 PIC X.
               04 YD2 PIC X.
             03 DAY3 PIC XXX.
       01     ABC PIC X.
       01     XYZ PIC 9.
       01     RIGHT-4 PIC X(4) JUST RIGHT.
       01     SIGN-DOLLAR PIC X(4).
       01     CENTS PIC XX.
       01 NUM-6 PIC 9(6).
       01 ALF-6 PIC X(6).
       01  ALF-8 PIC X(8).
       01  ALF-10.
           02 ALF-10-1 PIC XXX.
           02 ALF-10-2 PIC X(7).
       01  RIGHT-3 PIC XXX JUST RIGHT.
       01     RIGHT-5 PIC X(5) JUST RIGHT.
       01     RIGHT-7 PIC X(7) JUST RIGHT.
       01     NUM-3 PIC 999.
       01     NUM-9 PIC 9(9).
       01     NUM-7 PIC S9(7).
       01     A PIC 99.
       01     B PIC 99.
       01     C PIC 99.
       01     D PIC 99.
       01     X PIC 99.
       01     Y PIC 99.
       01  Z PIC 999.
       01     FLAG   PIC 9.
       01  MPLR-FLAG PIC 9.
       01  ADDR-FLAG PIC 9.
       01  TERT-FLAG PIC 9.
       01  FLAGX PIC 9.
       01     WORK1  PIC X(20) JUST RIGHT.
       01     NAME-CYCLE.
             03 NC1 PIC X.
             03 NC2 PIC X.
             03 FILLER PIC X(22).
       01 TEMP-FIELD01 PIC X(75).
       01 LLTAB2401.
           02 LLTAB24 PIC X OCCURS 24 TIMES.
       01 FFTAB1001.
           02 FFTAB10 PIC X OCCURS 10 TIMES.
       01  FF PIC 99.
       01 LL PIC 99.
       01 XLLTAB2401.
           02 XLLTAB24 PIC X OCCURS 24 TIMES.
       01 XFFTAB1001.
           02 XFFTAB10 PIC X OCCURS 10 TIMES.
       01 NP PIC S9 VALUE 0.
       01  GAR-TAB01.
           02 GAR-TAB PIC X(8) OCCURS 9 TIMES.
       01  ALF20 PIC X(20).
       01  ALF20A PIC X(20).
       01  BELL0 USAGE INDEX.
       01  NUM-2 PIC 99.
      *
       LINKAGE SECTION.
       01 GARPAT1 PIC 9.
       PROCEDURE DIVISION USING GARPAT1.
       0005-START.
           OPEN INPUT CARRIERFILE GAPFILE.
           OPEN INPUT GARFILE.
           OPEN INPUT PATFILE.
           OPEN INPUT INSFILE.
           OPEN INPUT MPLRFILE.
           OPEN INPUT ADDRFILE COMPFILE.
           OPEN INPUT TOWNADDR.
           IF GARPAT1 = 1 GO TO 1000-ACTION.
           MOVE 1 TO GARPAT1.
           MOVE 1 TO ZERO-FLAG.
           
       1000-ACTION.
           MOVE SPACES TO ACTION GARNO.
           MOVE 0 TO TOWN-FLAG.
           DISPLAY "OPTION,ID  GAR-PAT-INS-MPLR".
           ACCEPT DATAIN.
           IF DATAIN = "END" GO TO 9100-CLOSE-MASTER-FILE.
           IF DATAIN = "?"
           DISPLAY "GARNO RTNE. <FA,SG,FG,LG,AG,CG),<GARNO>"
      *     DISPLAY "PATN. RTNE. <SP,FP,LP,AP,CP>,<PATNO>"
           DISPLAY "INSURE. RTNE. <LI,AI,CI,FI>,<INS-CODE>"
           DISPLAY "ADDRESS. RTNE. <LS,AS,CS,FS>,<ADRS-CODE>"
           DISPLAY "WORKCOMP(091) ADDRESS RTNE. <LW,AW,CW,FW>,<GARNO>"
           DISPLAY "GAP = SEARCH MEDIGAP FILE"
           DISPLAY "END = END PROGRAM"
               GO TO 1000-ACTION.
           UNSTRING DATAIN DELIMITED BY "," INTO ACTION GARNO.
           IF ACTION = "SG" OR "FG" OR "LG" OR "AG" OR "CG" OR "CP"
           OR "FA" OR "SP" OR "GAP" OR "FW"
           OR "LI" OR "AI" OR "CI" OR "LW" OR "AW" OR "CW" OR "FI"
           OR "LS" OR "AS" OR "CS" OR "FS" OR "ZZ"
           NEXT SENTENCE ELSE DISPLAY "WHAT?" GO TO 1000-ACTION.
           IF ACTION = "AP" GO TO 2000-AP.
           IF ACTION = "AI" GO TO 2000-AI.
           IF ACTION = "AS" PERFORM 2000-AS THRU 2001-AS
             GO TO 1000-ACTION.
           IF ACTION = "CP" GO TO PAT-CP-0.
           IF ACTION = "FI" OR "LI" OR "CI" GO TO INS-LOOK.
           IF ACTION = "FS" OR "LS" OR "CS" GO TO ADDR-LOOK.
           IF ACTION = "FA" PERFORM FA-1 THRU FA-1-EXIT
           GO TO 1000-ACTION.
           IF ACTION = "ZZ" PERFORM ZZ-1 GO TO 1000-ACTION.
           IF ACTION = "FP" OR "SP" PERFORM 3600-FIND
           THRU 3600-FIND-EXIT GO TO 1000-ACTION.
           IF ACTION = "LP" MOVE GARNO TO PATNO
           PERFORM LP-1 THRU LP-1-EXIT GO TO 1000-ACTION.
           IF ACTION = "NP" PERFORM NP-1 GO TO 1000-ACTION.
           IF GARNO = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
           OR "7" OR "8" OR "9" MOVE GARNO TO FLAG
           MOVE GAR-TAB(FLAG) TO GARNO.
           IF ACTION = "AW" PERFORM 2000-AM THRU 2001-AM
           GO TO 1000-ACTION.  
           IF ACTION = "LW" OR "CW" GO TO MPLR-LOOK. 
           IF ACTION = "FW" GO TO MPLR-FIND.
           IF ACT-1 = "A" GO TO 1200-AP.
           IF ACT-1 = "S" OR  "F"
           PERFORM 2400-FIND THRU 2400-FIND-EXIT
           GO TO 1000-ACTION.
           IF ACT-1 = "L" PERFORM LG-1 THRU LG-1-EXIT
           GO TO 1000-ACTION.
           IF ACTION = "GAP" PERFORM SELECT-GAP THRU SELECT-EXIT
           GO TO 1000-ACTION.
           
           READ GARFILE INVALID KEY
           DISPLAY "NOT ON FILE" GO TO 1000-ACTION.
           IF GARFILE-STAT NOT = "00"
              DISPLAY "RECORD IS BEING MODIFIED" 
              DISPLAY GARFILE-STAT 
              GO TO 1000-ACTION
           END-IF
           DISPLAY GARNO " " GARNAME.
           MOVE GARNO TO MPLR-KEY
           MOVE 1 TO MPLR-FLAG TRINSIND
           MOVE 0 TO TERT-FLAG
           READ MPLRFILE INVALID 
           MOVE 0 TO MPLR-FLAG TRINSIND
           MOVE SPACE TO MPLRFILE01.
           GO TO 1400-CP.
       INS-LOOK.
           IF ACTION = "FI" 
              PERFORM INS-1 THRU INS-1-EXIT
              GO TO 1000-ACTION
           END-IF
           MOVE GARNO TO INS-KEY
           READ INSFILE INVALID 
               DISPLAY "INVALID"
               GO TO 1000-ACTION
           END-READ
           IF INSFILE-STAT NOT = "00" 
              DISPLAY "STATUS = " INSFILE-STAT
              DISPLAY "RECORD IS BEING MODIFIED "
              GO TO 1000-ACTION
           END-IF
           IF ACTION = "LI" 
              PERFORM LI-1 THRU LI-1-EXIT
              GO TO 1000-ACTION
           END-IF
           GO TO INS-CP.
       ADDR-LOOK.
           IF ACTION = "FS" 
               PERFORM ADDR-1 THRU ADDR-1-EXIT
               GO TO 1000-ACTION
           END-IF
           MOVE SPACE TO RIGHT-4
           UNSTRING GARNO DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING ALL " " BY "0".
           MOVE RIGHT-4 TO ADDR-KEY
           READ ADDRFILE INVALID 
                      DISPLAY "INVALID"
              GO TO 1000-ACTION
           END-READ
           IF ADDRFILE-STAT NOT = "00" 
              DISPLAY "STATUS = " ADDRFILE-STAT
              DISPLAY "RECORD BEING USED"
              GO TO 1000-ACTION
           END-IF
           IF ACTION = "LS" 
               PERFORM LS-1 
               GO TO 1000-ACTION
           END-IF
           GO TO ADDR-CP.

       MPLR-LOOK.
           MOVE GARNO TO MPLR-KEY
           DISPLAY "GARNO " GARNO
           ACCEPT OMITTED
           
           READ MPLRFILE INVALID 
               DISPLAY "INVALID"
               GO TO 1000-ACTION
           END-READ
           IF MPLRFILE-STAT NOT = "00" 
                  DISPLAY "RECORD CAN NOT BE MODIFIED"           
                  DISPLAY "STATUS = " MPLRFILE-STAT
           DISPLAY "RECORD BEING USED"
           GO TO 1000-ACTION.
           IF ACTION = "LW" 
                 PERFORM LM-1
                 GO TO 1000-ACTION
           END-IF
           IF MPLRFILE-STAT NOT = "00" 
                  DISPLAY "RECORD CAN NOT BE MODIFIED"          
                  DISPLAY "STATUS = " MPLRFILE-STAT
                  GO TO 1000-ACTION
           END-IF
           GO TO MPLR-CP.

       MPLR-FIND.
           MOVE GARNO TO MPLR-KEY
           START MPLRFILE KEY NOT < MPLR-KEY INVALID 
           DISPLAY "END OF FILE" GO TO 1000-ACTION.
           MOVE 0 TO X.

       MPLR-FIND1. 
           READ MPLRFILE NEXT AT END 
           DISPLAY "END OF FILE" GO TO 1000-ACTION.
           IF MPLR-NAME = SPACE GO TO MPLR-FIND1.
           MOVE MPLR-KEY TO GARNO
           READ GARFILE INVALID GO TO MPLR-FIND1.
           IF X > 6 ACCEPT ANS  MOVE 0 TO X
           IF ANS NOT = SPACE GO TO 1000-ACTION.
           DISPLAY GARNAME
           ADD 1 TO X
           PERFORM LM-1 GO TO MPLR-FIND1.

       1200-AP.
           MOVE ZERO TO G-COPAY LASTBILL MPLR-FLAG
           DOB COLLT.
           ACCEPT YEARDAY FROM DAY.
           MOVE YD2 TO PRIVATE.
           MOVE SPACES TO PHONE
           GARNAME STREET CITY STATE MSTAT SEX PR-OFFICE PRINS 
           PR-GROUP PRIPOL PR-NAME PR-RELATE PR-ASSIGN PR-MPLR
           SEINS SE-GROUP SECPOL SE-NAME SE-RELATE  G-ADDRCODE
           BILLCYCLE G-ZIP G-BILLADD G-DELETE G-FILLER MPLR-FUTURE
           MOVE "1" TO ACCTSTAT DUNNING
           MOVE "U" TO SE-ASSIGN 
           MOVE "1" TO ASSIGNM MOVE "001" TO SEINS TRINS
           MOVE "0" TO TRINSIND.
           PERFORM 1205-ADD-LOOP VARYING ADD-KEY FROM 1 BY 1
             UNTIL ADD-KEY > 27.
           IF IN-FIELD = "X" 
                 DISPLAY "NO UPDATE" 
                 GO TO 1000-ACTION
           END-IF
           MOVE GARFILE01 TO HOLD-MASTER.
           MOVE DAY3 TO ID2 NUM-3.
           MOVE GN1 TO ID1.
           MOVE 0 TO XYZ.
           MOVE "G" TO ID4.
       1210-AP.
           ADD 1 TO XYZ.
           MOVE XYZ  TO ID3.
           MOVE GARNO TO HOLD-GARNO.
           READ GARFILE INVALID GO TO 1220-AP.
           IF XYZ = 9 ADD 1 TO NUM-3
           MOVE NUM-3 TO ID2 MOVE 0 TO XYZ. GO TO 1210-AP.
           GO TO 1210-AP.
       1220-AP.
           CLOSE GARFILE
           OPEN I-O GARFILE
           MOVE HOLD-MASTER TO GARFILE01.
           MOVE HOLD-GARNO TO  GARNO.
           MOVE GARNO TO GAR-TAB(1)           
           
           WRITE GARFILE01 INVALID 
               DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
               DISPLAY GARFILE-STAT
               GO TO 1000-ACTION
           END-WRITE

           CLOSE GARFILE.
           OPEN INPUT GARFILE.
           DISPLAY GARNO " " GARNAME.
           DISPLAY "RECORD IS ADDED"
           IF TRINS = "001"
               GO TO 1000-ACTION
           END-IF
           MOVE GARNO TO MPLR-KEY
           MOVE MPLRFILE01 TO MPLRBACK
           CLOSE MPLRFILE
           OPEN I-O MPLRFILE
           MOVE MPLRBACK TO MPLRFILE01
           WRITE MPLRFILE01 
             INVALID
                DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY MPLRFILE-STAT
                CLOSE MPLRFILE
                OPEN INPUT MPLRFILE
                GO TO 1000-ACTION
           END-WRITE

           IF MPLRFILE-STAT NOT = "00"
                DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY MPLRFILE-STAT
                CLOSE MPLRFILE
                OPEN INPUT MPLRFILE
                GO TO 1000-ACTION
           END-IF
           CLOSE MPLRFILE
           OPEN INPUT MPLRFILE.
           GO TO 1000-ACTION.
       1205-ADD-LOOP.
           SET INDX TO ADD-FLD(ADD-KEY).
           PERFORM 2050-DISPLAY THRU 4910DEE.
       2400-FIND.
           MOVE SPACES TO  FFTAB1001 ACTION NAME-LAST.
           UNSTRING DATAIN DELIMITED BY "," INTO ACTION NAME-LAST
           FFTAB1001.
           MOVE NAME-LAST TO LLTAB2401.
           MOVE 0 TO FF LL.
           PERFORM FF-NAME VARYING X FROM 10 BY -1 UNTIL X < 1.
           PERFORM LL-NAME VARYING X FROM 24 BY -1 UNTIL X < 1.
           IF LL = 0 MOVE 1 TO LL.
           IF LLTAB24(LL) = "/"
           MOVE " " TO LLTAB24(LL) MOVE 24 TO LL.
           MOVE SPACE TO GARNO.
           IF ACTION = "SG" MOVE NAME-LAST TO GARNO
           ELSE MOVE NL-3 TO GARNO.
           START GARFILE KEY > GARNO INVALID
           DISPLAY " END OF FILE" GO TO 2400-FIND-EXIT.
       2400-FIND-20.
           MOVE 1 TO X.
           MOVE 0 TO FLAG.
           PERFORM 2400-SEARCH THRU 2400-SEARCH-EXIT.
           IF FLAG = 0 GO TO 2400-FIND-QUES.
           IF FLAG = 1 DISPLAY "END OF FILE FOUND"
           ELSE DISPLAY "NO MORE MATCHES ON NAME".
           DISPLAY "END OF SEARCH"
           GO TO 2400-FIND-EXIT.
       2400-FIND-QUES.
           DISPLAY "?".
           ACCEPT ANS.
           IF ANS = SPACES GO TO 2400-FIND-20.
           IF ANS = "?"
           DISPLAY "A <CR> WILL PRODUCE 10 MORE NAMES"
           DISPLAY "ANYTHING ELSE WILL RETURN YOU TO THE OPTION COMMAND"
           GO TO 2400-FIND-QUES.
           GO TO 2400-FIND-EXIT.
       2400-SEARCH.
           IF X > 8 GO TO 2400-SEARCH-EXIT.
           READ GARFILE NEXT AT END MOVE 1 TO FLAG
           GO TO 2400-SEARCH-EXIT.
           IF ACTION = "SG" GO TO 2400-S.
           MOVE SPACE TO NAME-TEST XFFTAB1001.
           UNSTRING GARNAME DELIMITED BY ";" INTO NAME-TEST XFFTAB1001.
           IF ((NT-31 = NL-31) AND (NL-32 = SPACE OR NL-33 = SPACE))
           OR (NT-3 = NL-3) NEXT SENTENCE
           ELSE MOVE 2 TO FLAG GO TO 2400-SEARCH-EXIT.
           MOVE NAME-TEST TO XLLTAB2401.
           MOVE 0 TO FLAGX PERFORM AQ1 VARYING Y FROM 1 BY 1 UNTIL
           Y > LL.
           IF FLAGX = 1 GO TO 2400-SEARCH.
           PERFORM AQ2 VARYING Y FROM 1 BY 1 UNTIL Y > FF.
           IF FLAGX = 1 GO TO 2400-SEARCH.
       2400-S.
           IF G-DELETE = SPACE AND ZERO-FLAG = "1" GO TO 2400-SEARCH.
           MOVE SPACE TO TEMP-FIELD01
           STRING GARNO "^" PRINS "/" SEINS  "^" GARNAME "^" CITY
           DELIMITED BY "   " INTO TEMP-FIELD01
           INSPECT TEMP-FIELD01 REPLACING ALL "^" BY " "
           MOVE GARNO TO GAR-TAB(X)
           DISPLAY X " " TEMP-FIELD01
           ADD 1 TO X
           GO TO 2400-SEARCH.
       2400-SEARCH-EXIT.
           EXIT.
       2400-FIND-EXIT. EXIT.
       3600-FIND.
           MOVE SPACES TO  FFTAB1001 ACTION NAME-LAST.
           UNSTRING DATAIN DELIMITED BY "," INTO ACTION NAME-LAST
           FFTAB1001.
           MOVE NAME-LAST TO LLTAB2401.
           MOVE 0 TO FF LL.
           PERFORM FF-NAME VARYING X FROM 10 BY -1 UNTIL X < 1.
           PERFORM LL-NAME VARYING X FROM 24 BY -1 UNTIL X < 1.
           IF LL = 0 MOVE 1 TO LL.
           IF LLTAB24(LL) = "/"
           MOVE " " TO LLTAB24(LL) MOVE 24 TO LL.
           MOVE SPACE TO PATNO.
           IF ACTION = "SP" MOVE NAME-LAST TO PATNO
           ELSE MOVE NL-3 TO PATNO.
           START PATFILE KEY > PATNO INVALID
           DISPLAY " END OF FILE" GO TO 3600-FIND-EXIT.
       3600-FIND-20.
           MOVE 1 TO X.
           MOVE 0 TO FLAG.
           PERFORM 3600-SEARCH THRU 3600-SEARCH-EXIT.
           IF FLAG = 0 GO TO 3600-FIND-QUES.
           IF FLAG = 1 DISPLAY "END OF FILE FOUND"
           ELSE DISPLAY "NO MORE MATCHES ON NAMES".
           DISPLAY "END OF SEARCH"
           GO TO 3600-FIND-EXIT.
       3600-FIND-QUES.
           DISPLAY "?".
           ACCEPT ANS.
           IF ANS = SPACES GO TO 3600-FIND-20.
           IF ANS = "?"
           DISPLAY "A <CR> WILL PRODUCE 10 MORE NAMES"
           DISPLAY "ANYTHING ELSE WILL END THE SEARCH"
           GO TO 3600-FIND-QUES.
           GO TO 3600-FIND-EXIT.
       3600-SEARCH.
           IF X > 8 GO TO 3600-SEARCH-EXIT.
           READ PATFILE NEXT AT END MOVE 1 TO FLAG
           GO TO 3600-SEARCH-EXIT.
           MOVE GUARNO TO GARNO.
           READ GARFILE INVALID KEY DISPLAY "THIS PATIENT HAS NO "
           "VALID GUARANTOR #."
           DISPLAY "THIS MUST NOT HAPPEN. CALL CMS IMMEDIATELY"
           DISPLAY "THIS PROGRAM TERMINATED"
           GO TO 9100-CLOSE-MASTER-FILE.
           IF ACTION = "SP" GO TO 3600-S.
           MOVE SPACE TO NAME-TEST XFFTAB1001.
           UNSTRING PATNAME DELIMITED BY ";" INTO NAME-TEST XFFTAB1001.
           IF ((NT-31 = NL-31) AND (NL-32 = SPACE OR NL-33 = SPACE))
           OR (NT-3 = NL-3) NEXT SENTENCE
           ELSE MOVE 2 TO FLAG GO TO 3600-SEARCH-EXIT.
           MOVE NAME-TEST TO XLLTAB2401.
           MOVE 0 TO FLAGX PERFORM AQ1 VARYING Y FROM 1 BY 1 UNTIL
           Y > LL.
           IF FLAGX = 1 GO TO 3600-SEARCH.
           PERFORM AQ2 VARYING Y FROM 1 BY 1 UNTIL Y > FF.
           IF FLAGX = 1 GO TO 3600-SEARCH.
       3600-S.
           MOVE PATNO TO GAR-TAB(X)
           MOVE SPACE TO TEMP-FIELD01.
           STRING PATNO ": " PATNAME ": " GARNO ": " GARNAME
           ": " CITY DELIMITED BY "   " INTO TEMP-FIELD01
           DISPLAY X " " TEMP-FIELD01.
           ADD 1 TO X
           GO TO 3600-SEARCH.
       3600-SEARCH-EXIT.
           EXIT.
       3600-FIND-EXIT. EXIT.
       1400-CP.
           MOVE SPACES TO FIELD-CODE IN-FIELD.
           DISPLAY "FIELD CODE,DATA?".
           ACCEPT DATAIN.
           IF DATAIN = "X"
               DISPLAY "NO CHANGE"  GO TO 1000-ACTION.
           IF DATAIN = "UP"  GO TO RE-WRITE-GARFILE.
           IF DATAIN = "LG" MOVE GARFILE01 TO GARBACK
              PERFORM LG-1-0 
              MOVE GARBACK TO GARFILE01 
              GO TO 1400-CP
           END-IF
           IF DATAIN = "?"
           DISPLAY "ENTER A FIELD CODE <COMMA> AND NEW DATA."
           DISPLAY "UP = UPDATE CHANGES"
           DISPLAY " X = NO CHANGE"
           DISPLAY "LG = LIST "
           DISPLAY "FIELD CODES: 2=GARNAME    3=STREET    4=CITY"
           DISPLAY " 5=STATE     6=ZIP        7=COLLT     8=SEX"
           DISPLAY " 9=RELAT    11=DOB       12=DUN      13=ACCSTAT"
           DISPLAY "14=PRINS    15=PR-GRP    16=PRIPOL"
           DISPLAY "18=SEINS    19=SE-GRP    20=SECPOL   21=ADDRESS"
           DISPLAY "22=PHONE    26=CO-PAY    27=PR-NAM   28=PR-RELATE"
           DISPLAY "29=SE-NAME  30=SE-RELATE 31=BILADRS"
           DISPLAY "32=PR-ASGN  33=SE-ASGN "
           DISPLAY "34=TRINS    35=TR-GRP    36=TR-POL   37=TR-NAME"
           DISPLAY "38=TR-RELATE             39=TR-ASGN"
           DISPLAY "40=PR-GROUPNAME          41=SE-GROUPNAME"
           GO TO 1400-CP.
           IF DATAIN = "REVINS"
             MOVE PRINS TO IN-FIELD-3
             MOVE SEINS TO PRINS
             MOVE IN-FIELD-3 TO SEINS
             MOVE PRIPOL TO IN-FIELD-20
             MOVE SECPOL TO PRIPOL
             MOVE IN-FIELD-20 TO SECPOL
             MOVE PR-GROUP TO IN-FIELD-15
             MOVE SE-GROUP TO PR-GROUP
             MOVE IN-FIELD-15 TO SE-GROUP
             MOVE PR-MPLR TO IN-FIELD-4
             MOVE G-ADDRCODE TO PR-MPLR
             MOVE IN-FIELD-4 TO G-ADDRCODE
             MOVE PR-NAME TO NAME-FIRST
             MOVE SE-NAME TO PR-NAME
             MOVE NAME-FIRST TO SE-NAME
             MOVE G-PRGRPNAME TO IN-FIELD
             MOVE G-SEGRPNAME TO G-PRGRPNAME
             MOVE IN-FIELD TO G-SEGRPNAME
             MOVE PR-RELATE TO IN-FIELD-1
             MOVE SE-RELATE TO PR-RELATE
             MOVE IN-FIELD-1 TO SE-RELATE
             MOVE PR-ASSIGN TO IN-FIELD-1
             MOVE SE-ASSIGN TO PR-ASSIGN
             MOVE IN-FIELD-1 TO SE-ASSIGN
             DISPLAY "INSURANCES REVERSED"
             GO TO RE-WRITE-GARFILE
           END-IF

           UNSTRING DATAIN DELIMITED BY "," INTO FIELD-CODE IN-FIELD.
           INSPECT FIELD-CODE REPLACING LEADING SPACE BY "0".
           IF FIELD-CODE NOT NUMERIC
               DISPLAY "FIELD-CODE MUST BE 2 DIGITS AND NUMERIC"
               GO TO 1400-CP.
           IF FIELD-CODE = "00"
               DISPLAY "FIELD CODE CANNOT BE ZERO OR BLANK"
               GO TO 1400-CP.
           IF ( FIELD-CODE < "02" OR > "41")
           DISPLAY "FIELD # MUST BE FROM 2-41".
           MOVE FIELD-CODE TO NUM-2
           SET INDX TO NUM-2
           GO TO 2060-GO-TO.
       2050-DISPLAY.
           DISPLAY DESC-FLD(INDX) "?".
       2051-INPUT.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "??"
           DISPLAY "LG = LIST RECORD BUILT SO FAR"
           DISPLAY "X = CANCEL ADD OF THIS RECORD"
           DISPLAY "BK = BACK TO PREVIOUS PROMPT"
           DISPLAY "? = DATA NEEDED FOR PROMPT"
           DISPLAY "OR ENTER DATA NEEDED"
           GO TO 2050-DISPLAY.
           IF IN-FIELD = "BK" AND ADD-KEY = 1 MOVE "X" TO IN-FIELD
           SET ADD-KEY TO 98 GO TO 4910DEE.
           IF IN-FIELD = "BK" GO TO 2060-BACK.
           IF IN-FIELD = "LG" PERFORM LG-1-0 THRU LG-1-EXIT
           GO TO 2050-DISPLAY.
           IF IN-FIELD = "X" SET ADD-KEY TO 98
             GO TO 4910DEE
           ELSE GO TO 2060-GO-TO.
       2060-BACK. IF INDX = 28 AND PRINS = "001"
           SET ADD-KEY TO 10
           SET INDX TO ADD-FLD(ADD-KEY)
           GO TO 2050-DISPLAY.
           IF INDX = 28 AND SEINS = "001"
           SET ADD-KEY TO 14
           SET INDX TO ADD-FLD(ADD-KEY)
           GO TO 2050-DISPLAY.
           IF INDX = 8 AND TOWN-FLAG = 1
           SET ADD-KEY TO 4
           SET INDX TO ADD-FLD(ADD-KEY)
           GO TO 2050-DISPLAY.
           IF INDX = 14 AND BUSNAME1 = "1"
           SET ADD-KEY TO 7
           SET INDX TO ADD-FLD(ADD-KEY)
           GO TO 2050-DISPLAY.
           SET ADD-KEY DOWN BY 1
           SET INDX TO ADD-FLD(ADD-KEY)
           GO TO 2050-DISPLAY.
       2060-GO-TO.
           MOVE 0 TO FLAG.
           MOVE LEN-TAB(INDX) TO Q ADD 1 TO Q.
           IF IN-FIELD-TAB(Q) NOT = " " MOVE "1" TO FLAG.
           IF FLAG = 1 DISPLAY "DATA TOO LONG, MUST NOT BE GREATER "
             "THAN " LEN-TAB(INDX) ".".
           IF FLAG = 1 AND ACT-1 = "C" GO TO 1400-CP.
           IF FLAG = 1 AND ACT-1 = "A" GO TO 2050-DISPLAY.
           GO TO 4900DEE 2120-GARNAME
             2130-STREET    2140-CITY    2150-STATE    2160-ZIP    
             2170-COLLT     2740-SEX     2750-RELATE   2190-MSTAT
             2450-DOB       2210-DUNNING 2220-ACCTSTAT 2230-PRINS  
             2240-PR-GROUP  2245-PRIPOL  4900DEE       3230-SEINS
             3240-SE-GROUP  3245-SECPOL  3221ADDR       2170-PHONE  
             4900DEE        4900DEE      4900DEE       2200-AMOUNT
             2-PRNAME       2-PRRELATE   2-SENAME      2-SERELATE 
             3250-BILLADD   2-PR-ASGM    2-SE-ASGM     2-TRINS 
             2-TR-GROUP     2-TRIPOL     2-TRNAME      2-TRRELATE   
             2-TR-ASGM  2-PRGRPNAME 2-SEGRPNAME
           DEPENDING ON INDX.
       2000TI.
           IF ACT-1 = "A" GO TO 2050-DISPLAY.
           IF ACT-1 = "C" GO TO 1400-CP.
           IF ACT-1 = "S" OR "F" GO TO 1000-ACTION.
       2100-GARNO.
           GO TO  4900DEE.
       2120-GARNAME.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE FULL NAME OF THE GUARANTOR"
               DISPLAY "LAST NAME  FIRST NAME  MIDDLE NAME"
               DISPLAY "SEPARATING EACH MAJOR PORTION OF THE NAME BY "
               DISPLAY "A SEMICOLON, IF THE GUAR. IS NOT A BUSINESS. "
           DISPLAY "EXAMPLE: ROBERT E. ST JOHN JR"
           DISPLAY "IS ENTERED AS"
               DISPLAY "ST JOHN JR;ROBERT;E."
           DISPLAY "FOR A BUSINESS THE 1ST CHARACTER MUST BE A 1"
           DISPLAY "THE REST OF THE NAME IS ENTERED AS IT IS WRITTEN"
           DISPLAY "NORMALLY IN LEFT TO RIGHT ORDER"
           DISPLAY "MEDICAL SERVICES,  LTD."
           DISPLAY "MUST BE ENTERED AS"
           DISPLAY "1MEDICAL SERVICES, LTD."
               GO TO 2000TI.
           MOVE SPACE TO BUSNAME.
           IF IN-FIELD-1 = SPACE DISPLAY "LEADING BLANKS NOT ALLOWED"
           " IN LAST NAME" GO TO 2000TI.
           IF IN-FIELD-1 = "1" MOVE IN-FIELD TO BUSNAME
           MOVE BUSNAME23 TO NAME-TEST GO TO 2125-NAME-TEST.
           MOVE SPACES TO NAME-LAST NAME-MIDDLE NAME-FIRST.
           UNSTRING IN-FIELD DELIMITED BY ";" INTO
               NAME-LAST NAME-FIRST NAME-MIDDLE.
           IF NAME-FIRST = SPACES OR IN-FIELD = SPACES
           DISPLAY "A FIRST NAME IS REQUIRED" GO TO 2000TI.
           MOVE SPACES TO NAME-TEST.
           IF NAME-MIDDLE = " " STRING NAME-FIRST " " NAME-LAST
               DELIMITED BY "  " INTO NAME-TEST GO TO 2125-NAME-TEST.
           STRING NAME-FIRST " " NAME-MIDDLE " " NAME-LAST " "
               DELIMITED BY "  " INTO NAME-TEST.
       2125-NAME-TEST.
           DISPLAY "OK? Y/N " NAME-TEST.
           ACCEPT ANS.
           IF ANS   = "N"   GO TO 2000TI.
           IF ANS = "Y"  GO TO 2126-GARNAME
           ELSE GO TO 2125-NAME-TEST.
       2126-GARNAME.
           IF ACT-1 = "A" GO TO 2127-GARNAME.
           MOVE IN-FIELD TO PART24TEST.
           MOVE GARNAME TO PART24.
           IF THREEPARTID NOT = TEST3
           DISPLAY "FIRST THREE LETTERS OF LAST NAME ARE NOT"
           DISPLAY "THE SAME. THIS NAME CHANGE MUST BE DONE"
           DISPLAY "USING THE BATCH NAME CHANGE ROUTINE RUN BY"
           DISPLAY "THE DATA CENTER AS IT EFFECTS ACCOUNT NUMBERS."
           GO TO 2000TI.
       2127-GARNAME.
           MOVE IN-FIELD TO GARNAME  .
           MOVE GARNAME TO NAME-CYCLE.
           IF NC1 = "1" GO TO 2320-BILLCYCLE.
           IF NC1 < "G" MOVE "1" TO BILLCYCLE GO TO 4900DEE.
           IF NC1 < "N" MOVE "2" TO BILLCYCLE GO TO 4900DEE.
           IF NC1 < "T" MOVE "3" TO BILLCYCLE GO TO 4900DEE.
           MOVE "4" TO BILLCYCLE GO TO 4900DEE.
       2320-BILLCYCLE. IF NC2 < "G" MOVE "1" TO BILLCYCLE
           GO TO 4900DEE.
           IF NC2 < "N" MOVE "2" TO BILLCYCLE GO TO 4900DEE.
           IF NC2 < "T" MOVE "3" TO BILLCYCLE GO TO 4900DEE.
           MOVE "4" TO BILLCYCLE GO TO 4900DEE.
       3250-BILLADD.
           IF IN-FIELD = "?"
               DISPLAY "ENTER APT # ETC, OR C/0 NAME"
              DISPLAY "FOR 1ST LINE OF ADDRESS"
              DISPLAY "OR LEAVE BLANK IF NOT NEEDED"
               GO TO 2000TI.
           MOVE IN-FIELD TO G-BILLADD
           GO TO 4900DEE.
       2130-STREET.
           IF IN-FIELD = "?"
               DISPLAY "ENTER STREET ADDRESS OR  <CR> "
               GO TO 2000TI.
           MOVE IN-FIELD TO STREET  .
           GO TO 4900DEE.
       2140-CITY.
           IF IN-FIELD = "?"
           DISPLAY "ENTER A 2-LETTER CODE IF IN TABLE"
           DISPLAY "ENTER F TO SEARCH TABLE FOR A TOWN CODE"
           DISPLAY "OR ENTER THE FULL TOWN NAME"
               GO TO 2000TI.
           IF IN-FIELD = SPACES
               DISPLAY "CANNOT ENTER A BLANK CITY"
               GO TO 2000TI.
           IF IN-FIELD = "F" GO TO 2141-CITY.
           MOVE IN-FIELD TO NAME-TEST.
           IF NAME-TEST(3:21) NOT = SPACES MOVE IN-FIELD TO CITY
           MOVE 0 TO TOWN-FLAG
           GO TO 4900DEE.
           MOVE IN-FIELD-2 TO TOWN-KEY
           READ TOWNADDR INVALID DISPLAY IN-FIELD-2 " NOT IN FILE"
           GO TO 2000TI.
           MOVE 1 TO TOWN-FLAG.
           MOVE TOWN-CITY TO CITY
           MOVE TOWN-STATE TO STATE
           MOVE TOWN-ZIP TO G-ZIP
           SET ADD-KEY UP BY 2 GO TO 4900DEE.
       2141-CITY.
           DISPLAY "SEARCH KEY".
           ACCEPT ALF-1.
           IF ALF-1 = "?"
           DISPLAY "ENTER A FIRST LETTER IN TOWN NAME"
           DISPLAY "TO START SEARCH" GO TO 2141-CITY.
           MOVE SPACES TO TOWN-KEY. MOVE ALF-1 TO TOWN-KEY.
           START TOWNADDR KEY > TOWN-KEY INVALID
           DISPLAY "END OF FILE" GO TO 2000TI.
           MOVE 0 TO X.
       2142-CITY.
           READ TOWNADDR NEXT AT END DISPLAY "END OF FILE"
           GO TO 2000TI.
           IF X > 4
           MOVE 0 TO X
           DISPLAY "?"
           ACCEPT ANS
           IF ANS NOT = SPACE GO TO 2000TI.
           DISPLAY TOWN-KEY " " TOWN-CITY
           ADD 1 TO X GO TO 2142-CITY.
       2150-STATE.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE OFFICIAL POSTAL  STATE CODE"
           DISPLAY "<CR> = VT"
               DISPLAY "SEE POSTAL STATE CODES"
               GO TO 2000TI.
           IF IN-FIELD = SPACE MOVE "VT" TO STATE GO TO 4900DEE.
           SEARCH ALL STATE-2   AT END
               DISPLAY "NOT A STATE CODE"
           MOVE IN-FIELD-2 TO STATE GO TO 4900DEE
           WHEN STATE-2(S-2) = IN-FIELD NEXT SENTENCE.
           MOVE IN-FIELD-2 TO STATE.
           GO TO 4900DEE.
       2160-ZIP.
           IF IN-FIELD = "?"
               DISPLAY "ENTER ZIP CODE OF GUARANTORS MAILING ADDRESS"
               DISPLAY "OR PUSH RETURN IF THE ZIP IS UNKNOWN"
               GO TO 2000TI.
           IF IN-FIELD-9 = SPACES MOVE ZEROS TO IN-FIELD-9.
           IF IN-FIELD-5 NOT NUMERIC
              DISPLAY "1ST 5 POSITIONS NOT NUMERIC; THERFORE,"
               DISPLAY "ZIP CODE ASSUMED TO BE INTERNATIONALE.".
           MOVE IN-FIELD TO G-ZIP GO TO 4900DEE.
       2170-COLLT.
           IF IN-FIELD = "?"
           DISPLAY "0-9 TO DEFINE A COLLECTION AGENCY."
           DISPLAY "A 0 MEANS NOT IN COLLECTION"
           DISPLAY "1-9 USER DEFINED COLLECTION AGENCIES."
           GO TO 2000TI.
           IF IN-FIELD-1 NOT NUMERIC DISPLAY "INVALID" GO TO 2000TI.
           MOVE IN-FIELD-1 TO COLLT GO TO 4900DEE.
       2170-PHONE.
           IF IN-FIELD = "?"
               DISPLAY "ENTER 10 DIGIT PHONE NUMBER OF GUARANTOR"
               DISPLAY "OR <CR> IF NOT KNOWN"
               GO TO 2000TI.
           IF IN-FIELD-10 NUMERIC OR IN-FIELD-10 = SPACES
           MOVE IN-FIELD-10 TO PHONE GO TO 4900DEE.
           IF IN-FIELD-7 NUMERIC AND IN-FIELD-TAB(8) = " "
           AND IN-FIELD-TAB(9) = " " AND IN-FIELD-TAB(10) = " "
           MOVE IN-FIELD-7 TO ALF-10-2
           MOVE "802" TO ALF-10-1
           MOVE ALF-10 TO PHONE GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2740-SEX.
           IF IN-FIELD = "?"
               DISPLAY "TRY M=MALE OR F=FEMALE."
               GO TO 2000TI.
           IF IN-FIELD = "M" OR "F" NEXT SENTENCE ELSE
               DISPLAY "GUESS AGAIN" GO TO 2000TI.
           MOVE IN-FIELD-1 TO SEX  GO TO 4900DEE.
       2750-RELATE.
           IF IN-FIELD = "?"
           DISPLAY "MALE:   2=ADULT  4=CHILD  5=STEPCHILD 8=PARTNER"
           DISPLAY "FEMALE: K=ADULT  M=CHILD  N=STEPCHILD Q=PARTNER"
           GO TO 2000TI.
           IF IN-FIELD = "2" OR "4" OR "5" OR "K" OR "M" OR "N"
           OR "8" OR "Q"
           MOVE IN-FIELD-1 TO RELATE GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2450-DOB.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE GUARANTOR''S BIRTH DATE USING"
               DISPLAY "USING THE FORMAT MMDDYYYY."
               DISPLAY "THE MONTH, DAY, AND YEAR - IN THAT ORDER"
               DISPLAY "EXAMPLE  MAY 8,1960  = 05081960"
               DISPLAY "EXAMPLE  DEC 15,2000 = 12152000"
               GO TO 2000TI.
           IF IN-FIELD-8 = SPACES MOVE ZEROS TO DOB
                GO TO 4900DEE.
           IF IN-FIELD-8 NOT NUMERIC
               DISPLAY "DATE MUST BE NUMERIC"
               GO TO 2000TI.
           MOVE IN-FIELD-8 TO INPUT-DATE.
           IF T-MM OF INPUT-DATE < 01 OR > 12
               DISPLAY "DATE MUST BE NUMERIC"
               GO TO 2000TI.
           IF T-DD OF INPUT-DATE > DAYS-IN-MONTH(T-MM OF INPUT-DATE)
               DISPLAY "DATE MUST BE NUMERIC"
               GO TO 2000TI.
           MOVE CORR INPUT-DATE TO TEST-DATE.
           MOVE TEST-DATE TO DOB  .
           GO TO 4900DEE.
       2190-MSTAT.
           IF IN-FIELD = "?"
               DISPLAY "ENTER M IF GUARANTOR IS MARRIED"
               DISPLAY "ENTER S IF GUARANTOR IS SINGLE"
               GO TO 2000TI.
           IF IN-FIELD = "M" OR "S" NEXT SENTENCE ELSE
               DISPLAY "INVALID" GO TO 2000TI.
           MOVE IN-FIELD-1 TO MSTAT  .
           GO TO 4900DEE.
       2210-DUNNING.
           IF IN-FIELD = "?"
           DISPLAY "1= NORMAL 2=NEW COLLECT 3=COLLECTION"
               GO TO 2000TI.
           IF IN-FIELD-1 < "1" OR IN-FIELD-1 > "4"
           DISPLAY "INVALID" GO TO 2000TI.
           MOVE IN-FIELD-1 TO DUNNING.
           GO TO 4900DEE.
       2220-ACCTSTAT.
           IF IN-FIELD = "?"
               DISPLAY "ENTER A DIGIT FROM 0-9"
               DISPLAY "FOR ACCOUNT STATUS"
           DISPLAY "0 = DISALLOW NEW CHARGES TO BE ADDED TO THE ACCT"
           DISPLAY "1 = NORMAL CYCLE BILLING  2-6 = # OF MONTHS HELD"
           DISPLAY "7 = DEMAND BILLING EVERY CYCLE 8 = BILL THIS TIME"
           DISPLAY "9 = DO NOT BILL EVER"
               GO TO 2000TI.
           IF IN-FIELD-1 < "0" OR IN-FIELD-1 > "9"
               DISPLAY "INVALID" GO TO 2000TI.
           MOVE IN-FIELD-1 TO ACCTSTAT  .
           IF ACCTSTAT > "1" AND < "7" DISPLAY "RE-AGEING NEEDED.".
           GO TO 4900DEE.
       2230-PRINS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE PRIMARY INSURANCE CODE (3-DIGITS)"
           DISPLAY "OR F TO SEARCH FOR A PROPER CODE"
               GO TO 2000TI.
           IF IN-FIELD = "F" PERFORM INS-1 THRU INS-1-EXIT GO TO 2000TI.
           MOVE SPACE TO RIGHT-3.
           UNSTRING IN-FIELD-3 DELIMITED BY " " INTO RIGHT-3.
           INSPECT RIGHT-3 REPLACING LEADING " " BY "0".
           MOVE RIGHT-3 TO IN-FIELD-3.
           IF IN-FIELD-3 = "062" DISPLAY "MEDIGAP MUST BE SECONDARY"
           GO TO 2000TI.
           MOVE RIGHT-3 TO INS-KEY
           READ INSFILE INVALID DISPLAY "INVALID" GO TO 2000TI.
           DISPLAY INS-ASSIGN " " INS-NEIC " " INS-NAME
           IF INS-STATUS = "1"
           DISPLAY "THIS INSURANCE IS CLOSED FOR USE" GO TO 2000TI.
           MOVE IN-FIELD-3 TO PRINS.
           MOVE INS-ASSIGN TO PR-ASSIGN
           IF PRINS = "001" AND ACTION = "AG" MOVE "001" TO SEINS
           MOVE "1" TO ASSIGNM
           SET ADD-KEY TO 98.
           GO TO 4900DEE.
       2240-PR-GROUP.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE PRIMARY GROUP #"
           GO TO 2000TI.
           IF SEINS NOT = "062"
           MOVE IN-FIELD TO PR-GROUP
           GO TO 4900DEE.
           DISPLAY "MEDIGAP ACCT" BELL0
           MOVE IN-FIELD TO GAPKEY
           READ GAPFILE INVALID DISPLAY "INVALID CODE"
           GO TO 2000TI.
           DISPLAY GAP-NAME " " GAP-ADDR " " GAP-CITY " " GAP-STATE
           " " GAP-ZIP
           MOVE IN-FIELD TO PR-GROUP
           GO TO 4900DEE.
       2245-PRIPOL.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE PRIMARY POLICY #"
           GO TO 2000TI.
           MOVE IN-FIELD TO PRIPOL.
           IF (PRINS = "003" OR "093") AND (IN-FIELD-TAB(10)
           = SPACE) DISPLAY "MEDICARE ACCTS NEED A SUFFIX" BELL0
           GO TO 2000TI.
           GO TO 4900DEE.
       3230-SEINS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE SECONDARY INSURANCE CODE (3-DIGITS)"
           DISPLAY "OR F TO SEARCH FOR A PROPER CODE."
           DISPLAY "062 = A MEDIGAP INSURER"
           DISPLAY "OTHER THAN VT MEDICAID OR MEDICOMP."
               GO TO 2000TI.
           IF IN-FIELD = "F" PERFORM INS-1 THRU INS-1-EXIT GO TO 2000TI.
           MOVE SPACE TO RIGHT-3.
           UNSTRING IN-FIELD-3 DELIMITED BY " " INTO RIGHT-3.
           INSPECT RIGHT-3 REPLACING LEADING " " BY "0".
           MOVE RIGHT-3 TO IN-FIELD-3.
           MOVE RIGHT-3 TO INS-KEY
           READ INSFILE INVALID DISPLAY "INVALID" GO TO 2000TI.
           DISPLAY INS-ASSIGN " " INS-NEIC " " INS-NAME
           IF INS-STATUS = "1"
           DISPLAY "THIS INSURANCE IS CLOSED FOR USE" GO TO 2000TI.
           IF (PRINS = "003" OR "028" OR "093" OR "098")
           AND (INS-KEY > "099" AND < "200")
           DISPLAY "PAPER CLAIM. NOT AN ELECTRONIC MEDIGAP CLAIM".
           IF (PRINS = IN-FIELD-3) AND (PRINS NOT = "001")
           AND (PRINS NOT = "024" AND PRINS NOT = "059")
           DISPLAY PRINS "/" IN-FIELD-2 " IS AN INVALID COMBINATION"
           GO TO 2000TI.
           MOVE IN-FIELD-3 TO SEINS.
           MOVE INS-ASSIGN TO SE-ASSIGN
      *    IF SE-ASSIGN = "S"
      *    MOVE "A" TO SE-ASSIGN.
           IF SEINS = "001" SET ADD-KEY TO 98 GO TO 4900DEE.
           IF SEINS NOT = "062" GO TO 4900DEE.
           IF INS-NAME = SPACE
           DISPLAY "MEDIGAP VALID FOR PARTICIPATING PROVIDERS ONLY"
           GO TO 2000TI.
           IF (PRINS NOT = "003" AND NOT = "028" AND NOT = "043")
           DISPLAY "MEDIGAP VALID ONLY FOR PRIMARY ASSIGNED MEDICARE"
           GO TO 2000TI.
           IF PR-GROUP = SPACE NEXT SENTENCE
           ELSE MOVE PR-GROUP TO GAPKEY
           READ GAPFILE INVALID DISPLAY "MEDIGAP CODE IS INVALID"
           MOVE SPACE TO GAPFILE01.
           DISPLAY PR-GROUP
           DISPLAY GAP-NAME " " GAP-ADDR " " GAP-CITY " " GAP-STATE
           " " GAP-ZIP.
           MOVE 1 TO FLAG
           PERFORM SELECT-GAP THRU SELECT-EXIT.
           IF FLAG = 1 GO TO 2000TI.
           MOVE GAPKEY TO PR-GROUP
           GO TO 4900DEE.
       3240-SE-GROUP.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE SECONDARY GROUP #"
           DISPLAY "IF THE SECONDARY IS VT-MEDICAID TYPE F)"
           DISPLAY "TO FIND THE CORRECT VT-MEDICAID CODE"
           DISPLAY "FOR THE PRIMARY INSURANCE!"
           GO TO 2000TI.
           IF (SEINS NOT = "004") AND (SEINS NOT = "064") 
           MOVE IN-FIELD TO SE-GROUP
           GO TO 4900DEE.
           IF IN-FIELD = "F"
           PERFORM CAR-1 THRU CAR-1-EXIT
           GO TO 2000TI.
           IF IN-FIELD-3 = "---"
           PERFORM VT-CAID
           MOVE INS-CAID TO SE-GROUP
           GO TO 4900DEE
           END-IF
           MOVE IN-FIELD-3 TO CAR-KEY
           READ CARRIERFILE INVALID
           DISPLAY "THIS IS AN INVALID MEDICAID CODE"
           DISPLAY "EITHER LOOK AGAIN OR TYPE --- TO GET"
           DISPLAY "THE DEFAULT CODE FROM THE INSURANCE FILE"
           GO TO 2000TI
           END-READ.
           MOVE IN-FIELD-3 TO SE-GROUP
           GO TO 4900DEE.
       VT-CAID.
           MOVE PRINS TO INS-KEY
           READ INSFILE INVALID MOVE SPACE TO INS-CAID
           END-READ.
       3245-SECPOL.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE SECONDARY POLICY #"
           GO TO 2000TI.
           IF IN-FIELD = "S" MOVE PRIPOL TO SECPOL
           DISPLAY "SAME AS PRIMARY" GO TO 4900DEE.
           MOVE IN-FIELD TO SECPOL.
           IF SECPOL = SPACE AND SE-ASSIGN NOT = "A"
           DISPLAY "ASSIGNED CODES SHOULD HAVE POLICY NUMBERS".
           GO TO 4900DEE.
       4010-PRIVATE.
           DISPLAY "YEAR ACCT ADDED TO SYSTEM"
           GO TO 2000TI.
       4000-ASSIGNM.
           IF IN-FIELD = "?"
           DISPLAY "1 = NO ZERO BAL. DETAIL"
           DISPLAY "2 = PRINT 0 BAL. DETAIL ON NEXT BILL ONLY"
           DISPLAY "3 = ALWAYS PRINT 0 BAL. DETAIL" GO TO 2000TI.
           IF IN-FIELD-1 = "1" OR "2" OR "3" NEXT SENTENCE
           ELSE DISPLAY "INVALID" GO TO 2000TI.
           MOVE IN-FIELD-1 TO ASSIGNM.
           GO TO 4900DEE.
       2310-BILLCYCLE.
           IF IN-FIELD = "?"
           DISPLAY "ENTER A ONE DIGIT BILLING CYCLE CODE"
           GO TO 2000TI.
           IF IN-FIELD-1 < "1" OR > "4"
           GO TO 2000TI.
            MOVE IN-FIELD-1 TO BILLCYCLE
           GO TO 4900DEE.
       2200-AMOUNT.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE AMOUNT OF CO-PAY PER VISIT"
           DISPLAY "<CR> = NO CO-PAY = 0"
           DISPLAY "EXAMPLE: $1,234,56 = 1234.56"
           DISPLAY "CENTS PORTION ASSUMED TO BE 00 IF NOT TYPED"
           DISPLAY "DECIMAL POINT IS OPTIONAL WHEN THIS IS THE CASE"
           GO TO 2000TI.
           MOVE SPACES TO SIGN-DOLLAR CENTS.
           UNSTRING IN-FIELD DELIMITED BY "." INTO SIGN-DOLLAR CENTS.
           IF CENTS = SPACES MOVE "00" TO CENTS.
           IF CENTS NOT NUMERIC DISPLAY "INVALID"
           GO TO 2000TI.
           MOVE SPACES TO RIGHT-4.
           UNSTRING SIGN-DOLLAR DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING LEADING " " BY "0"
           IF RIGHT-4 NOT NUMERIC DISPLAY "NOT NUMERIC"
           GO TO 2000TI.
           STRING RIGHT-4 CENTS DELIMITED BY "Z" INTO ALF-6
           MOVE ALF-6 TO NUM-6
           DIVIDE NUM-6 BY 100 GIVING G-COPAY.
           GO TO 4900DEE.
       2-PRNAME.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE NAME OF THE PRIMARY INSURED"
           DISPLAY "FOR NON MEDICARE,NON MEDICAID INSURANCES."
               DISPLAY "LAST NAME;FIRST NAME;MIDDLE INITIAL"
               DISPLAY "SEPARATING EACH MAJOR PORTION OF THE NAME BY "
               DISPLAY "A SEMICOLON. USE ONLY LASTNAME;FIRSTNAME;M.I."
           DISPLAY "DO NOT USE JR ,SR ,III   NO IMBEDDED BLANKS EITHER."
           DISPLAY "NAMES LIKE ROBERT E ST JOHN JR MUST BE ENTERED"
               DISPLAY "ONLY LIKE THIS... STJOHN;ROBERT;E"
           DISPLAY "ANYTHING ELSE WILL RESULT IN A REJECTION"
           DISPLAY "S = SAME NAME AS GUARANTOR"
               GO TO 2000TI.
           IF IN-FIELD = "S" MOVE GARNAME TO PR-NAME
           MOVE RELATE TO PR-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS GUARANTOR " PR-NAME GO TO 4900DEE.
           IF IN-FIELD-1 = SPACE DISPLAY "LEADING BLANKS NOT ALLOWED"
           " IN LAST NAME" GO TO 2000TI.
           MOVE SPACES TO NAME-LAST NAME-MIDDLE NAME-FIRST.
           UNSTRING IN-FIELD DELIMITED BY ";" INTO
               NAME-LAST NAME-FIRST NAME-MIDDLE.
           IF NAME-FIRST = SPACES OR IN-FIELD = SPACES
           DISPLAY "A FIRST NAME IS REQUIRED" GO TO 2000TI.
           MOVE SPACES TO NAME-TEST.
           IF NAME-MIDDLE = " " STRING NAME-FIRST " " NAME-LAST
               DELIMITED BY "  " INTO NAME-TEST GO TO 2-PRNAME-TEST.
           STRING NAME-FIRST " " NAME-MIDDLE " " NAME-LAST " "
               DELIMITED BY "  " INTO NAME-TEST.
       2-PRNAME-TEST.
           DISPLAY "OK? Y/N " NAME-TEST.
           ACCEPT ANS.
           IF ANS   = "N"   GO TO 2000TI.
           IF ANS = "Y"  MOVE IN-FIELD TO PR-NAME GO TO 4900DEE
           ELSE GO TO 2-PRNAME-TEST.
       2-PRRELATE.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CODE FOR THE PRIMARY INSURED"
           DISPLAY "MALE:   2=ADULT  4=CHILD  5=STEPCHILD 8=PARTNER"
           DISPLAY "FEMALE: K=ADULT  M=CHILD  N=STEPCHILD Q=PARTNER"
           GO TO 2000TI.
           IF IN-FIELD = "2" OR "4" OR "5" OR "K" OR "M" OR "N"
           OR "8" OR "Q"
           MOVE IN-FIELD-1 TO PR-RELATE GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2-SENAME.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE NAME OF THE SECONDARY INSURED"
           DISPLAY "FOR NON MEDICARE,NON MEDICAID INSURANCES."
               DISPLAY "LAST NAME;FIRST NAME;MIDDLE INITIAL"
               DISPLAY "SEPARATING EACH MAJOR PORTION OF THE NAME BY "
               DISPLAY "A SEMICOLON. USE ONLY LASTNAME;FIRSTNAME;M.I."
           DISPLAY "DO NOT USE JR ,SR ,III   NO IMBEDDED BLANKS EITHER."
           DISPLAY "NAMES LIKE ROBERT E ST JOHN JR MUST BE ENTERED"
               DISPLAY "ONLY LIKE THIS... STJOHN;ROBERT;E"
           DISPLAY "ANYTHING ELSE WILL RESULT IN A REJECTION"
           DISPLAY "S = SAME NAME AS GUARANTOR"
           DISPLAY "S1 = SAME NAME AS PRIMARY INSURED"
               GO TO 2000TI.
           IF IN-FIELD = "S" MOVE GARNAME TO SE-NAME
           MOVE RELATE TO SE-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS GUARANTOR " SE-NAME GO TO 4900DEE.
           IF IN-FIELD = "S1" MOVE PR-NAME TO SE-NAME
           MOVE PR-RELATE TO SE-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS PR-INSURED " SE-NAME GO TO 4900DEE.
           IF IN-FIELD-1 = SPACE DISPLAY "LEADING BLANKS NOT ALLOWED"
           " IN LAST NAME" GO TO 2000TI.
           MOVE SPACES TO NAME-LAST NAME-MIDDLE NAME-FIRST.
           UNSTRING IN-FIELD DELIMITED BY ";" INTO
               NAME-LAST NAME-FIRST NAME-MIDDLE.
           IF NAME-FIRST = SPACES OR IN-FIELD = SPACES
           DISPLAY "A FIRST NAME IS REQUIRED" GO TO 2000TI.
           MOVE SPACES TO NAME-TEST.
           IF NAME-MIDDLE = " " STRING NAME-FIRST " " NAME-LAST
               DELIMITED BY "  " INTO NAME-TEST GO TO 2-SENAME-TEST.
           STRING NAME-FIRST " " NAME-MIDDLE " " NAME-LAST " "
               DELIMITED BY "  " INTO NAME-TEST.
       2-SENAME-TEST.
           DISPLAY "OK? Y/N " NAME-TEST.
           ACCEPT ANS.
           IF ANS   = "N"   GO TO 2000TI.
           IF ANS = "Y"  MOVE IN-FIELD TO SE-NAME GO TO 4900DEE
           ELSE GO TO 2-SENAME-TEST.
       2-SERELATE.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CODE FOR THE SECONDARY INSURED"
           DISPLAY "MALE:   2=ADULT  4=CHILD  5=STEPCHILD 8=PARTNER"
           DISPLAY "FEMALE: K=ADULT  M=CHILD  N=STEPCHILD Q=PARTNER"
           GO TO 2000TI.
           IF IN-FIELD = "2" OR "4" OR "5" OR "K" OR "M" OR "N"
           OR "8" OR "Q"
           MOVE IN-FIELD-1 TO SE-RELATE GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2-PR-ASGM.
           IF IN-FIELD = "?"
           DISPLAY "A=ASSIGNED  S=SOMETIMES ASSIGNED  U=UN-ASSIGNED"
           DISPLAY "S WILL ALLOW A CHOICE OF ASSIGNMENT FOR EACH CHARGE"
           DISPLAY "A AND U ARE WHAT WILL BE CODES ON EACH CHARGE"
           GO TO 2000TI.
           IF IN-FIELD-1 = "U" OR "S" OR "A" MOVE IN-FIELD-1 TO
           PR-ASSIGN GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2-SE-ASGM.
           IF IN-FIELD = "?"
           DISPLAY "A=ASSIGNED  OR U=UN-ASSIGNED"
           DISPLAY "S IS NOT ALLOWED AS CHOICE FOR SECONDARY"
           GO TO 2000TI.
           IF IN-FIELD-1 = "U" OR "A" MOVE IN-FIELD-1 TO
           SE-ASSIGN GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2-PRGRPNAME.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE NAME OF THE PRIMARY"
           DISPLAY "INSURANCE GROUP"
           GO TO 2000TI.
           MOVE IN-FIELD TO G-PRGRPNAME
           DISPLAY "INVALID" GO TO 2000TI.
       2-SEGRPNAME.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE NAME OF THE SECONDARY"
           DISPLAY "INSURANCE GROUP"
           GO TO 2000TI.
           MOVE IN-FIELD TO G-PRGRPNAME
           DISPLAY "INVALID" GO TO 2000TI.


       3221ADDR.
           IF IN-FIELD = "?"
           DISPLAY "F = SEARCH ADDRESS FILE   <CR> = SKIP"
           DISPLAY "ENTER THE 4-DIGIT ADDRESS ID"
           GO TO 2000TI.
           IF IN-FIELD = SPACE
           MOVE SPACE TO G-ADDRCODE
           GO TO 4900DEE.
           IF IN-FIELD-1 = "F"
           PERFORM ADDR-1 THRU ADDR-1-EXIT
           GO TO 2000TI.
           MOVE SPACE TO RIGHT-4
           UNSTRING IN-FIELD-4 DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING LEADING " " BY "0"
           MOVE RIGHT-4 TO IN-FIELD-4
           MOVE IN-FIELD-4 TO ADDR-KEY
           READ ADDRFILE INVALID DISPLAY "INVALID" GO TO 2000TI.
           DISPLAY ADDR-NAME " " ADDR-STREET " " ADDR-CITY " "
           ADDR-STATE " " ADDR-ZIP.
           MOVE IN-FIELD-4 TO G-ADDRCODE
           GO TO 4900DEE.
       2-TRINS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE TERTIARY INSURANCE CODE (3-DIGITS)"
           DISPLAY "OR F TO SEARCH FOR A PROPER CODE."
           DISPLAY "IF 091 IS USED ADD AN ADDRESS FOR THE CLAIM" 
           DISPLAY "USING THE <AW> ROUTINE"
           GO TO 2000TI.
           IF IN-FIELD = "F" PERFORM INS-1 THRU INS-1-EXIT GO TO 2000TI.
           MOVE SPACE TO RIGHT-3.
           UNSTRING IN-FIELD-3 DELIMITED BY " " INTO RIGHT-3.
           INSPECT RIGHT-3 REPLACING LEADING " " BY "0".
           MOVE RIGHT-3 TO IN-FIELD-3.
           IF IN-FIELD-3 = "062" DISPLAY "MEDIGAP CANT BE THIRD"
           GO TO 2000TI.
           IF IN-FIELD-3 = "001"
                   SET ADD-KEY TO 98
                   MOVE "001" TO TRINS 
                   GO TO 4900DEE
           END-IF
           MOVE RIGHT-3 TO INS-KEY
           READ INSFILE INVALID 
                DISPLAY "INVALID" 
                GO TO 2000TI
           END-READ
           DISPLAY INS-ASSIGN " " INS-NEIC " " INS-NAME
           IF INS-STATUS = "1"
           DISPLAY "THIS INSURANCE IS CLOSED FOR USE" GO TO 2000TI.
           IF (PRINS = IN-FIELD-3) OR (SEINS = IN-FIELD-3)
           DISPLAY PRINS "/" SEINS "/" IN-FIELD-2 
           " IS AN INVALID COMBINATION"  GO TO 2000TI.
           MOVE IN-FIELD-3 TO TRINS.
           MOVE INS-ASSIGN TO MPLR-TR-ASSIGN
           MOVE 1 TO TERT-FLAG
           GO TO 4900DEE.
       2-TR-GROUP.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE TERTIARY GROUP #"
           DISPLAY "IF THE TERTIARY IS VT-MEDICAID TYPE F)"
           DISPLAY "TO FIND THE CORRECT VT-MEDICAID CODE"
           DISPLAY "FOR THE PRIMARY INSURANCE!"
           GO TO 2000TI.
           IF (TRINS NOT = "004") AND (TRINS NOT = "064") 
           MOVE IN-FIELD TO MPLR-TR-GROUP
           GO TO 4900DEE.
           IF IN-FIELD = "F"
           PERFORM CAR-1 THRU CAR-1-EXIT
           GO TO 2000TI.
           IF IN-FIELD-3 = "---"
           PERFORM VT-CAID
           MOVE INS-CAID TO MPLR-TR-GROUP
           GO TO 4900DEE
           END-IF
           MOVE IN-FIELD-3 TO CAR-KEY
           READ CARRIERFILE INVALID
           DISPLAY "THIS IS AN INVALID MEDICAID CODE"
           DISPLAY "EITHER LOOK AGAIN OR TYPE --- TO GET"
           DISPLAY "THE DEFAULT CODE FROM THE INSURANCE FILE"
           GO TO 2000TI
           END-READ.
           MOVE IN-FIELD-3 TO MPLR-TR-GROUP
           GO TO 4900DEE.

       2-TRIPOL.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE TERTIARY POLICY #"
           DISPLAY "S = SAME AS PRIMARY   S2 = SAME AS SECONDARY"
           GO TO 2000TI.
           IF IN-FIELD = "S" MOVE PRIPOL TO MPLR-TRIPOL
           DISPLAY "SAME AS PRIMARY" 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           IF IN-FIELD = "S2" MOVE SECPOL TO MPLR-TRIPOL
           DISPLAY "SAME AS PRIMARY" 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           MOVE IN-FIELD TO MPLR-TRIPOL.
           IF MPLR-TRIPOL = SPACE AND MPLR-TR-ASSIGN  = "A"
           DISPLAY "ASSIGNED CODES SHOULD HAVE POLICY NUMBERS".
           GO TO 4900DEE.
       2-TRNAME.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE NAME OF THE TERTIARY INSURED"
               DISPLAY "LAST NAME;FIRST NAME;MIDDLE INITIAL"
               DISPLAY "SEPARATING EACH MAJOR PORTION OF THE NAME BY "
               DISPLAY "A SEMICOLON. USE ONLY LASTNAME;FIRSTNAME;M.I."
           DISPLAY "DO NOT USE JR ,SR ,III   NO IMBEDDED BLANKS EITHER."
           DISPLAY "NAMES LIKE ROBERT E ST JOHN JR MUST BE ENTERED"
               DISPLAY "ONLY LIKE THIS... STJOHN;ROBERT;E"
           DISPLAY "ANYTHING ELSE WILL RESULT IN A REJECTION"
           DISPLAY "S = SAME NAME AS GUARANTOR"
           DISPLAY "S1 = SAME NAME AS PRIMARY INSURED"
           DISPLAY "S2 = SAME NAME AS SECONDARY INSURED"
            GO TO 2000TI.
           IF IN-FIELD = "S" MOVE GARNAME TO MPLR-TR-NAME
           MOVE RELATE TO MPLR-TR-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS GUARANTOR " MPLR-TR-NAME 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           IF IN-FIELD = "S1" MOVE PR-NAME TO MPLR-TR-NAME
           MOVE PR-RELATE TO MPLR-TR-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS PR-INSURED " MPLR-TR-NAME 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           IF IN-FIELD = "S2" MOVE SE-NAME TO MPLR-TR-NAME
           MOVE SE-RELATE TO MPLR-TR-RELATE
           SET ADD-KEY UP BY 1
           DISPLAY "SAME AS SE-INSURED " MPLR-TR-NAME 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           IF IN-FIELD-1 = SPACE DISPLAY "LEADING BLANKS NOT ALLOWED"
           " IN LAST NAME" GO TO 2000TI.
           MOVE SPACES TO NAME-LAST NAME-MIDDLE NAME-FIRST.
           UNSTRING IN-FIELD DELIMITED BY ";" INTO
               NAME-LAST NAME-FIRST NAME-MIDDLE.
           IF NAME-FIRST = SPACES OR IN-FIELD = SPACES
           DISPLAY "A FIRST NAME IS REQUIRED" GO TO 2000TI.
           MOVE SPACES TO NAME-TEST.
           IF NAME-MIDDLE = " " STRING NAME-FIRST " " NAME-LAST
               DELIMITED BY "  " INTO NAME-TEST GO TO 2-TRNAME-TEST.
           STRING NAME-FIRST " " NAME-MIDDLE " " NAME-LAST " "
               DELIMITED BY "  " INTO NAME-TEST.
       2-TRNAME-TEST.
           DISPLAY "OK? Y/N " NAME-TEST.
           ACCEPT ANS.
           IF ANS  = "N"   GO TO 2000TI.
           IF ANS NOT = "Y"  GO TO 2-TRNAME-TEST.
           MOVE IN-FIELD TO MPLR-TR-NAME 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
       2-TRRELATE.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CODE FOR THE TERTIARY INSURED"
           DISPLAY "MALE:   2=ADULT  4=CHILD  5=STEPCHILD 8=PARTNER"
           DISPLAY "FEMALE: K=ADULT  M=CHILD  N=STEPCHILD Q=PARTNER"
           GO TO 2000TI.
           IF IN-FIELD = "2" OR "4" OR "5" OR "K" OR "M" OR "N"
           OR "8" OR "Q"
           MOVE IN-FIELD-1 TO MPLR-TR-RELATE 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.
       2-TR-ASGM.
           IF IN-FIELD = "?"
           DISPLAY "A=ASSIGNED  OR U=UN-ASSIGNED"
           DISPLAY "S IS NOT ALLOWED AS CHOICE FOR TERTIARY"
           GO TO 2000TI.
           IF IN-FIELD-1 = "U" OR "A" MOVE IN-FIELD-1 TO
           MPLR-TR-ASSIGN 
           MOVE 1 TO TERT-FLAG GO TO 4900DEE.
           DISPLAY "INVALID" GO TO 2000TI.

       4900DEE.
           IF ACT-1 = "C" GO TO 1400-CP.
           IF INDX = 7 AND BUSNAME1 = "1" SET ADD-KEY TO 9
           SET INDX TO ADD-FLD(ADD-KEY).
           IF ADD-KEY = 20 AND SE-ASSIGN NOT = "S"
           SET ADD-KEY TO 21.
           IF ADD-KEY = 26 AND MPLR-TR-ASSIGN NOT = "S"
           SET ADD-KEY TO 27.

       4910DEE.
           EXIT.
       RE-WRITE-GARFILE.
           IF (SEINS = "062") AND NOT (PRINS = "003" OR "028" OR "043")
                      DISPLAY "MEDIGAP ONLY AFTER MEDICARE PRIMARY"
                      DISPLAY "YOU MUST FIX THIS IMMEDIATELY" BELL0
                      GO TO  1400-CP
           END-IF
           IF (PRINS = SEINS) AND (PRINS NOT = "001")
                 AND (PRINS NOT = "024" AND PRINS NOT = "059")
                AND PRINS < "075"
                   DISPLAY PRINS "/" SEINS " IS AN INVALID COMBINATION"
                   DISPLAY "YOU MUST FIX THIS IMMEDIATELY" BELL0
                GO TO 1400-CP
           END-IF
           IF SE-ASSIGN = "S" 
                      DISPLAY "SET THE SECONDARY ASSIGNMENT"
                      DISPLAY "TO  A  OR  S , FIELD 33"
                      GO TO 1400-CP
           END-IF
           IF SEINS NOT = "062" GO TO  5001-WG.
           MOVE PR-GROUP TO GAPKEY
           READ GAPFILE INVALID 
                   DISPLAY "BAD MEDIGAP CODE."
                       " THIS MUST BE FIXED IMMEDIATELY" 
                   GO TO 1400-CP
           END-READ.
       5001-WG.
           MOVE GARFILE01 TO GARBACK.
           CLOSE GARFILE
           OPEN I-O GARFILE

           MOVE GARBACK(1:8) TO GARNO
    
           READ GARFILE WITH LOCK INVALID 
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY GARFILE-STAT
               CLOSE GARFILE
               OPEN INPUT GARFILE
               GO TO 1000-ACTION
           END-READ
               IF GARFILE-STAT NOT = "00"
                 DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
                 DISPLAY GARFILE-STAT
                 CLOSE GARFILE
                 OPEN INPUT GARFILE
                 GO TO 1000-ACTION
               END-IF
           
           MOVE GARBACK TO GARFILE01  

           REWRITE GARFILE01 INVALID 
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY GARFILE-STAT  
               CLOSE GARFILE
               OPEN INPUT GARFILE   
               GO TO 1000-ACTION
           END-REWRITE     
           IF GARFILE-STAT NOT = "00"
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY GARFILE-STAT
               CLOSE GARFILE
               OPEN INPUT GARFILE               
               GO TO 1000-ACTION
           END-IF   
           
           IF MPLR-FLAG  = 0 GO TO 5002-WG.
           IF TERT-FLAG = 0 GO TO 1000-ACTION.
           MOVE MPLRFILE01 TO MPLRBACK
           CLOSE MPLRFILE
           OPEN I-O MPLRFILE
           
               MOVE MPLRBACK(1:8) TO MPLR-KEY

               READ MPLRFILE WITH LOCK INVALID
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY MPLRFILE-STAT
               CLOSE MPLRFILE
               OPEN INPUT MPLRFILE               
               GO TO 1000-ACTION
           END-READ

           IF MPLRFILE-STAT NOT = "00"
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY MPLRFILE-STAT
               CLOSE MPLRFILE
               OPEN INPUT MPLRFILE   
               GO TO 1000-ACTION
           END-IF

           MOVE MPLRBACK TO MPLRFILE01

           REWRITE MPLRFILE01 INVALID 
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY MPLRFILE-STAT           
               CLOSE MPLRFILE
               OPEN INPUT MPLRFILE  
               GO TO 1000-ACTION
           END-REWRITE
           IF MPLRFILE-STAT NOT = "00"
               DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
               DISPLAY MPLRFILE-STAT
               CLOSE MPLRFILE
               OPEN INPUT MPLRFILE  
               GO TO 1000-ACTION
           END-IF.
       5002-WG. 
           IF (TRINS NOT NUMERIC) OR (TRINS = "001")
              GO TO 1000-ACTION
           END-IF 
            MOVE SPACE TO MPLR-NAME MPLR-STREET
            MPLR-CITY MPLR-STATE MPLR-ZIP MPLR-CLAIMNO
            MOVE TRINS TO MPLR-TRINS
            MOVE GARNO TO MPLR-KEY

            MOVE MPLRFILE01 TO MPLRBACK

            CLOSE MPLRFILE
            OPEN I-O MPLRFILE

            MOVE MPLRBACK TO MPLRFILE01

            WRITE MPLRFILE01 INVALID 
                   DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                  DISPLAY MPLRFILE-STAT    
                  CLOSE MPLRFILE
                  OPEN INPUT MPLRFILE       
                  GO TO 1000-ACTION
            END-WRITE
            IF MPLRFILE-STAT NOT = "00"
               DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
               DISPLAY MPLRFILE-STAT
               CLOSE MPLRFILE
               OPEN INPUT MPLRFILE
            END-IF       
            GO TO 1000-ACTION.

      * BEGIN WORKCOMP FILE MAINTAINENCE ROUTINE *

       2000-AM.
           CLOSE MPLRFILE
           OPEN I-O MPLRFILE
           READ GARFILE INVALID DISPLAY "INVALID ACCT"
           CLOSE MPLRFILE
           OPEN INPUT MPLRFILE
           GO TO 2001-AM.
           MOVE GARNO TO MPLR-KEY 
           MOVE 0 TO MPLR-FLAG
           READ MPLRFILE WITH LOCK INVALID 
              MOVE SPACE TO MPLRFILE01
              GO TO 2000-AM1
           END-READ
           IF MPLR-NAME = SPACE  
                 MOVE 1 TO MPLR-FLAG  
                 GO TO 2000-AM1
           END-IF
           PERFORM LM-1
           DISPLAY "EXISTING RECORD. USE <CW> TO CHANGE INFO"
           CLOSE MPLRFILE
           OPEN INPUT MPLRFILE
           GO TO 2001-AM.
       2000-AM1.    
           PERFORM MPLR-ADD-LOOP VARYING MPLR-A-KEY FROM 2 BY 1
             UNTIL MPLR-A-KEY > 7
           IF IN-FIELD = "X" 
               DISPLAY "NO UPDATE" 
               GO TO 2001-AM
           END-IF
           IF MPLR-FLAG = 1 
              REWRITE MPLRFILE01
              PERFORM LM-1 
              CLOSE MPLRFILE
              OPEN INPUT MPLRFILE
              GO TO 2001-AM
           END-IF
           MOVE GARNO TO MPLR-KEY
           WRITE MPLRFILE01 INVALID
                      DISPLAY "RECORD NOT ADDED"
                      DISPLAY MPLRFILE-STAT
                      CLOSE MPLRFILE
                      OPEN INPUT MPLRFILE
                      GO TO 1000-ACTION
           END-WRITE
           DISPLAY MPLR-KEY " " MPLR-NAME " ADDED".
       2001-AM.
           EXIT.
       MPLR-ADD-LOOP.
           SET MPLR-INDX TO MPLR-A-FLD(MPLR-A-KEY).
           PERFORM MPLR-DISPLAY THRU MPLRDEEX.
       MPLR-CP.
           MOVE SPACES TO FIELD-CODE IN-FIELD.
           DISPLAY "FIELD CODE,DATA? WORKCOMP".
           ACCEPT DATAIN.
           IF DATAIN = "X"
               DISPLAY "NO CHANGE"  GO TO 1000-ACTION.
           IF DATAIN = "UP"  GO TO 5000-WRITE-MPLRFILE.
           IF DATAIN = "LW" PERFORM LM-1 GO TO MPLR-CP.
           IF DATAIN = "?"
           DISPLAY "ENTER A FIELD CODE <COMMA> AND NEW DATA."
               DISPLAY "UP = UPDATE CHANGES"
           DISPLAY " X = NO CHANGE"
           DISPLAY "LW = LIST "
           DISPLAY "FIELD CODES: 2=NAME 3=STREET  4=CITY"
           DISPLAY "             5=STATE    6=ZIP     7=CLAIMNO "
           GO TO MPLR-CP.
           UNSTRING DATAIN DELIMITED BY "," INTO FIELD-CODE IN-FIELD.
           INSPECT FIELD-CODE REPLACING LEADING SPACE BY "0".
           IF FIELD-CODE NOT NUMERIC
               DISPLAY "FIELD-CODE MUST BE 2 DIGITS AND NUMERIC"
               GO TO MPLR-CP.
           IF FIELD-CODE = "00"
               DISPLAY "FIELD CODE CANNOT BE ZERO OR BLANK"
               GO TO MPLR-CP.
           IF ( FIELD-CODE > "01" AND  < "08" )
           MOVE FIELD-CODE TO NUM-2 
           SET MPLR-INDX TO NUM-2
           GO TO MPLR-GO-TO.
           DISPLAY "FIELD # MUST BE FROM 2-8".
           GO TO MPLR-CP.
       MPLR-DISPLAY.
           DISPLAY MPLR-DESC-FLD(MPLR-INDX) "?".
       MPLR-INPUT.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "??"
           DISPLAY "LW = LIST ADDRESS RECORD BUILT SO FAR"
           DISPLAY "X = CANCEL ADD OF THIS RECORD"
           DISPLAY "BK = BACK TO PREVIOUS PROMPT"
           DISPLAY "? = DATA NEEDED FOR PROMPT"
           DISPLAY "OR ENTER DATA NEEDED"
           GO TO MPLR-DISPLAY.
           IF IN-FIELD = "BK" AND MPLR-A-KEY = 1 MOVE "X" TO IN-FIELD
           SET MPLR-A-KEY TO 8 GO TO MPLRDEEX.
           IF IN-FIELD = "BK" GO TO MPLR-BACK.
           IF IN-FIELD = "LW" PERFORM LM-1 GO TO MPLR-DISPLAY.
           IF IN-FIELD = "X" SET MPLR-A-KEY TO 8
           GO TO MPLRDEEX.
           GO TO MPLR-GO-TO.
       MPLR-BACK.
           SET MPLR-A-KEY DOWN BY 1
           SET MPLR-INDX TO MPLR-A-FLD(MPLR-A-KEY)
           GO TO MPLR-DISPLAY.
       MPLR-GO-TO.
           MOVE 0 TO FLAG.
           MOVE MPLR-LEN-TAB(MPLR-INDX) TO Q ADD 1 TO Q.
           IF IN-FIELD-TAB(Q) NOT = " " MOVE 1 TO FLAG.
           IF FLAG = 1 DISPLAY "DATA TOO LONG, MUST NOT BE GREATER "
             "THAN " MPLR-LEN-TAB(MPLR-INDX) ".".
           IF FLAG = 1 AND ACT-1 = "C" GO TO MPLR-CP.
           IF FLAG = 1 AND ACT-1 = "A" GO TO MPLR-DISPLAY.
           GO TO 1-MPLR
            2-MPLR 3-MPLR 4-MPLR 5-MPLR 6-MPLR 7-MPLR
           DEPENDING ON MPLR-INDX.
       MPLR-TI.
           IF ACT-1 = "A" GO TO MPLR-DISPLAY.
           IF ACT-1 = "C" GO TO MPLR-CP.
       1-MPLR.
           GO TO MPLR-TI.
       2-MPLR.
           IF IN-FIELD = "?"
               DISPLAY "TYPE THE WORD   BLANK"
               DISPLAY "TO ERASE A WORK COMP ADRESS"
               DISPLAY "ENTER INSURANCE COMPANY NAME"
               DISPLAY "OR THE 4-DIGIT ADDRES CODE"
               DISPLAY "OR FS TO FIND ADDRESS FORM THE ADDRESS FILE"
              GO TO MPLR-TI.
           IF IN-FIELD = SPACE
           DISPLAY "A BLANK NAME" GO TO MPLR-TI.
           IF IN-FIELD = "BLANK"
           MOVE SPACE TO  
           MPLR-NAME MPLR-STREET MPLR-CITY MPLR-STATE MPLR-ZIP
           SET MPLR-A-KEY TO 8 
           GO TO MPLRDEE.
           IF IN-FIELD = "FS" PERFORM ADDR-1 THRU ADDR-1-EXIT
           GO TO MPLR-TI.
           IF IN-FIELD-1 NUMERIC
           MOVE SPACE TO RIGHT-4
           UNSTRING IN-FIELD-4 DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING ALL " " BY "0"
           MOVE RIGHT-4 TO IN-FIELD-4.
           IF IN-FIELD-4 NUMERIC MOVE IN-FIELD-4 TO ADDR-KEY
            READ ADDRFILE
             INVALID DISPLAY "INVALID ADDRESS CODE"
              GO TO MPLR-TI
             NOT INVALID PERFORM LS-1
              DISPLAY "Y/N"
              ACCEPT ALF-1
               IF ALF-1 NOT = "Y"
                GO TO MPLR-TI
               END-IF
              MOVE ADDR-NAME TO IN-FIELD
              MOVE ADDR-STREET TO MPLR-STREET
              MOVE ADDR-CITY TO MPLR-CITY
              MOVE ADDR-STATE TO MPLR-STATE
              MOVE ADDR-ZIP TO MPLR-ZIP
              IF ACTION = "AW"
               MOVE IN-FIELD TO MPLR-NAME
               SET MPLR-A-KEY TO 6
               GO TO MPLRDEE
              END-IF
           END-READ
           END-IF.
           MOVE IN-FIELD TO MPLR-NAME GO TO MPLRDEE.
       3-MPLR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER STREET ADDRESS"
               GO TO MPLR-TI.
           MOVE IN-FIELD TO MPLR-STREET
           GO TO MPLRDEE.
       4-MPLR.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CITY NAME"
           GO TO MPLR-TI.
           MOVE IN-FIELD TO MPLR-CITY GO TO MPLRDEE.
       5-MPLR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE OFFICIAL POSTAL  STATE CODE"
               GO TO MPLR-TI.
           SEARCH ALL STATE-2   AT END
               DISPLAY "NOT A STATE CODE"
           MOVE IN-FIELD-2 TO MPLR-STATE GO TO MPLRDEE
           WHEN STATE-2(S-2) = IN-FIELD NEXT SENTENCE.
           MOVE IN-FIELD-2 TO MPLR-STATE
           GO TO MPLRDEE.
       6-MPLR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER ZIP CODE OF COMPANY"
               GO TO MPLR-TI.
           IF IN-FIELD-5 NOT NUMERIC
              DISPLAY "1ST 5 POSITIONS NOT NUMERIC; THERFORE,"
               DISPLAY "ZIP CODE ASSUMED TO BE INTERNATIONALE.".
           MOVE IN-FIELD TO MPLR-ZIP GO TO MPLRDEE.
       7-MPLR.
           IF IN-FIELD = "?"
           DISPLAY "ENTER ANY REFERENCE # ASSIGNED TO THIS CLAIM".
           MOVE IN-FIELD-15 TO MPLR-CLAIMNO GO TO MPLRDEE.
       MPLRDEE. IF ACT-1 = "C" GO TO MPLR-CP.
       MPLRDEEX. EXIT.
       5000-WRITE-MPLRFILE.
           REWRITE MPLRFILE01 INVALID KEY DISPLAY "NO UPDATE."
           DISPLAY "THIS SHOULD NOT HAPPEN. CONTACT THE DATA CENTER."
           DISPLAY "THIS PROGRAM IS TERMINATED."
           GO TO 9100-CLOSE-MASTER-FILE.
           UNLOCK MPLRFILE RECORD
           DISPLAY "UPDATE MADE"  GO TO 1000-ACTION.
       2000-AI.
           MOVE SPACE TO INSFILE01
           PERFORM INS-ADD-LOOP VARYING INS-A-KEY FROM 1 BY 1
             UNTIL INS-A-KEY > 15
           IF IN-FIELD = "X" DISPLAY "NO UPDATE" GO TO 1000-ACTION.
           ACCEPT INS-LASTDATE FROM DATE YYYYMMDD.
           MOVE "1" TO INS-LEVEL
           MOVE INSFILE01 TO INSBACK
           CLOSE INSFILE
           OPEN I-O INSFILE
           MOVE INSBACK TO INSFILE01
           WRITE INSFILE01 INVALID 
                    DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                    DISPLAY ADDRFILE-STAT
                    CLOSE ADDRFILE
                    OPEN INPUT ADDRFILE
                    GO TO 1000-ACTION
           END-WRITE
           IF ADDRFILE-STAT NOT = "00"
                    DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                    DISPLAY ADDRFILE-STAT
                    CLOSE ADDRFILE
                    OPEN INPUT ADDRFILE
                    GO TO 1000-ACTION
           END-IF
           DISPLAY INS-KEY " " INS-NAME.
           DISPLAY "RECORD IS ADDED".
           GO TO 1000-ACTION.
       INS-ADD-LOOP.
           SET INS-INDX TO INS-A-FLD(INS-A-KEY).
           PERFORM INS-DISPLAY THRU INSDEEX.
       INS-CP.
           MOVE SPACES TO FIELD-CODE IN-FIELD.
           DISPLAY "FIELD CODE,DATA? INSURE.".
           ACCEPT DATAIN.
           IF DATAIN = "X"
               DISPLAY "NO CHANGE"  GO TO 1000-ACTION.
           IF DATAIN = "UP"  GO TO 5000-WRITE-INSFILE.
           IF DATAIN = "LI"
                 PERFORM LI-1X THRU LI-1-EXIT 
                 GO TO INS-CP
           END-IF
           IF DATAIN = "?"
           DISPLAY "ENTER A FIELD CODE <COMMA> AND NEW DATA."
               DISPLAY "UP = UPDATE CHANGES"
           DISPLAY " X = NO CHANGE"
           DISPLAY "LI = LIST "
           DISPLAY "FIELD CODES: 2=INSNAME 3=STREET  4=CITY"
           DISPLAY " 5=STATE     6=ZIP     7=ASSIGN  8=CLM-TYPE"
           DISPLAY " 9=NEIC     11=CLM-ASSIGN       12=PPO"
           DISPLAY "13=PRVNUM   14=HMO    15=STATUS 16=LEVEL"
           DISPLAY "17=CHANGE LASTDATE 18=VT-CAID# 19=REFWARN"
           GO TO INS-CP.
           UNSTRING DATAIN DELIMITED BY "," INTO FIELD-CODE IN-FIELD.
           INSPECT FIELD-CODE REPLACING LEADING SPACE BY "0".
           IF FIELD-CODE NOT NUMERIC
               DISPLAY "FIELD-CODE MUST BE 2 DIGITS AND NUMERIC"
               GO TO INS-CP.
           IF FIELD-CODE = "00"
               DISPLAY "FIELD CODE CANNOT BE ZERO OR BLANK"
               GO TO INS-CP.
           IF ( FIELD-CODE > "01" AND  < "20" )
           AND  ( NOT (FIELD-CODE = "16" OR "17") )
           MOVE FIELD-CODE TO NUM-2
           SET INS-INDX TO NUM-2
           GO TO INS-GO-TO.
           DISPLAY "FIELD # MUST BE FROM 2-16,18,19".
           GO TO INS-CP.
       INS-DISPLAY.
           DISPLAY INS-DESC-FLD(INS-INDX) "?".
       INS-INPUT.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "??"
           DISPLAY "LI = LIST INSURANCE RECORD BUILT SO FAR"
           DISPLAY "X = CANCEL ADD OF THIS RECORD"
           DISPLAY "BK = BACK TO PREVIOUS PROMPT"
           DISPLAY "? = DATA NEEDED FOR PROMPT"
           DISPLAY "OR ENTER DATA NEEDED"
           GO TO INS-DISPLAY.
           IF IN-FIELD = "BK" AND INS-A-KEY = 1 MOVE "X" TO IN-FIELD
           SET INS-A-KEY TO 20 GO TO INSDEEX.
           IF IN-FIELD = "BK" GO TO INS-BACK.
           IF IN-FIELD = "LI" PERFORM LI-1X THRU LI-1-EXIT 
           GO TO INS-DISPLAY.
           IF IN-FIELD = "X" SET INS-A-KEY TO 20
           GO TO INSDEEX.
           GO TO INS-GO-TO.
       INS-BACK. 
            IF INS-INDX = 11 SET INS-A-KEY TO 9
           SET INS-INDX TO INS-A-FLD(INS-A-KEY)
           GO TO INS-DISPLAY.
           SET INS-A-KEY DOWN BY 1
           SET INS-INDX TO INS-A-FLD(INS-A-KEY)
           GO TO INS-DISPLAY.
       INS-GO-TO.
           MOVE 0 TO FLAG.
           MOVE INS-LEN-TAB(INS-INDX) TO Q ADD 1 TO Q.
           IF IN-FIELD-TAB(Q) NOT = " " MOVE 1 TO FLAG.
           IF FLAG = 1 DISPLAY "DATA TOO LONG, MUST NOT BE GREATER "
             "THAN " INS-LEN-TAB(INS-INDX) ".".
           IF FLAG = 1 AND ACT-1 = "C" GO TO INS-CP.
           IF FLAG = 1 AND ACT-1 = "A" GO TO INS-DISPLAY.
           GO TO 1-INS
           2-INS 3-INS 4-INS 5-INS 6-INS 7-INS 8-INS 9-INS 10-INS
           11-INS 12-INS 13-INS 14-INS 15-INS 16-INS 17-INS 18-INS
           19-INS
           DEPENDING ON INS-INDX.
       INS-TI.
           IF ACT-1 = "A" GO TO INS-DISPLAY.
           IF ACT-1 = "C" GO TO INS-CP.
           IF ACT-1 = "S" OR "F" GO TO 1000-ACTION.
       1-INS.
           IF IN-FIELD = "?" 
           DISPLAY "ENTER A NUMBER FOR THE NEW CODE"
      *    DISPLAY "IT MUST BE GREATER THAN 199"
           GO TO INS-TI.
           MOVE SPACE TO RIGHT-3
           UNSTRING IN-FIELD-3 DELIMITED BY " " INTO RIGHT-3
           INSPECT RIGHT-3 REPLACING LEADING " " BY "0"
           IF (RIGHT-3 NOT NUMERIC) OR (RIGHT-3 < "001")
           DISPLAY "INVALID NUMBER" GO TO INS-TI.
           MOVE RIGHT-3 TO INS-KEY
           READ INSFILE INVALID GO TO INSDEE.
           DISPLAY "ALREADY ON FILE"
           PERFORM LI-1 THRU LI-1-EXIT GO TO INS-TI.
       2-INS.
           IF IN-FIELD = "?"
               DISPLAY "ENTER NAME OF THE INSURANCE"
              DISPLAY "IT WILL  BE USED FOR PAYMENT DESCRIPTION"
              DISPLAY "ON PERSONAL STATEMENTS AND CLAIM FORMS"
              GO TO INS-TI.
           IF IN-FIELD-1 = SPACE OR IN-FIELD = SPACE
           DISPLAY "LEADING BLANKS OR A BLANK NAME IS NOT ALLOWED"
           GO TO INS-TI.
           MOVE IN-FIELD TO INS-NAME GO TO INSDEE.
       3-INS.
           IF IN-FIELD = "?"
               DISPLAY "ENTER STREET ADDRESS"
               GO TO INS-TI.
           MOVE IN-FIELD TO INS-STREET
           GO TO INSDEE.
       4-INS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CITY NAME"
           GO TO INS-TI.
           MOVE IN-FIELD TO INS-CITY GO TO INSDEE.
       5-INS.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE OFFICIAL POSTAL  STATE CODE"
               GO TO INS-TI.
           SEARCH ALL STATE-2   AT END
               DISPLAY "NOT A STATE CODE"
           MOVE IN-FIELD-2 TO INS-STATE GO TO INSDEE
           WHEN STATE-2(S-2) = IN-FIELD NEXT SENTENCE.
           MOVE IN-FIELD-2 TO INS-STATE
           GO TO INSDEE.
       6-INS.
           IF IN-FIELD = "?"
               DISPLAY "ENTER ZIP CODE OF INSURANCE"
               GO TO INS-TI.
           IF IN-FIELD-5 NOT NUMERIC
              DISPLAY "1ST 5 POSITIONS NOT NUMERIC; THERFORE,"
               DISPLAY "ZIP CODE ASSUMED TO BE INTERNATIONALE.".
           MOVE IN-FIELD TO INS-ZIP GO TO INSDEE.
       7-INS.
           IF IN-FIELD = "?"
           DISPLAY "A=ASSIGNED  S=SOMETIMES ASSIGNED  U=UN-ASSIGNED"
           DISPLAY "S WILL ALLOW A CHOICE OF ASSIGNMENT FOR EACH ACCT"
           DISPLAY "A AND U ARE WHAT WILL BE CODES ON EACH ACCT"
           GO TO INS-TI.
           IF IN-FIELD-1 = "U" OR "S" OR "A" MOVE IN-FIELD-1 TO
           INS-ASSIGN GO TO INSDEE ELSE DISPLAY "INVALID"
           GO TO INS-TI.
       8-INS.
           IF IN-FIELD = "?"
               DISPLAY "E=ELECTRONIC P=PAPER O=OFFICE <CR>=NEITHER"
               GO TO INS-TI.
           IF IN-FIELD-1 = "E" OR "P" OR "O" OR SPACE
            MOVE IN-FIELD-1 TO INS-CLAIMTYPE
            GO TO INSDEE.
           DISPLAY "INVALID" GO TO INS-TI.
       9-INS.
           IF IN-FIELD = "?"
              DISPLAY "ENTER THE 5-CHARACTER NEIC CODE WHEN THE "
              DISPLAY "INSURANCE WILL BE BILLED ELECTRONICALLY TO"
               DISPLAY "NEIC. OTHERWISE SKIP THIS CODE."
               DISPLAY "F TO SEARCH TO NEIC CODES"
               GO TO INS-TI.
      *    DISPLAY IN-FIELD-5
           IF IN-FIELD-5 = SPACE MOVE SPACE TO INS-NEIC GO TO INSDEE.
           IF IN-FIELD = "F" 
                  MOVE INSFILE01 TO INSBACK
                  PERFORM INS-1 THRU INS-1-EXIT 
                  MOVE INSBACK TO INSFILE01
                  GO TO INS-TI
           END-IF
           MOVE IN-FIELD-5 TO INS-NEIC 
           GO TO INSDEE.
           DISPLAY "INVALID CODE" GO TO INS-TI.
       10-INS.
           IF IN-FIELD = "?"
           DISPLAY "0=BLANKET-NO-CARD  1=NO-CARD 2=LIST-DRIVEN"
           DISPLAY "THESE ARE FIXED CODES AND CAN NOT BE CHANGED"
           GO TO INS-TI.
           GO TO INS-TI.
       11-INS.
           IF IN-FIELD = "?"
           DISPLAY "ASSIGNMENT FOR EACH CHARGE"
           DISPLAY "A=ASSIGNED  S=SOMETIMES ASSIGNED  U=UN-ASSIGNED"
           DISPLAY "S WILL ALLOW A CHOICE OF ASSIGNMENT FOR EACH CHARGE"
           DISPLAY "A AND U ARE WHAT WILL BE CODES ON EACH CHARGE"
           GO TO INS-TI.
           IF IN-FIELD-1 = "U" AND INS-ASSIGN = "A"
           DISPLAY "U ONLY FOR PRIMARY INSURANCE CATEOGORY OF A OR S"
           GO TO INS-TI.
           IF IN-FIELD-1 = "U" OR "S" OR "A" MOVE IN-FIELD-1 TO
           INS-NEIC-ASSIGN GO TO INSDEE.
           DISPLAY "INVALID" GO TO INS-TI.
       12-INS.
           IF IN-FIELD = "?"
               DISPLAY "1=MANGD CARE 2=PPO 3=DMO 4=INDEMNITY"
               GO TO INS-TI.
           IF IN-FIELD-1 = "1" OR "2" OR "3" OR "4" MOVE
           IN-FIELD-1 TO INS-PPO GO TO INSDEE.
           DISPLAY "INVALID" GO TO INS-TI.
       13-INS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE PROVIDER NUMBER FOR THIS PPO."
           GO TO INS-TI.
           MOVE IN-FIELD-10 TO INS-PRVNUM GO TO INSDEE.
       14-INS.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE HMO CODE IF THIS IS AN HMO INSURANCE"
           GO TO INS-TI.
           MOVE IN-FIELD-3 TO INS-HMO GO TO INSDEE.
       15-INS.
           IF IN-FIELD = "?"
           DISPLAY "0=OPEN FOR USE 1=CLOSED,DORMANT,INACTIVATED"
           GO TO INS-TI.
           IF IN-FIELD-1 = "0" OR "1" MOVE IN-FIELD-1 TO INS-STATUS
           GO TO INSDEE.
           DISPLAY "INVALID" GO TO INS-TI.
       16-INS.
           IF IN-FIELD = "?"
           DISPLAY "LEVEL OF INSURANCE CODE"
           DISPLAY "0=FIXED 1=NEIC 9=OTHER"
           GO TO INS-TI.
           IF IN-FIELD = "0" OR "1" OR "2" OR SPACE
           MOVE IN-FIELD-1 TO INS-NEICLEVEL
           GO TO INS-TI.
           DISPLAY "INVALID" GO TO INS-TI.
       17-INS.
           IF IN-FIELD = "?"
           DISPLAY "DATE THAT INSURANCE INFORMATION WAS LAST CHANGED"
           GO TO INS-TI.
           GO TO INS-TI.
       18-INS.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE VT-MEDICARE CODE"
           DISPLAY "FOR THIS INSURANCE"
           GO TO INS-TI.
           MOVE IN-FIELD-3 TO INS-CAID
           IF INS-CAID = SPACE DISPLAY "NONE CHOSEN".
           GO TO INSDEE.
       19-INS.
           IF IN-FIELD = "?"
           DISPLAY "0= NO WARNING 1= WARN ABOUT REF-PHYS"
           GO TO INS-TI.
           MOVE IN-FIELD-1 TO INS-REFWARN
           IF INS-REFWARN = "0" OR "1" GO TO INSDEE.
           DISPLAY "INVALID" GO TO INS-TI.

       INSDEE. IF ACT-1 = "C" GO TO INS-CP.
       INSDEEX.
           EXIT.
       5000-WRITE-INSFILE.
           MOVE INSFILE01 TO INSBACK
           CLOSE INSFILE
           OPEN I-O INSFILE
           MOVE INSBACK(1:3) TO INS-KEY
           READ  INSFILE INVALID
                 DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
                 DISPLAY INSFILE-STAT
                 CLOSE INSFILE
                 OPEN INPUT INSFILE
                 GO TO 1000-ACTION
           END-READ
           IF INSFILE-STAT NOT = "00"
                 DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
                 DISPLAY INSFILE-STAT
                 CLOSE INSFILE
                 OPEN INPUT INSFILE
                 GO TO 1000-ACTION
           END-IF
           MOVE INSBACK TO INSFILE01
           REWRITE INSFILE01 INVALID 
                 DISPLAY "THIS RECORD CAN NOT BE MODIFIED AT THIS TIME"
                 DISPLAY INSFILE-STAT
                 CLOSE INSFILE
                 OPEN INPUT INSFILE
                 GO TO 1000-ACTION
           END-REWRITE
           DISPLAY "UPDATE MADE"  
           CLOSE INSFILE
           OPEN INPUT INSFILE
           GO TO 1000-ACTION.
       
       2000-AS.    
           PERFORM ADDR-ADD-LOOP VARYING ADDR-A-KEY FROM 1 BY 1
             UNTIL ADDR-A-KEY > 6
           IF IN-FIELD = "X" 
                 DISPLAY "NO UPDATE" 
                 GO TO 2001-AS
           END-IF
           MOVE ADDRFILE01 TO ADDRFILE-BACK
           CLOSE ADDRFILE
           OPEN I-O ADDRFILE
           MOVE ADDRFILE-BACK TO ADDRFILE01
           WRITE ADDRFILE01 INVALID 
                DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY ADDRFILE-STAT
                CLOSE ADDRFILE
                OPEN INPUT ADDRFILE
                GO TO 1000-ACTION
           END-WRITE
           IF ADDRFILE-STAT NOT = "00"
                DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY ADDRFILE-STAT
                CLOSE ADDRFILE

                OPEN INPUT MPLRFILE
                GO TO 1000-ACTION
           END-IF
           DISPLAY ADDR-KEY " " ADDR-NAME " ADDED".
       2001-AS. EXIT.
       ADDR-ADD-LOOP.
           SET ADDR-INDX TO ADDR-A-FLD(ADDR-A-KEY).
           PERFORM ADDR-DISPLAY THRU ADDRDEEX.
       ADDR-CP.
           MOVE SPACES TO FIELD-CODE IN-FIELD.
           DISPLAY "FIELD CODE,DATA? ADDRESS".
           ACCEPT DATAIN.
           IF DATAIN = "X"
               DISPLAY "NO CHANGE"  
               GO TO 1000-ACTION
           END-IF
           
           IF DATAIN = "UP"  
             GO TO 5000-WRITE-ADDRFILE
           END-IF
           
           IF DATAIN = "LS" 
               PERFORM LS-1 
               GO TO ADDR-CP
           END-IF

           IF DATAIN = "?"
             DISPLAY "ENTER A FIELD CODE <COMMA> AND NEW DATA."
             DISPLAY "UP = UPDATE CHANGES"
             DISPLAY " X = NO CHANGE"
             DISPLAY "LS = LIST "
             DISPLAY "FIELD CODES: 2=NAME 3=STREET  4=CITY"
             DISPLAY "             5=STATE    6=ZIP       "
             GO TO ADDR-CP
           END-IF

           UNSTRING DATAIN DELIMITED BY "," INTO FIELD-CODE IN-FIELD.
           INSPECT FIELD-CODE REPLACING LEADING SPACE BY "0".
           IF FIELD-CODE NOT NUMERIC
               DISPLAY "FIELD-CODE MUST BE 2 DIGITS AND NUMERIC"
               GO TO 
               ADDR-CP
           END-IF

           IF FIELD-CODE = "00"
               DISPLAY "FIELD CODE CANNOT BE ZERO OR BLANK"
               GO TO ADDR-CP
           END-IF

           IF ( FIELD-CODE > "01" AND  < "07" )
             MOVE FIELD-CODE TO NUM-2 
             SET ADDR-INDX TO NUM-2
             GO TO ADDR-GO-TO
           END-IF

           DISPLAY "FIELD # MUST BE FROM 2-6".
           GO TO ADDR-CP.
       ADDR-DISPLAY.
           DISPLAY ADDR-DESC-FLD(ADDR-INDX) "?".
       ADDR-INPUT.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "??"
             DISPLAY "LS = LIST ADDRESS RECORD BUILT SO FAR"
             DISPLAY "X = CANCEL ADD OF THIS RECORD"
             DISPLAY "BK = BACK TO PREVIOUS PROMPT"
             DISPLAY "? = DATA NEEDED FOR PROMPT"
             DISPLAY "OR ENTER DATA NEEDED"
             GO TO ADDR-DISPLAY
           END-IF

           IF IN-FIELD = "BK" AND ADDR-A-KEY = 1 
                MOVE "X" TO IN-FIELD
                SET ADDR-A-KEY TO 7 
                GO TO ADDRDEEX
           END-IF

           IF IN-FIELD = "BK" 
                GO TO ADDR-BACK
           END-IF

           IF IN-FIELD = "LS" 
                PERFORM LS-1 
                GO TO ADDR-DISPLAY
           END-IF

           IF IN-FIELD = "X" 
                SET ADDR-A-KEY TO 7
                GO TO ADDRDEEX
           END-IF

           GO TO ADDR-GO-TO.
       ADDR-BACK.
           SET ADDR-A-KEY DOWN BY 1
           SET ADDR-INDX TO ADDR-A-FLD(ADDR-A-KEY)
           GO TO ADDR-DISPLAY.
       ADDR-GO-TO.
           MOVE 0 TO FLAG.
           MOVE ADDR-LEN-TAB(ADDR-INDX) TO Q 
           ADD 1 TO Q.
           IF IN-FIELD-TAB(Q) NOT = " " 
                  MOVE 1 TO FLAG
           END-IF

           IF FLAG = 1 
                DISPLAY "DATA TOO LONG, MUST NOT BE GREATER "
                        "THAN " ADDR-LEN-TAB(ADDR-INDX) "."
           END-IF

           IF FLAG = 1 AND ACT-1 = "C" 
                  GO TO ADDR-CP
           END-IF

           IF FLAG = 1 AND ACT-1 = "A" 
                 GO TO ADDR-DISPLAY
           END-IF

           GO TO 1-ADDR 2-ADDR 3-ADDR 4-ADDR 5-ADDR 6-ADDR 
               DEPENDING ON ADDR-INDX.
       ADDR-TI.
           IF ACT-1 = "A" GO TO ADDR-DISPLAY.
           IF ACT-1 = "C" GO TO ADDR-CP.
       1-ADDR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER 4-DIGIT ADDRESS CODE"
               DISPLAY "OR FS TO SEARCH THE ADDRESS FILE"
              GO TO ADDR-TI
           END-IF

           IF IN-FIELD = "FS" 
               PERFORM ADDR-1 THRU ADDR-1-EXIT
               GO TO ADDR-TI
           END-IF

           MOVE SPACE TO RIGHT-4
           UNSTRING IN-FIELD-4 DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING ALL " " BY "0"
           IF (RIGHT-4 NOT NUMERIC) OR ( RIGHT-4 = "0000" )
                  DISPLAY "MUST BE NUMERIC" 
                  GO TO ADDR-TI
           END-IF

           MOVE RIGHT-4 TO ADDR-KEY
           READ ADDRFILE 
             INVALID 
                  CONTINUE
           NOT INVALID 
                  DISPLAY "ALREADY ON FILE"
                  PERFORM LS-1
                  GO TO ADDR-TI
           END-READ
           GO TO ADDRDEE.
       2-ADDR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER ADDRESS NAME"
              GO TO ADDR-TI.
           IF IN-FIELD = SPACE
           DISPLAY "A BLANK NAME" GO TO ADDR-TI.
           MOVE IN-FIELD TO ADDR-NAME GO TO ADDRDEE.
       3-ADDR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER STREET ADDRESS"
               GO TO ADDR-TI.
           MOVE IN-FIELD TO ADDR-STREET
           GO TO ADDRDEE.
       4-ADDR.
           IF IN-FIELD = "?"
           DISPLAY "ENTER THE CITY NAME"
           GO TO ADDR-TI.
           MOVE IN-FIELD TO ADDR-CITY GO TO ADDRDEE.
       5-ADDR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE OFFICIAL POSTAL  STATE CODE"
               GO TO ADDR-TI.
           SEARCH ALL STATE-2   AT END
               DISPLAY "NOT A STATE CODE"
           MOVE IN-FIELD-2 TO ADDR-STATE GO TO ADDRDEE
           WHEN STATE-2(S-2) = IN-FIELD NEXT SENTENCE.
           MOVE IN-FIELD-2 TO ADDR-STATE
           GO TO ADDRDEE.
       6-ADDR.
           IF IN-FIELD = "?"
               DISPLAY "ENTER ZIP CODE OF COMPANY"
               GO TO ADDR-TI.
           IF IN-FIELD-5 NOT NUMERIC
              DISPLAY "1ST 5 POSITIONS NOT NUMERIC; THERFORE,"
               DISPLAY "ZIP CODE ASSUMED TO BE INTERNATIONALE.".
           MOVE IN-FIELD TO ADDR-ZIP GO TO ADDRDEE.
       ADDRDEE. IF ACT-1 = "C" GO TO ADDR-CP.
       ADDRDEEX. EXIT.
       5000-WRITE-ADDRFILE.
           MOVE ADDRFILE01 TO ADDRFILE-BACK
           CLOSE ADDRFILE
           OPEN I-O ADDRFILE
           MOVE ADDRFILE-BACK TO ADDRFILE01
           REWRITE ADDRFILE01 INVALID 
                DISPLAY "RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY ADDRFILE-STAT
                GO TO 1000-ACTION
           END-REWRITE
           IF ADDRFILE-STAT NOT = "00"
                DISPLAY "THIS RECORD CAN NOT BE ADDED AT THIS TIME"
                DISPLAY ADDRFILE-STAT
                CLOSE ADDRFILE
                OPEN INPUT MPLRFILE
                GO TO 1000-ACTION
           END-IF
           DISPLAY "UPDATE MADE"
           CLOSE ADDRFILE
           OPEN INPUT ADDRFILE
           GO TO 1000-ACTION.

       LM-1.
           DISPLAY  MPLR-NAME " " MPLR-STREET " " MPLR-CITY
           " " MPLR-STATE " " MPLR-ZIP
           DISPLAY "CLAIM # " MPLR-CLAIMNO.
       LS-1.
           DISPLAY  ADDR-KEY " " ADDR-NAME " " ADDR-STREET 
           " " ADDR-CITY " " ADDR-STATE " " ADDR-ZIP.

       LI-1.
           READ INSFILE INVALID DISPLAY "INVALID" GO TO LI-1-EXIT.
       LI-1X.
           DISPLAY INS-KEY " " INS-NAME " " INS-STREET " " INS-CITY
           " " INS-STATE " " INS-ZIP
           DISPLAY INS-ASSIGN "    " INS-CLAIMTYPE "   " INS-NEIC
           "    " INS-NEICLEVEL " " INS-NEIC-ASSIGN "    " INS-PPO
           "  " INS-PRVNUM "    " INS-HMO " " INS-STATUS " "
           INS-LASTDATE "   "    INS-CAID "     "  INS-REFWARN
           DISPLAY "ASGM TYP NEIC NCLVL NCSM PPO PPONUM    HMO STAT LAST
      -    " DATE VTCAID# REFPRMT".
       LI-1-EXIT. EXIT.
       INS-NEIC-1.
           MOVE IN-FIELD-5 TO INS-NEIC
           START INSFILE KEY NOT < INS-NEIC INVALID DISPLAY "INVALID"
           GO TO INS-NEIC-EXIT.
       INS-NEIC-2. READ INSFILE NEXT AT END GO TO INS-NEIC-EXIT.
           IF (INS-NEIC = IN-FIELD-5) AND (INS-KEY > "099" AND
           < "200")  DISPLAY INS-NEIC " " INS-NAME MOVE 1 TO FLAG
           MOVE INS-NEICLEVEL TO ALF-1 GO TO INS-NEIC-2.
       INS-NEIC-EXIT. EXIT.
      *  BEGIN PATIENT (DEPENDENT) ROUTINE **

       2000-AP.
           MOVE SPACE TO PATFILE01
           PERFORM 2005-ADD-LOOP VARYING PAT-A-KEY FROM 1 BY 1
             UNTIL PAT-A-KEY > 6.
           IF IN-FIELD = "X" DISPLAY "NO UPDATE" GO TO 1000-ACTION.
           MOVE SPACE TO PATNO.
           MOVE PATFILE01 TO PATBACK.
           ACCEPT YEARDAY FROM DAY.
           MOVE DAY3 TO NUM-3 IID2.
           MOVE PATNAME  TO PART24.
           MOVE THREEPARTID TO IID1.
           MOVE "P" TO IID4.
           MOVE 0 TO XYZ.
       2222-ADD-PROCESS.
           ADD 1 TO XYZ.
           MOVE XYZ TO IID3.
           MOVE PATNO TO HOLD-GARNO.
           READ PATFILE INVALID KEY 
                 GO TO 3333-ADD-PROCESS
           END-READ
           IF XYZ = 9 
                 ADD 1 TO NUM-3 
                 MOVE NUM-3 TO IID2
                 MOVE 0 TO XYZ
                 GO TO 2222-ADD-PROCESS
           END-IF.
       3333-ADD-PROCESS.
           MOVE PATBACK TO PATFILE01
           MOVE HOLD-GARNO TO PATNO
           MOVE PATFILE01 TO PATBACK.
           WRITE PATFILE01 INVALID KEY DISPLAY "NO UPDATE"
           DISPLAY "THIS SHOULD NOT HAVE HAPPENED. CONTACT CMS."
           DISPLAY "THIS PROGRAM HAS BEEN TERMINATED"
           GO TO 9100-CLOSE-MASTER-FILE.
           DISPLAY HOLD-GARNO " " PATNAME.
           DISPLAY "RECORD IS ADDED".
           GO TO 1000-ACTION.
       2005-ADD-LOOP.
           SET PAT-INDX TO PAT-A-FLD(PAT-A-KEY).
           PERFORM PAT-DISPLAY THRU PATDEE.
       PAT-DISPLAY.
           DISPLAY PAT-DESC-FLD(PAT-INDX) "?".
       PAT-INPUT.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "??"
           DISPLAY "LP = LIST THE RECORD"
           DISPLAY "X = CANCEL ADD OF THIS RECORD"
           DISPLAY "BK = BACK TO PREVIOUS PROMPT"
           DISPLAY "? = DATA NEEDED FOR PROMPT"
           DISPLAY "OR ENTER DATA NEEDED"
           GO TO PAT-DISPLAY.
           IF IN-FIELD = "LP" PERFORM LP-2 GO TO PAT-DISPLAY.
           IF IN-FIELD = "BK" AND PAT-A-KEY = 1 MOVE "X" TO IN-FIELD
           SET PAT-A-KEY TO 8 GO TO PATDEE.
           IF IN-FIELD = "BK" GO TO PAT-BACK.
           IF IN-FIELD = "X" SET PAT-A-KEY TO 8
           GO TO PATDEE.
           GO TO PAT-GO-TO.
       PAT-BACK.
           SET PAT-A-KEY DOWN BY 1
           SET PAT-INDX TO PAT-A-FLD(PAT-A-KEY)
           GO TO PAT-DISPLAY.
       PAT-GO-TO.
           MOVE 0 TO FLAG.
           MOVE PAT-LEN-TAB(PAT-INDX) TO Q ADD 1 TO Q.
           IF IN-FIELD-TAB(Q) NOT = " " MOVE "1" TO FLAG.
           IF FLAG = 1 DISPLAY "DATA TOO LONG, MUST NOT BE GREATER "
             "THAN " PAT-LEN-TAB(PAT-INDX) ".".
           IF FLAG = 1 AND ACT-1 = "C" GO TO PAT-CP.
           IF FLAG = 1 AND ACT-1 = "A" GO TO PAT-DISPLAY.
           GO TO PATDEE
            2000-PAT 2-NAME 2-SEX 2-RELATE 2-MSTAT 2-DOB
           DEPENDING ON PAT-INDX.
       PATTI.
           IF ACT-1 = "A" GO TO PAT-DISPLAY.
           GO TO PAT-CP.
       2000-PAT.
           IF IN-FIELD = "?"
           DISPLAY "ONE WHO WILL PAY THIS DEPENDENT""S BILL"
           DISPLAY "<FA,FG,SG,LG,FP,SP>,<GARNO>"
           DISPLAY "X = BACK TO OPTION ID"
           GO TO PATTI.
           IF IN-FIELD = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
           OR "7" OR "8" OR "9" MOVE IN-FIELD TO ALF-1
           MOVE ALF-1 TO FLAG
           MOVE GAR-TAB(FLAG) TO IN-FIELD.
           MOVE IN-FIELD TO GARNO.
           READ GARFILE INVALID DISPLAY "NOT ON FILE" GO TO PATTI.
           IF PRINS = "003" OR "028" OR "093" OR "098" OR "004" 
           OR "064"
           DISPLAY "MEDICARE OR MEDICAID  CAN""T HAVE DEPENDENTS"
           GO TO PATTI.
           DISPLAY GARNO " " GARNAME
           MOVE GARNO TO GUARNO GO TO PATDEE.
       2-NAME.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE FULL NAME OF THE PATIENT"
               DISPLAY "LAST NAME  FIRST NAME  MIDDLE NAME"
               DISPLAY "SEPARATING EACH MAJOR PORTION OF THE NAME BY "
               DISPLAY "A SEMICOLON. "
           DISPLAY "EXAMPLE: ROBERT E. ST JOHN JR"
               DISPLAY "ST JOHN JR;ROBERT;E."
           GO TO PATTI.
           MOVE SPACES TO NAME-LAST NAME-MIDDLE NAME-FIRST.
           INSPECT IN-FIELD REPLACING ALL "," BY " ".
           UNSTRING IN-FIELD DELIMITED BY ";" INTO
               NAME-LAST NAME-FIRST NAME-MIDDLE.
           MOVE SPACES TO NAME-TEST.
           IF NAME-LAST = SPACE OR NAME-FIRST = SPACE
           DISPLAY "INVALID FORMAT"
           GO TO PATTI.
           IF NAME-MIDDLE = " " STRING NAME-FIRST " " NAME-LAST
               DELIMITED BY "  " INTO NAME-TEST GO TO 2-NAME-TEST.
           STRING NAME-FIRST " " NAME-MIDDLE " " NAME-LAST " "
               DELIMITED BY "  " INTO NAME-TEST.
       2-NAME-TEST.
           DISPLAY "OK? Y/N " NAME-TEST.
           ACCEPT ANS.
           IF ANS   = "N"   GO TO PATTI.
           MOVE IN-FIELD TO PATNAME GO TO PATDEE.
       2-SEX.
           IF IN-FIELD = "?"
               DISPLAY "TRY M=MALE OR F=FEMALE."
               GO TO PATTI.
           IF IN-FIELD = "M" OR "F" NEXT SENTENCE ELSE
               DISPLAY "GUESS AGAIN" GO TO PATTI.
           MOVE IN-FIELD-1 TO P-SEX GO TO PATDEE.
       2-RELATE.
           IF IN-FIELD = "?"
           DISPLAY "MALE:   2=ADULT  4=CHILD  5=STEPCHILD 8=PARTNER"
           DISPLAY "FEMALE: K=ADULT  M=CHILD  N=STEPCHILD Q=PARTNER"
           GO TO PATTI.
           IF IN-FIELD = "2" OR "4" OR "5" OR "K" OR "M" OR "N"
           OR "8" OR "Q"
           MOVE IN-FIELD-1 TO P-RELATE GO TO PATDEE.
           DISPLAY "INVALID" GO TO PATTI.
       2-DOB.
           IF IN-FIELD = "?"
               DISPLAY "ENTER THE PATIENT''S BIRTH DATE USING"
               DISPLAY "USING THE FORMAT MMDDYYYY."
               DISPLAY "THE MONTH, DAY, AND YEAR - IN THAT ORDER"
               DISPLAY "EXAMPLE  NOV 8,1960 = 11081960"
               GO TO PATTI.
           IF IN-FIELD-8 = SPACES MOVE ZEROS TO P-DOB
           GO TO PATDEE.
           IF IN-FIELD-8 NOT NUMERIC
               DISPLAY "DATE MUST BE NUMERIC"
           GO TO PATTI.
           MOVE IN-FIELD-8 TO INPUT-DATE.
           IF T-MM OF INPUT-DATE < 01 OR > 12
               DISPLAY "DATE MUST BE NUMERIC"
               GO TO PATTI.
           IF T-DD OF INPUT-DATE > DAYS-IN-MONTH(T-MM OF INPUT-DATE)
               DISPLAY "DATE MUST BE NUMERIC"
               GO TO PATTI.
           MOVE CORR INPUT-DATE TO TEST-DATE.
           MOVE TEST-DATE TO P-DOB GO TO PATDEE.
       2-MSTAT.
           IF IN-FIELD = "?"
               DISPLAY "ENTER M IF PATIENT IS MARRIED"
               DISPLAY "ENTER S IF PATIENT IS SINGLE"
           GO TO PATTI.
           IF IN-FIELD = "M" OR "S" MOVE IN-FIELD-1 TO P-MSTAT
           GO TO PATDEE.
           DISPLAY "INVALID" GO TO PATTI.
       PATDEE. EXIT.
       PATDEEX. GO TO PAT-CP.
       5000-WRITE-PATFILE.
           REWRITE PATFILE01 INVALID KEY DISPLAY "NO UPDATE."
           DISPLAY "THIS SHOULD NOT HAPPEN. CONTACT CMS."
           DISPLAY "THIS PROGRAM IS TERMINATED."
           GO TO 9100-CLOSE-MASTER-FILE.
           UNLOCK PATFILE RECORD
           DISPLAY "UPDATE MADE"  GO TO 1000-ACTION.
       PAT-CP-0. MOVE GARNO TO IN-FIELD
            IF GARNO = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
            OR "7" OR "8" OR "9" MOVE GARNO TO FLAG
            MOVE GAR-TAB(FLAG) TO IN-FIELD.
            MOVE IN-FIELD TO PATNO
            READ PATFILE WITH LOCK INVALID DISPLAY "INVALID"
           GO TO 1000-ACTION.
           IF PATFILE-STAT NOT = "00" 
           DISPLAY "PATFILE-STAT = " PATFILE-STAT 
           DISPLAY "IN USE AT THIS TIME"
           GO TO 1000-ACTION.
            DISPLAY PATNO " " PATNAME.
       PAT-CP.
           MOVE SPACES TO FIELD-CODE IN-FIELD.
           DISPLAY "FIELD CODE,DATA? DEPENDANT".
           ACCEPT DATAIN.
           IF DATAIN = "X"
               DISPLAY "NO CHANGE"  GO TO 1000-ACTION.
           IF DATAIN = "UP"  GO TO 5000-WRITE-PATFILE.
           IF DATAIN = "LP" PERFORM LP-2 GO TO PAT-CP.
           IF DATAIN = "?"
           DISPLAY "ENTER A FIELD CODE <COMMA> AND NEW DATA."
               DISPLAY "UP = UPDATE CHANGES"
           DISPLAY " X = NO CHANGE"
           DISPLAY "LP = LIST "
           DISPLAY "FIELD CODES: 2=GARNO   3=NAME    4=SEX"
           DISPLAY " 5=RELATE    6=M-STAT  7=DOB"
           GO TO PAT-CP.
           UNSTRING DATAIN DELIMITED BY "," INTO FIELD-CODE IN-FIELD.
           INSPECT FIELD-CODE REPLACING LEADING SPACE BY "0".
           IF FIELD-CODE NOT NUMERIC
               DISPLAY "FIELD-CODE MUST BE 2 DIGITS AND NUMERIC"
               GO TO PAT-CP.
           IF FIELD-CODE = "00"
               DISPLAY "FIELD CODE CANNOT BE ZERO OR BLANK"
               GO TO PAT-CP.
           IF ( FIELD-CODE > "01" AND  < "08" )
           MOVE FIELD-CODE TO NUM-2  
           SET PAT-INDX TO NUM-2
           GO TO PAT-GO-TO.
           DISPLAY "FIELD # MUST BE FROM 2-7".
           GO TO PAT-CP.
       LG-1.
           IF GARNO = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
           OR "7" OR "8" OR "9" MOVE GARNO TO FLAG
           MOVE GAR-TAB(FLAG) TO GARNO.
           READ GARFILE INVALID DISPLAY "INVALID" GO TO LG-1-EXIT.
           MOVE GARNO TO MPLR-KEY
           MOVE "1" TO TRINSIND
           READ MPLRFILE INVALID MOVE "0" TO TRINSIND.
       LG-1-0.
           MOVE DOB TO TEST-DATE
           MOVE T-MM OF TEST-DATE TO DD-MM
           MOVE T-DD OF TEST-DATE TO DD-DD
           MOVE T-CC OF TEST-DATE TO DD-CC
           MOVE T-YY OF TEST-DATE TO DD-YY
           INSPECT DD-MM REPLACING LEADING "0" BY " "
           INSPECT DD-DD REPLACING LEADING "0" BY " "
           DISPLAY  GARNO  " " DISPLAY-DATE " " GARNAME " " G-ACCT
           DISPLAY G-BILLADD
           DISPLAY STREET
           DISPLAY CITY " " STATE " " G-ZIP
           DISPLAY PHONE
           DISPLAY PRINS " " PR-ASSIGN " " PRIPOL " " PR-GROUP " "
           PR-RELATE " " PR-NAME
           DISPLAY SEINS " " SE-ASSIGN " " SECPOL " " SE-GROUP " "
           SE-RELATE " " SE-NAME
           IF (TRINSIND = "1") AND (TRINS NOT = "001")
           DISPLAY TRINS " " MPLR-TR-ASSIGN " " MPLR-TRIPOL " " 
           MPLR-TR-GROUP " " MPLR-TR-RELATE " " MPLR-TR-NAME.
           MOVE PR-GROUP TO GAPKEY
           READ GAPFILE INVALID
           MOVE SPACE TO GAP-NAME GAP-ADDR GAP-CITY GAP-STATE GAP-ZIP
           GAP-TYPE.
           MOVE SPACE TO ALF-4
           IF GAP-TYPE = "X" MOVE "CRSS" TO ALF-4.
           IF SEINS = "062"
           DISPLAY ALF-4 " " GAP-NAME " " GAP-ADDR " " GAP-CITY " "
           GAP-STATE " " GAP-ZIP.
           IF TRINSIND = "1" AND MPLR-NAME NOT = SPACE
           DISPLAY "WORK COMP ADDRESS"
           DISPLAY MPLR-NAME " " MPLR-STREET " " 
           MPLR-CITY " " MPLR-STATE " " MPLR-ZIP 
           DISPLAY "CLAIM # = " MPLR-CLAIMNO.
           IF G-ADDRCODE NOT = SPACE
           MOVE G-ADDRCODE TO ADDR-KEY
           READ ADDRFILE INVALID 
           DISPLAY G-ADDRCODE
           NOT INVALID
           DISPLAY ADDR-KEY " " ADDR-NAME " " ADDR-STREET " " 
           ADDR-CITY " " ADDR-STATE " " ADDR-ZIP 
           END-READ
           END-IF.
           MOVE SPACE TO COMP-KEY
           MOVE G-ACCT TO COMP-MEDREC
           START COMPFILE KEY NOT < COMP-KEY 
             INVALID 
               GO TO LG-1-2.
       LG-1-1.
           READ COMPFILE 
             NEXT 
               AT END 
                 GO TO LG-1-2.

           IF COMP-MEDREC = G-ACCT AND COMP-DATE = TEST-DATE
             GO TO LG-1-1.      
      
           IF COMP-MEDREC = G-ACCT
             MOVE COMP-DATE TO TEST-DATE
             MOVE CORR TEST-DATE TO DISPLAY-DATE-S
             DISPLAY DISPLAY-DATE-S " " COMP-NAME " " 
                COMP-ADDR1 " " COMP-ADDR2
             DISPLAY COMP-CITY " " COMP-STATE " " COMP-ZIP
             GO TO LG-1-1.     

       LG-1-2.     
           MOVE LASTBILL TO TEST-DATE-S
           MOVE T-MM OF TEST-DATE-S TO DD-MM
           MOVE T-DD OF TEST-DATE-S TO DD-DD
           MOVE T-CC OF TEST-DATE-S TO DD-CC
           MOVE T-YY OF TEST-DATE-S TO DD-YY
           IF LASTBILL NOT = "00000000"
           INSPECT DD-MM REPLACING LEADING "0" BY " "
           INSPECT DD-DD REPLACING LEADING "0" BY " ".
           DISPLAY "COLLT GENDER RELATE DUNNING ACCSTAT LASTBILL CYCLE"
           DISPLAY "  " COLLT "     " SEX "       " RELATE
           "      " DUNNING "        " ACCTSTAT
           "   " DISPLAY-DATE "  " BILLCYCLE.
           IF G-COPAY NOT = 0 MOVE G-COPAY TO NEF-D
           DISPLAY " CO-PAY =" NEF-D.
           DISPLAY G-PRGRPNAME " /// " G-SEGRPNAME.

       LG-1-EXIT.
           EXIT.

       ZZ-1.
           IF ZERO-FLAG = 1
           MOVE 0 TO ZERO-FLAG
           DISPLAY "DISPLAY ALL ACCTS " 
           ELSE MOVE 1 TO ZERO-FLAG
           DISPLAY "SHOW ONLY ACCTS WITH BALANCES.".
       
       NP-1.
           MULTIPLY NP BY -1 GIVING NP.
           IF NP = -1 DISPLAY "PROMPT FOR PATIENT ADD"
           ELSE DISPLAY "NO PATIENT PROMPT".
       LP-1.
           IF PATNO = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
           OR "7" OR "8" OR "9" MOVE PATNO TO FLAG
           MOVE GAR-TAB(FLAG) TO PATNO.
           READ PATFILE INVALID DISPLAY "INVALID" GO TO LP-1-EXIT.
           MOVE GUARNO TO GARNO.
           READ GARFILE INVALID MOVE "NO GARNO" TO GARNAME.
       LP-2.
           MOVE P-DOB TO TEST-DATE
           MOVE T-MM OF TEST-DATE TO DD-MM
           MOVE T-DD OF TEST-DATE TO DD-DD
           MOVE T-CC OF TEST-DATE TO DD-CC
           MOVE T-YY OF TEST-DATE TO DD-YY
           INSPECT DD-MM REPLACING LEADING "0" BY " "
           INSPECT DD-DD REPLACING LEADING "0" BY " "
           DISPLAY PATNO " " PATNAME
           DISPLAY "SX=" P-SEX " MS=" P-MSTAT " RE=" P-RELATE
           " DOB " DISPLAY-DATE
           DISPLAY "GUAR " GARNO " " GARNAME.
       LP-1-EXIT. EXIT.
       INS-1. DISPLAY "SEARCH TYPE"
           DISPLAY "1 = BY NUMBER "
           DISPLAY "2 = BY NAME"
           DISPLAY "3 = BY ASSIGNMENT CODE"
           DISPLAY "4 = BY NEIC CODE"
           DISPLAY "5 = BY NEIC ASSIGNM CODE"
           DISPLAY "6 = BY CLAIM-TYPE"
           DISPLAY "7 = BY CITY".
       INS-2.  ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "X = BACK OR 1-6 SEARCH METHOD"
           GO TO INS-2.
           IF IN-FIELD = "X" DISPLAY "END SEARCH" GO TO INS-1-EXIT.
           IF IN-FIELD = "1" OR "2" OR "3" OR "4" OR "5" OR "6" OR "7"
           NEXT SENTENCE ELSE DISPLAY "BAD" GO TO INS-2.
           MOVE IN-FIELD-1 TO ALF-1.
       INS-3. DISPLAY "STARTING POINT?".
           ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "ENTER WHERE TO START LOOKING"
           DISPLAY "BK = BACK TO SEARCH METHOD"
           DISPLAY "OR X = BACK TO OPTION" GO TO INS-3.
           IF IN-FIELD = "X" GO TO INS-1-EXIT.
           IF IN-FIELD = "BK" GO TO INS-1.
           MOVE 0 TO X
           IF ALF-1 = "1" MOVE SPACE TO RIGHT-3
           UNSTRING IN-FIELD DELIMITED BY " " INTO RIGHT-3
           INSPECT RIGHT-3 REPLACING LEADING " " BY "0"
           MOVE RIGHT-3 TO INS-KEY
           MOVE "NUMBER  " TO ALF-8
           START INSFILE KEY NOT < INS-KEY INVALID GO TO INS-1-END.
           IF ALF-1 = "2" MOVE IN-FIELD TO INS-NAME
           MOVE "NAME    " TO ALF-8
           START INSFILE KEY NOT < INS-NAME INVALID GO TO INS-1-END.
           IF ALF-1 = "3" MOVE IN-FIELD TO INS-ASSIGN
           MOVE "ASSIGNMT" TO ALF-8
           START INSFILE KEY NOT < INS-ASSIGN INVALID GO TO INS-1-END.
           IF ALF-1 = "4" MOVE IN-FIELD TO INS-NEIC
           MOVE "NEICCODE" TO ALF-8
           START INSFILE KEY NOT < INS-NEIC INVALID GO TO INS-1-END.
           IF ALF-1 = "5" MOVE IN-FIELD TO INS-NEIC-ASSIGN
           MOVE "NEICASGM" TO ALF-8
           START INSFILE KEY NOT < INS-NEIC-ASSIGN INVALID 
           GO TO INS-1-END.
           IF ALF-1 = "6" 
           MOVE IN-FIELD TO INS-CLAIMTYPE
           MOVE "CLM-TYPE" TO ALF-8
           START INSFILE KEY NOT < INS-CLAIMTYPE INVALID 
           GO TO INS-1-END.
           IF ALF-1 = "7" 
           MOVE IN-FIELD TO INS-CITY
           MOVE "CITY    " TO ALF-8
           START INSFILE KEY NOT < INS-CITY INVALID 
           GO TO INS-1-END.
       INS-4. 
           READ INSFILE NEXT AT END DISPLAY "END OF FILE"
           GO TO INS-1-EXIT.
           DISPLAY INS-KEY " " INS-NAME " " INS-ASSIGN " " INS-CLAIMTYPE
           " " INS-NEIC " " INS-STATUS " " INS-CITY " " INS-STREET
           ADD 1 TO X
           IF X > 8 
               MOVE 0 TO X 
               DISPLAY "BY " ALF-8 
               ACCEPT ANS
                 IF ANS NOT = SPACE 
                     GO TO INS-1-EXIT
                END-IF 
                   GO TO INS-4
           END-IF.
           GO TO INS-4.
       INS-1-END. 
           DISPLAY "END OF FILE".
       INS-1-EXIT. EXIT.
       FF-NAME. IF FFTAB10(X) NOT = SPACE MOVE X TO FF MOVE 1 TO X.
       LL-NAME. IF LLTAB24(X) NOT = SPACE MOVE X TO LL MOVE 1 TO X.
       AQ1. IF LLTAB24(Y) NOT = XLLTAB24(Y) MOVE 1 TO FLAGX.
       AQ2. IF XFFTAB10(Y) NOT = FFTAB10(Y) MOVE 1 TO FLAGX.
       FA-1.
           IF GARNO = "1" OR "2" OR "3" OR "4" OR "5" OR "6"
           OR "7" OR "8" OR "9" MOVE GARNO TO FLAG
           MOVE GAR-TAB(FLAG) TO GARNO.
           READ GARFILE INVALID DISPLAY "INVALID" GO TO FA-1-EXIT.
           MOVE DOB TO TEST-DATE
           MOVE T-MM OF TEST-DATE TO DD-MM
           MOVE T-DD OF TEST-DATE TO DD-DD
           MOVE T-CC OF TEST-DATE TO DD-CC
           MOVE T-YY OF TEST-DATE TO DD-YY
           INSPECT DD-MM REPLACING LEADING "0" BY " "
           INSPECT DD-DD REPLACING LEADING "0" BY " "
           DISPLAY GARNO " " PRINS "/" SEINS " " GARNAME
           DISPLAY DISPLAY-DATE " " PRIPOL " " SECPOL
           MOVE GARNO TO GUARNO
           START PATFILE KEY NOT < GUARNO INVALID GO TO FA-1-EXIT.
       FA-2. READ PATFILE NEXT AT END GO TO FA-1-EXIT.
           IF GUARNO NOT = GARNO GO TO FA-1-EXIT.
           MOVE P-DOB TO TEST-DATE
           MOVE T-MM OF TEST-DATE TO DD-MM
           MOVE T-DD OF TEST-DATE TO DD-DD
           MOVE T-CC OF TEST-DATE TO DD-CC
           MOVE T-YY OF TEST-DATE TO DD-YY
           INSPECT DD-MM REPLACING LEADING "0" BY " "
           INSPECT DD-DD REPLACING LEADING "0" BY " "
           DISPLAY PATNO " " DISPLAY-DATE " " P-SEX " " PATNAME  
           GO TO FA-2.
       FA-1-EXIT. EXIT.
       GAP-1. 
           DISPLAY "SEARCH TYPE".
           DISPLAY "1 = BY NUMBER "
           DISPLAY "2 = BY NAME"
           DISPLAY "3 = BY CITY"
           DISPLAY "4 = BY STATE".
       GAP-2.  ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "X = BACK OR 1-4 SEARCH METHOD"
           GO TO GAP-2.
           IF IN-FIELD = "X" DISPLAY "END SEARCH" GO TO GAP-1-EXIT.
           IF IN-FIELD = "1" OR "2" OR "3" OR "4" NEXT SENTENCE
           ELSE DISPLAY "BAD" GO TO GAP-2.
           MOVE IN-FIELD-1 TO ALF-1.
       GAP-3. DISPLAY "STARTING POINT?".
           ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "ENTER WHERE TO START LOOKING"
           DISPLAY "BK = BACK TO SEARCH METHOD"
           DISPLAY "OR X = BACK TO OPTION" GO TO GAP-3.
           IF IN-FIELD = "X" GO TO GAP-1-EXIT.
           IF IN-FIELD = "BK" GO TO GAP-1.
           MOVE 0 TO X
           IF ALF-1 = "1" MOVE SPACE TO RIGHT-7
           UNSTRING IN-FIELD DELIMITED BY " " INTO RIGHT-7
           INSPECT RIGHT-7 REPLACING LEADING " " BY "0"
           MOVE RIGHT-7 TO GAPKEY
           MOVE "NUMBER" TO ALF-6
           START GAPFILE KEY NOT < GAPKEY 
           INVALID GO TO GAP-3
           NOT INVALID GO TO GAP-4.
           IF ALF-1 = "2" MOVE IN-FIELD TO GAP-NAME
           MOVE "TITLE " TO ALF-6
           START GAPFILE KEY NOT < GAP-NAME 
           INVALID GO TO GAP-3
           NOT INVALID GO TO GAP-4.
           IF ALF-1 = "3" MOVE IN-FIELD TO GAP-CITY
           MOVE "CITY  " TO ALF-6
           START GAPFILE KEY NOT < GAP-CITY 
           INVALID GO TO GAP-3
           NOT INVALID GO TO GAP-4.
           MOVE IN-FIELD TO GAP-STATE
           MOVE "STATE " TO ALF-6
           START GAPFILE KEY NOT < GAP-STATE
           INVALID GO TO GAP-3.
       GAP-4. 
           READ GAPFILE NEXT AT END DISPLAY "END OF FILE"
                    GO TO GAP-1-EXIT
           END-READ
           MOVE GAP-ZIP TO ALF-5
           MOVE GAPKEY TO ALF-7
           INSPECT ALF-7 REPLACING LEADING "0" BY " "
           MOVE SPACE TO ALF-4
           IF GAP-TYPE = "X" 
              MOVE "CRSS" TO ALF-4
           END-IF
           MOVE GAP-NAME TO ALF20
           MOVE GAP-ADDR TO ALF20A
           DISPLAY ALF-4 " " ALF-7 " " ALF20 " " ALF20A " " GAP-CITY " "
           GAP-STATE " " ALF-5
           ADD 1 TO X
           IF X > 8 
                  MOVE 0 TO X 
                  DISPLAY "BY " ALF-6 
                  ACCEPT ANS
                    IF ANS NOT = SPACE 
                         GO TO GAP-1-EXIT
                    END-IF
           END-IF
           GO TO GAP-4.
       GAP-1-EXIT. 
           EXIT.
       SELECT-GAP. DISPLAY "MEDIGAP CODE".
           ACCEPT IN-FIELD
           IF IN-FIELD = "F" PERFORM GAP-1 THRU GAP-1-EXIT
           GO TO SELECT-GAP.
           IF IN-FIELD = "BK" GO TO SELECT-EXIT.
           IF IN-FIELD = "?" DISPLAY "F = SEARCH FOR A CODE"
           DISPLAY "BK = END SEARCHING" GO TO SELECT-GAP.
           MOVE SPACE TO RIGHT-7
           UNSTRING IN-FIELD DELIMITED BY " " INTO RIGHT-7
           INSPECT RIGHT-7 REPLACING LEADING " "  BY "0"
           MOVE RIGHT-7 TO GAPKEY
           READ GAPFILE INVALID DISPLAY "INVALID" GO TO SELECT-GAP.
           MOVE SPACE TO ALF-4
           IF GAP-TYPE = "X" MOVE "CRSS" TO ALF-4.
           MOVE GAP-ZIP TO ALF-5
           MOVE GAP-NAME TO ALF20
           MOVE GAP-ADDR TO ALF20A
           DISPLAY ALF-4 " "ALF20 " " ALF20A " " GAP-CITY " "
           GAP-STATE " " ALF-5
           DISPLAY "OK Y/N".
           ACCEPT ANS
           IF ANS NOT = "Y" GO TO SELECT-GAP.
           MOVE 0 TO FLAG.
       SELECT-EXIT.  EXIT.
       ADDR-1. DISPLAY "SEARCH TYPE"
           DISPLAY "1 = BY NUMBER "
           DISPLAY "2 = BY NAME"
           DISPLAY "3 = BY STREET"
           DISPLAY "4 = BY CITY"
           DISPLAY "5 = BY STATE"
           DISPLAY "6 = BY ZIP CODE".
       ADDR-2.  ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "X = BACK OR 1-6 SEARCH METHOD"
           GO TO ADDR-2.
           IF IN-FIELD = "X" DISPLAY "END SEARCH" GO TO ADDR-1-EXIT.
           IF IN-FIELD = "1" OR "2" OR "3" OR "4" OR "5" OR "6" 
           NEXT SENTENCE ELSE DISPLAY "BAD" GO TO ADDR-2.
           MOVE IN-FIELD-1 TO ALF-1.
       ADDR-3. DISPLAY "STARTING POINT?".
           ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "ENTER WHERE TO START LOOKING"
           DISPLAY "BK = BACK TO SEARCH METHOD"
           DISPLAY "OR X = BACK TO OPTION" GO TO ADDR-3.
           IF IN-FIELD = "X" GO TO ADDR-1-EXIT.
           IF IN-FIELD = "BK" GO TO ADDR-1.
           MOVE 0 TO X
           IF ALF-1 = "1" MOVE SPACE TO RIGHT-4
           UNSTRING IN-FIELD DELIMITED BY " " INTO RIGHT-4
           INSPECT RIGHT-4 REPLACING LEADING " " BY "0"
           MOVE RIGHT-4 TO ADDR-KEY
           MOVE "NUMBER  " TO ALF-8
           START ADDRFILE KEY NOT < ADDR-KEY INVALID GO TO ADDR-1-END.
           IF ALF-1 = "2" MOVE IN-FIELD TO ADDR-NAME
           MOVE "NAME    " TO ALF-8
           START ADDRFILE KEY NOT < ADDR-NAME INVALID GO TO ADDR-1-END.
           IF ALF-1 = "3" MOVE IN-FIELD TO ADDR-STREET
           MOVE "STREET  " TO ALF-8
           START ADDRFILE KEY NOT < ADDR-STREET INVALID 
           GO TO ADDR-1-END.
           IF ALF-1 = "4" MOVE IN-FIELD TO ADDR-CITY
           MOVE "CITY    " TO ALF-8
           START ADDRFILE KEY NOT < ADDR-CITY INVALID GO TO ADDR-1-END.
           IF ALF-1 = "5" MOVE IN-FIELD TO ADDR-STATE
           MOVE "STATE   " TO ALF-8
           START ADDRFILE KEY NOT < ADDR-STATE INVALID 
           GO TO ADDR-1-END.
           IF ALF-1 = "6" 
           MOVE IN-FIELD TO ADDR-ZIP
           MOVE "ZIP CODE" TO ALF-8
           START ADDRFILE KEY NOT < ADDR-ZIP INVALID 
           GO TO ADDR-1-END.
       ADDR-4. 
           READ ADDRFILE NEXT AT END 
                  DISPLAY "END OF FILE"
                  GO TO ADDR-1-EXIT
           END-READ
           DISPLAY ADDR-KEY " " ADDR-NAME " " ADDR-STREET " " ADDR-CITY
           " " ADDR-STATE " " ADDR-ZIP
           ADD 1 TO X
           IF X > 8 
                MOVE 0 TO X     
                DISPLAY "BY " ALF-8 
                ACCEPT ANS
                      IF ANS NOT = SPACE 
                         GO TO ADDR-1-EXIT
                      END-IF
           END-IF
           GO TO ADDR-4.
       ADDR-1-END. 
           DISPLAY "END OF FILE".
       ADDR-1-EXIT. EXIT.
       CAR-1. DISPLAY "SEARCH TYPE"
           DISPLAY "1 = BY NAME"
           DISPLAY "2 = BY CITY"
           DISPLAY "3 = BY STATE"
           DISPLAY "4 = BY CODE".
       CAR-2.
           ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "X = BACK OR 1-4 SEARCH METHOD"
           GO TO CAR-2.
           IF IN-FIELD = "X" DISPLAY "END SEARCH" GO TO CAR-1-EXIT.
           IF IN-FIELD = "1" OR "2" OR "3" OR "4" 
           NEXT SENTENCE ELSE DISPLAY "BAD" GO TO CAR-2.
           MOVE IN-FIELD-1 TO ALF-1.
       CAR-3. DISPLAY "STARTING POINT?".
           ACCEPT IN-FIELD.
           IF IN-FIELD = "?"
           DISPLAY "ENTER WHERE TO START LOOKING"
           DISPLAY "BK = BACK TO SEARCH METHOD"
           DISPLAY "OR X = BACK TO OPTION" GO TO CAR-3.
           IF IN-FIELD = "X" GO TO CAR-1-EXIT.
           IF IN-FIELD = "BK" GO TO CAR-1.
           MOVE 0 TO X
           IF ALF-1 = "1"
           MOVE IN-FIELD TO CAR-NAME
           MOVE "NAME    " TO ALF-8
           START CARRIERFILE KEY NOT < CAR-NAME INVALID GO TO CAR-1-END.
           IF ALF-1 = "2" MOVE IN-FIELD(1:20) TO CAR-CITY
           MOVE "CITY    " TO ALF-8
           START CARRIERFILE KEY NOT < CAR-CITY INVALID GO TO CAR-1-END.
           IF ALF-1 = "3" MOVE IN-FIELD(1:2) TO CAR-STATE
           MOVE "STATE   " TO ALF-8
           START CARRIERFILE KEY NOT < CAR-STATE
                          INVALID GO TO CAR-1-END.
           IF ALF-1 = "4" MOVE IN-FIELD(1:3) TO CAR-KEY
           MOVE "CODE    " TO ALF-8
           START CARRIERFILE KEY NOT < CAR-KEY INVALID GO TO CAR-1-END.
       CAR-4.
           READ CARRIERFILE NEXT AT END DISPLAY "END OF FILE"
           GO TO CAR-1-EXIT.
           DISPLAY CAR-KEY " " CAR-NAME " " CAR-CITY " " CAR-STATE
           ADD 1 TO X
           IF X > 8 MOVE 0 TO X DISPLAY "BY " ALF-8 ACCEPT ANS
           IF ANS NOT = SPACE GO TO CAR-1-EXIT.
           GO TO CAR-4.
       CAR-1-END. DISPLAY "END OF FILE".
       CAR-1-EXIT. EXIT.
       9100-CLOSE-MASTER-FILE.
           CLOSE GARFILE PATFILE GAPFILE INSFILE MPLRFILE
           TOWNADDR ADDRFILE CARRIERFILE COMPFILE.
           DISPLAY "GAR-PAT-INS-MPLR ROUTINE HAS ENDED".
           EXIT PROGRAM.
