       IDENTIFICATION DIVISION.
       PROGRAM-ID. nei011.
       AUTHOR. SID WAITE.
       DATE-COMPILED. TODAY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INSFILE ASSIGN TO "S30"     ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC        RECORD KEY IS INS-KEY
           ALTERNATE RECORD KEY IS INS-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-CITY WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-ASSIGN WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-CLAIMTYPE WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-NEIC WITH DUPLICATES
           ALTERNATE RECORD KEY IS INS-NEIC-ASSIGN WITH DUPLICATES.
           SELECT OUT ASSIGN TO "S35" ORGANIZATION
           LINE SEQUENTIAL.
           SELECT POSTDATE ASSIGN TO "S40" ORGANIZATION
           LINE SEQUENTIAL.
           SELECT PAYBACK ASSIGN TO "S45" ORGANIZATION
           LINE SEQUENTIAL.
           SELECT PARMFILE ASSIGN TO "S50" ORGANIZATION
           LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  INSFILE
     *     BLOCK CONTAINS 6 RECORDS
           DATA RECORD IS INSFILE01.
       01  INSFILE01.
           02 INS-KEY PIC XXX.
           02 INS-NAME PIC X(22).
           02 INS-STREET PIC X(24).
           02 INS-CITY PIC X(15).
           02 INS-STATE PIC XX.
           02 INS-ZIP PIC X(9).
           02 INS-ASSIGN PIC X.
           02 INS-CLAIMTYPE PIC X.
           02 INS-NEIC PIC X(5).
           02 INS-NEICLEVEL PIC X.
           02 INS-NEIC-ASSIGN PIC X.
           02 INS-PPO PIC X.
           02 INS-PRVNUM PIC X(10).
           02 INS-HMO PIC X(3).
           02 INS-STATUS PIC X.
           02 INS-LEVEL PIC X.
           02 INS-LASTDATE PIC X(8).
           02 INS-CAID PIC XXX.
           02 INS-REFWARN PIC X.
           02 INS-FUTURE PIC X(8).

       FD OUT.
       01  OUT01 PIC X(132).
       FD  POSTDATE.
       01 POSTDATE01 PIC X(8).
       FD  PAYBACK
           DATA RECORD IS PAYBACK01.
       01  PAYBACK01.
           02 PART2.
           03 PAYBACK-KEY.
             04 PD-KEY8 PIC X(8).
             04 PD-KEY3 PIC XXX.
           03 NAME PIC X(24).
           03 AMOUNT PIC S9(4)V99.
           03 PAYCODE PIC XXX.
           03 DENIAL PIC XX.
           03 CLAIM PIC X(6).
           03 DATE-T PIC X(8).
           02 PD-DATE-E PIC X(8).
           02 PD-ORDER PIC X(6).
           02 PD-BATCH PIC X(6).
       FD  PARMFILE.
       01  PARMFILE01.
           02 PF1 PIC X(9).
           02 PF2 PIC X(40).
       WORKING-STORAGE SECTION.
       01  PAY-CNT01.
           02 PAY-CNT PIC 99999 OCCURS 999 TIMES.
       01  PAY-AMT01.
           02 PAY-AMT PIC S9(8)V99 OCCURS 999 TIMES.
       01  CNT-TOT01.
           02 CNT-TOT PIC 99999 OCCURS 999 TIMES.
           02 AMT-TOT PIC S9(8)V99 OCCURS 999 TIMES.
       01  REDU-CNT01.
           02 REDU-CNT PIC 99999 OCCURS 999 TIMES.
       01  REDU-AMT01.
           02 REDU-AMT PIC S9(8)V99 OCCURS 999 TIMES.
       01  REDUCNT-TOT01.
           02 REDUCNT-TOT PIC 99999 OCCURS 999 TIMES.
       01  REDUAMT-TOT01.
           02 REDUAMT-TOT PIC S9(8)V99 OCCURS 999 TIMES.
       01  LINE-1.
           02 L1F1 PIC X(40).
           02 FILLER PIC XX VALUE SPACE.
           02 L1F2 PIC X(19) VALUE "PAYMENT DETAIL FOR ".
           02 L1F3 PIC X(14) VALUE "POSTING DATE  ".
           02 L1F4 PIC X(10).
           02 L1F5 PIC X(23) VALUE " FOR DATA BATCH DATE   ".
           02 L1F6 PIC X(10).
       01  LINE-2.
           02 L2F1 PIC X(8).
           02 FILLER PIC XX VALUE SPACE.
           02 L2F2 PIC X(24).
           02 FILLER PIC X VALUE SPACE.
           02 L2F3 PIC X(6).
           02 FILLER PIC X VALUE SPACE.
           02 L2F4 PIC XXX.
           02 FILLER PIC XX VALUE SPACE.
           02 L2F41 PIC XX.
           02 FILLER PIC XX VALUE SPACE.
           02 L2F5 PIC ZZ,ZZZ.99CR.
           02 FILLER PIC XXX VALUE SPACE.
           02 L2F51 PIC X(10).
           02 FILLER PIC XXX VALUE SPACE.
           02 L2F6 PIC X(10).
           02 FILLER PIC XXX VALUE SPACE.
           02 L2F7 PIC X(6).
       01 LINE-3.
           02 F31 PIC X VALUE "(".
           02 L3F1 PIC ZZZ.
           02 F32 PIC XX VALUE ") ".
           02 L3F2 PIC X(18).
           02 F23 PIC X(12) VALUE SPACE.
           02 L3F3 PIC ZZZ9.
           02 F24 PIC XXX VALUE SPACE.
           02 L3F4 PIC ZZ,ZZZ,ZZ9.99CR.
       01  LINE-4.
           02 F41 PIC X(11).
           02 L4F1 PIC X(10).
           02 F42 PIC X(13) VALUE SPACE.
           02 L4F2 PIC ZZ,ZZ9.
           02 F43 PIC XXX VALUE SPACE.
           02 L4F3 PIC ZZ,ZZZ,ZZ9.99CR.
       01 LINE-5.
           05 F51 PIC X(4) VALUE SPACE.
           05 L5F1 PIC X(9) VALUE "PAYORCODE".
           05 F52 PIC X(22) VALUE SPACE.
           05 L5F3 PIC X(6) VALUE "NUMBER".
           05 F54 PIC X(10) VALUE SPACE.
           05 L5F4 PIC X(6) VALUE "AMOUNT".
           05 F55 PIC XX VALUE SPACE.
           05 L5F5 PIC XX/XX/XX.
       01  LINE-6.
           02 F61 PIC X(8) VALUE "ACCT. # ".
           02 F62 PIC X(16) VALUE "  GUARANTOR NAME".
           02 F63 PIC X(11) VALUE SPACE.
           02 F64 PIC X(5) VALUE "CLAIM".
           02 F65 PIC X(4) VALUE "  PC".
           02 F651 PIC X(5) VALUE "   DN".
           02 F66 PIC X(11) VALUE "     AMOUNT".
           02 FILLER PIC XXX VALUE SPACE.
           02 F67 PIC X(12) VALUE "  PAY DATE  ".
           02 FILLER PIC XXX VALUE SPACE.
           02 F68 PIC X(12) VALUE "BATCH DATE  ".
           02 FILLER PIC XXX VALUE SPACE.
           02 F69 PIC X(4) VALUE "TIME".
       01  HOLD-DATE PIC X(8).
       01  TEST-DATE-S.
           02 T-CC PIC XX.
           02 T-YY PIC XX.
           02 T-MM PIC XX.
           02 T-DD PIC XX.
       01  INPUT-DATE-S.
           02 T-MM PIC XX.
           02 FILLER PIC X VALUE "/".
           02 T-DD PIC XX.
           02 FILLER PIC X VALUE "/".
           02 T-CC PIC XX.
           02 T-YY PIC XX.
       01  X PIC 999.
       01  Y PIC 9999.
       01  NUM3 PIC 999.
       01  Z PIC 999.
       01  PARTCNT PIC 9999 VALUE 0.
       01  PARTPAY PIC S9(8)V99 VALUE 0.
       01  ADJ-CNT PIC 9999.
       01  ADJ-AMT PIC S9(8)V99.
       01  START-DATE PIC X(8).
       01  DOT01 PIC X(48).
       01  ALF-8.
           02 ALF-81 PIC XX.
           02 ALF-82 PIC X(6).
       PROCEDURE DIVISION.
       0005-START.
           PERFORM B1 VARYING Y FROM 1 BY 1 UNTIL Y > 999.
           MOVE ALL " -" TO DOT01.
           OPEN INPUT POSTDATE PAYBACK PARMFILE INSFILE.
           OPEN OUTPUT OUT.
           READ PARMFILE.
           MOVE PF2 TO L1F1.
           READ POSTDATE.
           MOVE POSTDATE01 TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO INPUT-DATE-S
           MOVE INPUT-DATE-S TO L1F4.
       P1-0. READ PAYBACK AT END 
           MOVE SPACE TO L1F6 L2F6 HOLD-DATE START-DATE
           MOVE L1F4 TO L1F6 L2F6
           WRITE OUT01 FROM LINE-1 AFTER PAGE
           WRITE OUT01 FROM LINE-6 AFTER 2
           GO TO P5.
           MOVE PD-DATE-E TO START-DATE. GO TO P1-1.
       P1. READ PAYBACK AT END GO TO P5.
       P1-1.
           MOVE PD-DATE-E TO HOLD-DATE
           MOVE SPACE TO L1F6 L2F6
           MOVE PD-DATE-E TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO INPUT-DATE-S
           MOVE INPUT-DATE-S TO L1F6 L2F6.
           WRITE OUT01 FROM LINE-1 AFTER PAGE
           WRITE OUT01 FROM LINE-6 AFTER 2
           GO TO P4.
       P2. READ PAYBACK AT END GO TO P5.
       P4. IF PD-DATE-E NOT = HOLD-DATE PERFORM A3
           WRITE OUT01 FROM LINE-1 AFTER 3
           WRITE OUT01 FROM LINE-6 AFTER 2.
           MOVE PAYCODE TO X.
           IF DENIAL = "14" ADD 1 TO REDU-CNT(X)
           ADD AMOUNT TO REDU-AMT(X) ELSE
           ADD 1 TO PAY-CNT(X) ADD AMOUNT TO PAY-AMT(X).
           MOVE PD-KEY8 TO L2F1
           MOVE NAME TO L2F2
           MOVE CLAIM TO L2F3
           MOVE PAYCODE TO L2F4
           MOVE DENIAL TO L2F41
           MOVE AMOUNT TO L2F5
           MOVE DATE-T TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO INPUT-DATE-S.
           MOVE INPUT-DATE-S TO L2F51
           MOVE PD-ORDER TO L2F7.
           WRITE OUT01 FROM LINE-2. GO TO P2.
           MOVE 0 TO PARTPAY PARTCNT.
       A3. WRITE OUT01 FROM LINE-1 AFTER 3.
           WRITE OUT01 FROM LINE-5 AFTER 2.
           MOVE 0 TO ADJ-CNT ADJ-AMT.
           MOVE L2F6 TO L4F1.
           PERFORM B3 VARYING Y FROM 1 BY 1 UNTIL Y > 999.
           WRITE OUT01 FROM DOT01.
           MOVE "TOTAL ADJ." TO F41.
           MOVE ADJ-CNT TO L4F2
           MOVE ADJ-AMT TO L4F3.
           WRITE OUT01 FROM LINE-4.
           COMPUTE ADJ-CNT = PARTCNT - ADJ-CNT.
           COMPUTE ADJ-AMT = PARTPAY - ADJ-AMT.
           MOVE "TOTAL CASH" TO F41.
           MOVE ADJ-CNT TO L4F2
           MOVE ADJ-AMT TO L4F3.
           WRITE OUT01 FROM LINE-4.
           WRITE OUT01 FROM DOT01.
           MOVE PARTCNT TO L4F2
           MOVE PARTPAY TO L4F3
           MOVE "TOTALS FOR" TO F41
           WRITE OUT01 FROM LINE-4
           WRITE OUT01 FROM DOT01.
           WRITE OUT01 FROM DOT01.
           MOVE SPACE TO L1F6 L2F6
           MOVE PD-DATE-E TO ALF-8 HOLD-DATE
      *     IF ALF-81 NOT = "19"
      *     MOVE PD-DATE-E TO L1F6 L2F6 ELSE
           MOVE PD-DATE-E TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO INPUT-DATE-S
           MOVE INPUT-DATE-S TO L1F6 L2F6.
           MOVE 0 TO PARTCNT PARTPAY ADJ-CNT ADJ-AMT.
       B1. MOVE 0 TO PAY-CNT(Y) PAY-AMT(Y) CNT-TOT(Y) AMT-TOT(Y)
           REDU-CNT(Y) REDU-AMT(Y) REDUCNT-TOT(Y) REDUAMT-TOT(Y).
       B2. MOVE 0 TO PAY-CNT(Y) PAY-AMT(Y) REDU-CNT(Y) REDU-AMT(Y).
       B3. IF PAY-CNT(Y) > 0 OR REDU-CNT(Y) > 0
           MOVE PAY-CNT(Y) TO L3F3
           MOVE PAY-AMT(Y) TO L3F4
           MOVE Y TO L3F1
           COMPUTE NUM3 = Y
           MOVE NUM3 TO INS-KEY
           MOVE "***BAD CODE***" TO INS-NAME
           READ INSFILE
           MOVE INS-NAME TO L3F2
           ADD PAY-CNT(Y) TO PARTCNT CNT-TOT(Y)
           ADD PAY-AMT(Y) TO PARTPAY AMT-TOT(Y)
           ADD REDU-CNT(Y) TO PARTCNT REDUCNT-TOT(Y)
           ADD REDU-AMT(Y) TO PARTPAY REDUAMT-TOT(Y)
           WRITE OUT01 FROM LINE-3.
           IF REDU-CNT(Y) > 0
           MOVE REDU-CNT(Y) TO L3F3
           MOVE REDU-AMT(Y) TO L3F4
           MOVE "REDUCTION" TO L3F2
           ADD REDU-CNT(Y) TO ADJ-CNT
           ADD REDU-AMT(Y) TO ADJ-AMT
           MOVE SPACE TO F31 F32
           MOVE 0 TO L3F1
           WRITE OUT01 FROM LINE-3
           MOVE "(" TO F31
           MOVE ")" TO F32.
           IF (Y > 6 AND < 20 ) AND ( Y NOT = 18 )
           ADD PAY-CNT(Y) TO ADJ-CNT
           ADD PAY-AMT(Y) TO ADJ-AMT.
           MOVE 0 TO PAY-CNT(Y) PAY-AMT(Y) REDU-CNT(Y) REDU-AMT(Y).
       B4. IF CNT-TOT(Y) > 0 OR REDUCNT-TOT(Y) > 0
           ADD CNT-TOT(Y) TO PARTCNT ADD AMT-TOT(Y) TO PARTPAY
           ADD REDUCNT-TOT(Y) TO PARTCNT ADD REDUAMT-TOT(Y) TO PARTPAY
           MOVE CNT-TOT(Y) TO L3F3
           MOVE AMT-TOT(Y) TO L3F4
           MOVE Y TO L3F1
           COMPUTE NUM3 = Y
           MOVE NUM3 TO INS-KEY
           MOVE "***BAD CODE***" TO INS-NAME
           READ INSFILE
           MOVE INS-NAME TO L3F2
           WRITE OUT01 FROM LINE-3.
           IF REDUCNT-TOT(Y) > 0
           MOVE REDUCNT-TOT(Y) TO L3F3
           MOVE REDUAMT-TOT(Y) TO L3F4
           MOVE "REDUCTION" TO L3F2
           ADD REDUCNT-TOT(Y) TO ADJ-CNT
           ADD REDUAMT-TOT(Y) TO ADJ-AMT
           MOVE SPACE TO F31 F32
           MOVE 0 TO L3F1
           WRITE OUT01 FROM LINE-3
           MOVE "(" TO F31
           MOVE ")" TO F32.
           IF (Y > 6 AND < 20 ) AND ( Y NOT = 18 )
           ADD CNT-TOT(Y) TO ADJ-CNT
           ADD AMT-TOT(Y) TO ADJ-AMT.
       P5. PERFORM A3. IF START-DATE = HOLD-DATE GO TO P6.
           MOVE "TOTALS  " TO L1F6.
           WRITE OUT01 FROM LINE-1 AFTER 3.
           WRITE OUT01 FROM LINE-5 AFTER 2.
           MOVE 0 TO ADJ-CNT ADJ-AMT PARTCNT PARTPAY.
           MOVE "POSTING " TO L4F1.
           PERFORM B4 VARYING Y FROM 1 BY 1 UNTIL Y > 999.
           WRITE OUT01 FROM DOT01.
           MOVE "TOTAL ADJ." TO F41.
           MOVE ADJ-CNT TO L4F2
           MOVE ADJ-AMT TO L4F3.
           WRITE OUT01 FROM LINE-4.
           COMPUTE ADJ-CNT = PARTCNT - ADJ-CNT.
           COMPUTE ADJ-AMT = PARTPAY - ADJ-AMT.
           MOVE "TOTAL CASH" TO F41.
           MOVE ADJ-CNT TO L4F2
           MOVE ADJ-AMT TO L4F3.
           WRITE OUT01 FROM LINE-4.
           MOVE ALL " -" TO OUT01.
           WRITE OUT01 FROM DOT01.
           MOVE PARTCNT TO L4F2
           MOVE PARTPAY TO L4F3
           MOVE "TOTALS FOR" TO F41
           WRITE OUT01 FROM LINE-4
           WRITE OUT01 FROM DOT01.
           WRITE OUT01 FROM DOT01.
       P6.
           CLOSE OUT. STOP RUN.
