       01  PROCFILE01.
           02 PROC-KEY. 
              03 PROC-KEY1 PIC X(5).
              03 PROC-KEY2 PIC XX.
           02 PROC-OLD PIC X(7).
           02 PROC-TYPE PIC X.
           02 PROC-BCBS PIC X(4).
           02 PROC-TITLE PIC X(28).
           02 PROC-AMOUNT PIC 9(4)V99.
           02 CARE-AMOUNT PIC 9(4)V99.
       