       01  ADDRFILE01.
           02 ADDR-KEY PIC X(4). 
           02 ADDR-NAME PIC X(22).
           02 ADDR-STREET PIC X(24).
           02 ADDR-CITY PIC X(15).
           02 ADDR-STATE PIC XX.
           02 ADDR-ZIP PIC X(9).
           02 ADDR-FUTURE PIC X(6).