       01  COMPFILE01.
           02 COMP-KEY.
             03 COMP-MEDREC PIC X(8).
             03 COMP-DATE   PIC X(8).
             03 COMP-PROC PIC X(4).
           02 COMP-NAME     PIC X(25).
           02 COMP-CONTACT  PIC X(25).
           02 COMP-ADDR1    PIC X(20).
           02 COMP-ADDR2    PIC X(15).
           02 COMP-CITY     PIC X(20).
           02 COMP-STATE    PIC XX.
           02 COMP-ZIP      PIC X(10).
           02 COMP-PHONE    PIC X(12).
