       01  EMAILAUTHFILE01.
           02 EA-KEY PIC 9(6).
           02 EA-MEDREC PIC X(8).
           02 EA-NAME PIC X(24).
      * 38     
           02 EA-EMAIL PIC X(30).
           02 EA-AUTH PIC X(20).
      * 88     
           02 EA-DATE-E PIC X(8).
           02 EA-SSN PIC X(9).