       01  KINFILE01.
           02 KINFILE-KEY.
             03 KIN-KEY8 PIC X(8).
             03 KIN-KEY3 PIC XXX.
           02 KIN-NAME PIC X(24).
           02 KIN-AMOUNT PIC S9(4)V99.
           02 KIN-PAYCODE PIC XXX.
           02 KIN-DENIAL PIC XX.
           02 KIN-DATE-T PIC X(8).
           02 KIN-DATE-E PIC X(8).
           02 KIN-STAT PIC X.
           02 KIN-CHARCUR-KEY PIC X(11).