       01  PROCFILE01.
           02 PROC-KEY.
               03 PROC-CDM PIC X(4).
               03 PROC-CPT PIC X(5).
               03 PROC-MOD PIC X(2).
           02 PROC-TYPE PIC X.
           02 PROC-TITLE PIC X(28).
           02 PROC-AMOUNT PIC 9(4)V99.