       01  RPGPROCFILE01.
      	   02 RPGPROC-KEY.
	           03 RPGPROC-KEY1 PIC X(7).
	           03 RPGPROC-KEY2 PIC X(4).
	         02 RPGPROC-TYPE PIC X.
	         02 RPGPROC-TITLE. 
	           03 RPG-NT1 PIC X(4).
	           03 RPG-NT2 PIC X(24).
	         02 RPGPROC-AMOUNT PIC 9(4)V99.

