       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEI007.
       AUTHOR. SID WAITE.
       DATE-COMPILED. TODAY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BATCHFILE ASSIGN TO "S180" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS BATCH-KEY
           ALTERNATE RECORD KEY IS BA-NAME WITH DUPLICATES
           ALTERNATE RECORD KEY IS BA-DATE-A WITH DUPLICATES
           ALTERNATE RECORD KEY IS BA-STAT WITH DUPLICATES
           STATUS IS BATCH-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  BATCHFILE
           BLOCK CONTAINS 5 RECORDS
           DATA RECORD IS BATCHFILE01.
       01  BATCHFILE01.
           02 BATCH-KEY PIC X(6).
           02 BA-NAME PIC X(10).
           02 BA-DATE-A PIC X(8).
           02 BA-DATE-C PIC X(8).
           02 BA-AMT PIC S9(8)V99.
           02 BA-STAT  PIC X.
       WORKING-STORAGE SECTION.
       01  BATCH-STATUS PIC XX.
       01  ANS PIC X(20).
       01  DISP-DATE.
           05 T-MM PIC 99.
           05 FILLER PIC X VALUE "/".
           05 T-DD PIC 99.
           05 FILLER PIC X VALUE "/".
           05 T-CC PIC 99.
           05 T-YY PIC 99.
       01  TEST-DATE-S.
           05 T-CC  PIC 99.
           05 T-YY  PIC 99.
           05 T-MM  PIC 99.
           05 T-DD  PIC 99.
       01  H-YMM PIC XXX.
       01  H-NUM PIC XXX.
       01  NUM3 PIC 999.
       01  BA-NUM PIC XXX.
       01  BA-YMM.
           02 BA-Y PIC X.
           02 BA-MM PIC XX.
       01  ALF8 PIC X(8).
       LINKAGE SECTION.
       01 CURRENT-BATCH PIC X(6).
       01 CBN PIC X(10).
       PROCEDURE DIVISION USING CURRENT-BATCH CBN.
       P0. OPEN I-O BATCHFILE.
           IF CURRENT-BATCH = "000000" MOVE SPACE TO CBN.
       P1.  DISPLAY "OPTION ID  BATCHES".
            ACCEPT ANS
            IF ANS = "?"
           DISPLAY "1 = LIST OPEN BATCHES"
           DISPLAY "2 = CLOSE CURRENT BATCH"
           DISPLAY "3 = ADD A NEW BATCH NUMBER"
           DISPLAY "4 = RE-OPEN A PREVIOUSLY CLOSED BATCH"
           DISPLAY "5 = SET THE CURRENT BATCH NUMBER"
           DISPLAY "6 = LIST ALL BATCHES FROM STARTING POINT"
           DISPLAY "9 = END"
           DISPLAY "LB =  LIST THE CURRENT BATCH "
           GO TO P1.
           IF ANS = "LB" AND CURRENT-BATCH = "000000"
           DISPLAY "CURRENT BATCH NOT SET!" GO TO P1.
           IF ANS = "LB"
           DISPLAY "CURRENT BATCH = " CURRENT-BATCH " " BA-NAME
           GO TO P1.
           IF ANS = "1" GO TO L1.
           IF ANS = "2" GO TO C1.
           IF ANS = "3" GO TO A1.
           IF ANS = "4" GO TO O1.
           IF ANS = "5" GO TO S1.
           IF ANS = "6" GO TO F1.
           IF ANS = "9" GO TO P10.
           DISPLAY "INVALID" GO TO P1.
       L1. MOVE "0" TO BA-STAT
           START BATCHFILE KEY NOT < BA-STAT INVALID
           DISPLAY "NO BATCH RECORDS FOUND" GO TO P1.
       L2. READ BATCHFILE NEXT AT END GO TO P1.
           IF BA-STAT NOT = "0" GO TO P1.
           PERFORM DB1 GO TO L2.
       C1. IF CURRENT-BATCH = "000000"
           DISPLAY "THE CURRENT BATCH HAS NOT BEEN SET YET!"
           GO TO P1.
           MOVE CURRENT-BATCH TO BATCH-KEY
           READ BATCHFILE WITH LOCK INVALID
           DISPLAY "THE CURRENT BATCH NUMBER IS INVALID"
           DISPLAY "THIS SHOULD NOT HAPPEN!. CALL CMS FOR HELP"
           GO TO P1.
           IF BA-STAT NOT = "0" DISPLAY "THE CURRENT BATCH"
           DISPLAY "IS CLOSED ALREADY!" GO TO P1.
           IF BATCH-STATUS = "61"
           DISPLAY "RECORD IS BEING USED" GO TO P1.
       C2. PERFORM DB1
           DISPLAY " "
           DISPLAY "CLOSE THIS BATCH  Y/N"
           ACCEPT ANS
           IF ANS = "Y" OR "N" NEXT SENTENCE ELSE GO TO C2.
           IF ANS = "N" DISPLAY "BATCH NOT CLOSE" GO TO P1.
           MOVE "1" TO BA-STAT
           ACCEPT BA-DATE-C FROM DATE
           REWRITE BATCHFILE01
           UNLOCK BATCHFILE RECORD
           MOVE SPACE TO CURRENT-BATCH CBN
           DISPLAY "BATCH IS CLOSED" GO TO P1.
       A1. DISPLAY "ENTER A BATCH REPORTING YR/MM (FORMAT YMM)"
           DISPLAY "WHERE YMM IS THE YEAR/MONTH"
           DISPLAY "THIS BATCH IS TO BE REPORTED IN."
           DISPLAY "THE DECADE IS ASSUMED, SO ONLY ONE YR DIGIT"
           DISPLAY "IS NEEDED"
           DISPLAY "310 =  OCTOBER, 1993"
           DISPLAY "X TO RETURN TO THE COMMAND LINE"
           ACCEPT ANS
           IF ANS = "X" OR "BK" DISPLAY "NO BATCH ADDED"
           GO TO P1.
           MOVE ANS TO BA-YMM
           DISPLAY  BA-YMM
           IF BA-Y NOT NUMERIC DISPLAY "INVALID" GO TO A1.
           IF BA-MM NOT NUMERIC DISPLAY "INVALID" GO TO A1.
           IF BA-MM < "01" OR > "12" DISPLAY "INVALID" GO TO A1.
           IF BA-YMM < "310" DISPLAY "NO BATCH EARLIER THAN 10/93"
           DISPLAY "WILL BE ALLOWED" GO TO A1.
           MOVE SPACE TO BA-NUM
           READ BATCHFILE INVALID GO TO A1-0.
           DISPLAY "THIS MONTH HAS BEEN CLOSED"
           DISPLAY "AND CAN NOT RE USED AGAIN"
           GO TO A1.
       A1-0.
           MOVE "000" TO BA-NUM H-NUM
           MOVE BA-YMM TO H-YMM
           START BATCHFILE KEY > BATCH-KEY INVALID GO TO A3.
       A2. READ BATCHFILE NEXT AT END GO TO A3.
           IF BA-YMM = H-YMM  MOVE BA-NUM TO H-NUM
           GO TO A2.
       A3. MOVE H-NUM TO NUM3
           IF NUM3 = 999 DISPLAY "NO MORE BATCHES"
           DISPLAY "CAN BE ADDED TO " BA-YMM GO TO P1.
           ADD 1 TO NUM3
           MOVE NUM3 TO BA-NUM
           ACCEPT BA-DATE-A FROM DATE
           MOVE "00000000" TO BA-DATE-C
           MOVE 0 TO BA-AMT
           MOVE "0" TO BA-STAT.
       A4.
           DISPLAY "GIVE A NAME TO THE BATCH"
           DISPLAY "SO YOU MAY IDENTIFY IT AS YOUR DATA ENTRY."
           DISPLAY " ----------"
           ACCEPT ANS
           IF ANS = "?" DISPLAY "THE PAYMENT RECONCILIATION"
           DISPLAY "ROUTINE WILL DISPLAY THIS NAME!"
           DISPLAY "X TO RETURN TO THE COMMAND LINE"
           GO TO A4.
           IF ANS = "X" GO TO P1.
           MOVE ANS TO BA-NAME.
           WRITE BATCHFILE01 INVALID DISPLAY "INVALID BATCH RECORD"
           DISPLAY BATCH-KEY " " BA-NAME
           GO TO P1.
           UNLOCK BATCHFILE RECORD
           MOVE BATCH-KEY TO CURRENT-BATCH
           MOVE BA-NAME TO CBN
           DISPLAY "BATCH ADDED AND SET TO CURRENT BATCH".
           GO TO P1.
       O1. DISPLAY "ENTER THE BATCH NUMBER YOU WISH TO RE-OPEN"
           ACCEPT ANS
           IF ANS = "?" DISPLAY "YMMNNN FORMAT WHERE NNN = NUMBER"
           DISPLAY "X TO CANCEL COMMAND"
           GO TO O1.
           IF ANS = "X" GO TO P1.
           MOVE ANS TO BATCH-KEY
           READ BATCHFILE WITH LOCK INVALID DISPLAY "INVALID"
           GO TO O1.
           IF BATCH-STATUS = "61" DISPLAY "THIS BATCH IS IN USE"
           GO TO P1.
           IF BA-STAT = "0" DISPLAY "THIS BATCH IS ALREADY OPEN!"
           GO TO P1.
           IF BA-STAT = "3" DISPLAY "THIS BATCH HAS BEEN PERMANENTLY"
           DISPLAY "CLOSED AND IS NOT AVAILABLE TO USE AGAIN!"
           GO TO P1.
           DISPLAY BATCH-KEY " " BA-NAME
           MOVE "0" TO BA-STAT
           REWRITE BATCHFILE01
           DISPLAY "REOPENED AND SET AS THE CURRENT BATCH"
           MOVE BATCH-KEY TO CURRENT-BATCH
           GO TO P1.
       S1. DISPLAY "ENTER THE 6-DIGIT BATCH NUMBER (YMM###)."
           ACCEPT ANS
           IF ANS = "?"
           DISPLAY "SELECT FROM LIST OF OPEN BATCHES"
           DISPLAY "X TO RETURN TO THE COMMAND LINE"
           GO TO S1.
           IF ANS = "X" GO TO P1.
           MOVE ANS TO BATCH-KEY
           READ BATCHFILE INVALID DISPLAY "BATCH NOT ON FILE"
           GO TO S1.
           IF BA-STAT = "0"
           DISPLAY BATCH-KEY " " BA-NAME
           DISPLAY "CURRENT BATCH SET TO " BATCH-KEY
           MOVE BATCH-KEY TO CURRENT-BATCH
           GO TO P1.
           IF BA-STAT = "1"
           PERFORM DB1
           MOVE BA-DATE-C TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO DISP-DATE
           DISPLAY "BATCH CLOSED " DISP-DATE
           GO TO S1.
       DB1. MOVE BA-DATE-A TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO DISP-DATE
           DISPLAY BATCH-KEY " " BA-NAME " DATE-ADDED " DISP-DATE
           "   " BA-STAT.
       F1. DISPLAY "STARTING POINT"
           ACCEPT ANS
           IF ANS = "?" DISPLAY "ENTER ANY PART OF YMM### "
           DISPLAY "X TO RETURN THE COMMAND LINE"
           GO TO F1.
           IF ANS = "X" GO TO P1.
           MOVE ANS TO BATCH-KEY
           START BATCHFILE KEY NOT < BATCH-KEY INVALID
           DISPLAY "NO BATCHES FOUND FROM THIS POINT ON"
           GO TO F1.
           MOVE 0 TO NUM3.
       F2. READ BATCHFILE NEXT AT END GO TO P1.
           MOVE BA-DATE-A TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO DISP-DATE
           MOVE DISP-DATE TO ALF8
           MOVE BA-DATE-C TO TEST-DATE-S
           MOVE CORR TEST-DATE-S TO DISP-DATE
           DISPLAY BATCH-KEY " " BA-NAME "  ADD=" ALF8 " CLOSE="
           DISP-DATE "   " BA-STAT.
           ADD 1 TO NUM3
           IF NUM3 > 8 ACCEPT ANS
           MOVE 0 TO NUM3
           IF ANS = SPACE GO TO F2.
           GO TO F2.
       P10. CLOSE BATCHFILE
           IF CURRENT-BATCH NOT = "000000"
           MOVE BA-NAME TO CBN.
            EXIT PROGRAM.
