       IDENTIFICATION DIVISION.
       PROGRAM-ID. RPG052.
       AUTHOR. SID WAITE.
       DATE-COMPILED. TODAY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PROCFILE ASSIGN TO "S30" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS PROC-KEY
           LOCK MODE MANUAL.
           SELECT PROCFILEX ASSIGN TO "S35" ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC RECORD KEY IS PROC-KEYX
           LOCK MODE MANUAL.

           SELECT FILEOUT ASSIGN TO "S40" ORGANIZATION
           LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  PROCFILE
           DATA RECORD PROCFILE01.
       01  PROCFILE01.
           02 PROC-KEY.
             03 PROC-KEY1 PIC X(4).
             03 PROC-KEY2 PIC X(7).
           02 PROC-TYPE PIC X.
           02 PROC-TITLE PIC X(28).
           02 PROC-AMOUNT PIC 9(4)V99.
       
       FD  PROCFILEX
           DATA RECORD PROCFILE01X.
       01  PROCFILE01X.
           02 PROC-KEYX.
             03 PROC-KEY2X PIC X(7).
             03 PROC-KEY1X PIC X(4).
           02 PROC-TYPEX PIC X.
           02 PROC-TITLEX PIC X(28).
           02 PROC-AMOUNTX PIC 9(4)V99.
       FD  FILEOUT.
       01  FILEOUT01 PIC X(80).
       WORKING-STORAGE SECTION.
       01  ANS PIC X.
       01  NEF-8  PIC Z,ZZZ.99.
       01  NEF-8X PIC Z,ZZZ.99.
       01  NEW-TITLE.
           02 NT-1 PIC X(4).
           02 NT-2 PIC X(24).
       PROCEDURE DIVISION.
       0005-START.
           OPEN INPUT PROCFILE I-O PROCFILEX.
           OPEN OUTPUT FILEOUT.
       P1. READ PROCFILE NEXT AT END GO TO P4.
           IF PROC-AMOUNT = 0 OR PROC-TYPE NOT = "5" GO TO P1.
           MOVE PROC-KEY2 TO PROC-KEY2X
           MOVE SPACE TO PROC-KEY1X
           START PROCFILEX KEY NOT < PROC-KEYX
           INVALID GO TO P3.
       P2. READ PROCFILEX NEXT WITH LOCK AT END GO TO P3.
           IF PROC-KEY2X = PROC-KEY2 
             IF PROC-AMOUNT > PROC-AMOUNTX 
              MOVE PROC-AMOUNT TO NEF-8
              MOVE PROC-AMOUNTX TO NEF-8X
              MOVE SPACE TO FILEOUT01
              STRING PROC-KEY " " NEF-8 " " PROC-TITLE 
              DELIMITED BY "!!" INTO FILEOUT01
              DISPLAY FILEOUT01
              COMPUTE PROC-AMOUNTX = PROC-AMOUNT
              REWRITE PROCFILE01X
             END-IF
           END-IF
            GO TO P2.
             MOVE PROC-AMOUNT TO NEF-8
             MOVE PROC-AMOUNTX TO NEF-8X
             MOVE SPACE TO FILEOUT01
             STRING PROC-KEY " " NEF-8 " " PROC-TITLE 
             DELIMITED BY "!!" INTO FILEOUT01
             WRITE FILEOUT01
             STRING PROC-KEYX " " NEF-8X " " PROC-TITLEX
             DELIMITED BY "!!" INTO FILEOUT01
             WRITE FILEOUT01
             ACCEPT ANS
             GO TO P1
           GO TO P1.
       P3. 
           MOVE PROCFILE01 TO PROCFILE01X
           MOVE PROC-TITLE TO NT-2
           MOVE PROC-KEY1 TO NT-1
           MOVE NEW-TITLE TO PROC-TITLEX
           MOVE SPACE TO PROC-KEY1X
           MOVE PROC-KEY2 TO PROC-KEY2X
      *     WRITE  PROCFILE01X INVALID CONTINUE.
           WRITE FILEOUT01 FROM PROCFILE01X.
           GO TO P1.
       P4. CLOSE PROCFILE PROCFILEX FILEOUT. 
           STOP RUN.
